////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

// Процедура - обработчик события "ПередОткрытием" формы
//
Процедура ПередОткрытием(Отказ, СтандартнаяОбработка)
	
	Отказ = Истина;

	СтроковоеПредставлениеТипаОбъекта = Строка(ТипЗнч(ЭтотОбъект));
	КлючеваяФразаРУ = "Внешний отчет объект";
	КлючеваяФразаУК = "Зовнішній звіт об`єкт";
	ЭтоВнешняяОбработка =  (Лев(СтроковоеПредставлениеТипаОбъекта, СтрДлина(КлючеваяФразаРУ)) = КлючеваяФразаРУ)
						ИЛИ(Лев(СтроковоеПредставлениеТипаОбъекта, СтрДлина(КлючеваяФразаУК)) = КлючеваяФразаУК);
						
	// Если отчет встроенный или открывается уже зарегистрированный отчет из справочника "Регламентированные отчеты" 
	Если Не ЭтоВнешняяОбработка ИЛИ мПолноеИмяФайлаВнешнейОбработки <> Неопределено Тогда
		Сообщить(НСтр("ru='Данный отчет носит служебный характер и не предназначен для самостоятельного использования!';uk='Даний звіт носить службовий характер і не призначений для самостійного використання!'"));	
		Возврат;
	КонецЕсли;
	
	// Необходимо зарегистрировать внешнюю обработку
	Если РегламентированнаяОтчетность.ПроверкаРегистрацииПриОткрытииОсновнойФормыРегламентированногоОтчета(ЭтотОбъект, Ложь) Тогда
		ТекстПредупреждения = НСтр("ru='Внешний отчет успешно загружен в информационную базу.';uk='Зовнішній звіт успішно завантажений в інформаційну базу.'");
		
		Если Не ПолучитьПараметрыРаботыЗвит1С().ХранитьКешВСправочникеРегОтчетов Тогда
			// Переподключение менеджера FREDO Звіт реализовано одновременно с хранением кеша в справочнике рег.отчетов
			// т.к. это недилимые опреации
			ТекстПредупреждения = ТекстПредупреждения + Символы.ПС + Символы.ПС +
			                      НСтр("ru='ИЗМЕНЕНИЯ ВСТУПЯТ В СИЛУ ТОЛЬКО ПОСЛЕ ПОВТОРНОГО ОТКРЫТИЯ ПРОГРАММЫ!';uk='ЗМІНИ НАБУДУТЬ ЧИННОСТІ ТІЛЬКИ ПІСЛЯ ПОВТОРНОГО ВІДКРИТТЯ ПРОГРАМИ!'");
		КонецЕсли;
		Предупреждение(ТекстПредупреждения);

	КонецЕсли;
	
КонецПроцедуры
