
Процедура СправочникСписокПриАктивизацииСтроки(Элемент)
	
	ЭлементыФормы.СправочникДерево.ТекущаяСтрока = ЭлементыФормы.СправочникСписок.ТекущийРодитель;
	
КонецПроцедуры

Процедура СправочникСписокСтатьяДекларацииПоНалогуНаПрибыльНачалоВыбора(Элемент, СтандартнаяОбработка)
		
	НазваниеНалоговойДекларации 	= Перечисления.ВидыНалоговыхДеклараций.ДекларацияПоНалогуНаПрибыльНКУ;      
	
	РаботаСДиалогами.НачалоВыбораСтатьяНалоговойДекларации(Элемент, СтандартнаяОбработка, НазваниеНалоговойДекларации);

КонецПроцедуры

Процедура СправочникСписокСтатьяДекларацииПоНалогуНаПрибыльАвтоПодборТекста(Элемент, Текст, ТекстАвтоПодбора, СтандартнаяОбработка)
	
	НазваниеНалоговойДекларации 	= Перечисления.ВидыНалоговыхДеклараций.ДекларацияПоНалогуНаПрибыльНКУ;      

	РаботаСДиалогами.АвтоПодборТекстаСтатьяНалоговойДекларации(ЭтаФорма, Элемент, Текст, ТекстАвтоПодбора ,СтандартнаяОбработка, 
											  НазваниеНалоговойДекларации);

КонецПроцедуры

Процедура СправочникСписокСтатьяДекларацииПоНалогуНаПрибыльОкончаниеВводаТекста(Элемент, Текст, Значение, СтандартнаяОбработка)
	
	НазваниеНалоговойДекларации 	= Перечисления.ВидыНалоговыхДеклараций.ДекларацияПоНалогуНаПрибыльНКУ;      
	
	РаботаСДиалогами.ОкончаниеВводаТекстаСтатьяНалоговойДекларации(Элемент, Текст, Значение, СтандартнаяОбработка, 
												  НазваниеНалоговойДекларации);
												  
КонецПроцедуры

