Процедура ПриОткрытии()
	Если ЯвляетсяВзысканием <> Истина И ЯвляетсяПоощрением <> Истина Тогда
		ЯвляетсяПоощрением = Истина;
		ВидРасчета = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ПустаяСсылка();
	КонецЕсли;
КонецПроцедуры

Процедура ЯвляетсяПоощрениемПриИзменении(Элемент)
	
	Если ЯвляетсяПоощрением Тогда
		ЯвляетсяВзысканием = Ложь;
	Иначе
		ЯвляетсяВзысканием = Истина;
	КонецЕсли;
	
	УстановитьТипВидаРасчета();
	
КонецПроцедуры

Процедура ЯвляетсяВзысканиемПриИзменении(Элемент)
	
	Если ЯвляетсяВзысканием Тогда
		ЯвляетсяПоощрением = Ложь;
	Иначе
		ЯвляетсяПоощрением = Истина;
	КонецЕсли;
	
	УстановитьТипВидаРасчета();
	
КонецПроцедуры

Процедура УстановитьТипВидаРасчета()
	Если ЯвляетсяПоощрением Тогда
		ВидРасчета = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ПустаяСсылка();
	Иначе
		ВидРасчета = ПланыВидовРасчета.УдержанияОрганизаций.ПустаяСсылка();
	КонецЕсли;	
КонецПроцедуры

