////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

// Процедура - обработчик события "ПриОткрытии" формы
//
Процедура ПриОткрытии()
    Если РегистрСведенийСписок.Отбор.ФизЛицо.Использование и ЗначениеЗаполнено(РегистрСведенийСписок.Отбор.ФизЛицо.Значение) Тогда
		ЭлементыФормы.РегистрСведенийСписок.Колонки.ФизЛицо.Видимость = Ложь
	КонецЕсли;
КонецПроцедуры

// Процедура - обработчик события "ОбновлениеОтображения" формы
//
Процедура ОбновлениеОтображения()
	Если РегистрСведенийСписок.Отбор.ФизЛицо.Использование Тогда
		Заголовок = "Сведения о кандидате: " + ?(НЕ ЗначениеЗаполнено(РегистрСведенийСписок.Отбор.ФизЛицо.Значение),"<не указан>",РегистрСведенийСписок.Отбор.ФизЛицо.Значение.Наименование)
	Иначе
		Заголовок = "Регистр сведений о кандидатах";
		Если Не ЭлементыФормы.РегистрСведенийСписок.Колонки.ФизЛицо.Видимость Тогда
			ЭлементыФормы.РегистрСведенийСписок.Колонки.ФизЛицо.Видимость = Истина
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры


