
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

Процедура РегистрСведенийСписокПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	Ссылка = Справочники.ФизическиеЛица.ПустаяСсылка();
	Если ЭлементыФормы.РегистрСведенийСписок.ТекущиеДанные <> Неопределено Тогда
		Ссылка = ЭлементыФормы.РегистрСведенийСписок.ТекущиеДанные.ФизЛицо	
	КонецЕсли;
	Оповестить("ОбновитьФорму", Новый Структура("ИмяЭлемента","СемейноеПоложение"),Ссылка);

КонецПроцедуры

Процедура РегистрСведенийСписокПослеУдаления(Элемент)

	Ссылка = Справочники.ФизическиеЛица.ПустаяСсылка();
	Если Отбор.ФизЛицо.Использование Тогда
		Ссылка = Отбор.ФизЛицо.Значение
	КонецЕсли;
	Оповестить("ОбновитьФорму", Новый Структура("ИмяЭлемента","СемейноеПоложение"), Ссылка);

КонецПроцедуры

Процедура РегистрСведенийСписокПериодПриИзменении(Элемент)
	Если Элемент.Значение > РабочаяДата Тогда
		Ответ = Вопрос(НСтр("ru='Вы действительно хотите ввести данные';uk='Ви дійсно хочете ввести дані'") + Символы.ПС + НСтр("ru='о семейном положении физлица на будущую дату?';uk='про сімейний стан фізособи на майбутню дату?'"), РежимДиалогаВопрос.ДаНет,,КодВозвратаДиалога.Нет);
		Если Ответ = КодВозвратаДиалога.Нет Тогда
			Элемент.Значение = РабочаяДата
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
