
// объект для поиска данных
Перем мПоискОбъектовВСпискахДанных;

////////////////////////////////////////////////////////////////////////////////
// ДОПОЛНИТЕЛЬНЫЕ ПРОЦЕДУРЫ

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ДЕЙСТВИЯ КОМАНДНЫХ ПАНЕЛЕЙ ФОРМЫ

Процедура ДействияФормыДействиеПечать(Кнопка)
	
	Если ЭлементыФормы.СправочникСписок.ТекущаяСтрока = Неопределено тогда
		Возврат
	КонецЕсли;

	ЭлементыФормы.СправочникСписок.ТекущаяСтрока.Ссылка.ПолучитьОбъект().ПечатьДанныхФизЛица();
	
КонецПроцедуры

Процедура СправочникСписокПриАктивизацииСтроки(Элемент)
	
	ЭлементыФормы.СправочникДерево.ТекущаяСтрока = ЭлементыФормы.СправочникСписок.ТекущийРодитель;
	
КонецПроцедуры

Процедура УДФОткрыть(Кнопка)
	
	Форма = Обработки.УправлениеДаннымиРаботника.ПолучитьФорму();
	ТекущиеДанные = ЭлементыФормы.СправочникСписок.ТекущиеДанные;
	Если Не ТекущиеДанные = Неопределено Тогда
		Форма.УстановитьРеквизиты(ТекущиеДанные.Ссылка, "Основное", НачалоМесяца(ТекущаяДата()));
	Иначе
		Форма.УстановитьРеквизиты(Справочники.ФизическиеЛица.ПустаяСсылка(), "Основное", НачалоМесяца(ТекущаяДата()));
	КонецЕсли;	
		
	Форма.Открыть();
	
КонецПроцедуры // УДФОткрыть()

Процедура ДействияФормыНачальныйСтаж(Кнопка)
	
	Форма = РегистрыСведений.НачальныеСведенияОСтажеРаботниковОрганизации.ПолучитьФорму("ФормаСписка");
	Форма.ЭлементыФормы.Сотрудники.Значение.Отбор.Наименование.Значение = ЭлементыФормы.СправочникСписок.ТекущаяСтрока.Наименование;
	Форма.ЭлементыФормы.Сотрудники.Значение.Отбор.Наименование.Использование = Истина;
	Форма.Открыть();
	
КонецПроцедуры

Процедура ДействияФормыПраваДоступаПользователейКТекущемуЭлементу(Кнопка)
	
	Если Не ЭлементыФормы.СправочникСписок.ТекущиеДанные = Неопределено Тогда
		НастройкаПравДоступа.РедактироватьПраваДоступа(ЭлементыФормы.СправочникСписок.ТекущиеДанные.Ссылка);
	КонецЕсли;
	
КонецПроцедуры

Процедура ДействияФормыПраваДоступаПользователейКоВсемуСправочнику(Кнопка)
	
	НастройкаПравДоступа.РедактироватьПраваДоступа(Справочники.ФизическиеЛица.ПустаяСсылка());
	
КонецПроцедуры

// перед открытием
Процедура ПередОткрытием(Отказ, СтандартнаяОбработка)
	
	мПоискОбъектовВСпискахДанных.ЗаполнитьСписокЗначенийОтборовДанных(ЭлементыФормы.ТипПоискаДанных.СписокВыбора);
	мПоискОбъектовВСпискахДанных.ВосстановитьНастройки(ЭлементыФормы.ТипПоискаДанных);
	мПоискОбъектовВСпискахДанных.ВосстановитьСписокОтбораДанных();
	
КонецПроцедуры

// Обработчик события ОбработкаОповещения формы.
//
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ЗакрытиеФормыПоиска"
		И Источник = ЭтаФорма Тогда
		
		// обновляем выпадающий список настроек отбора данных
		мПоискОбъектовВСпискахДанных.ЗаполнитьСписокЗначенийОтборовДанных(ЭлементыФормы.ТипПоискаДанных.СписокВыбора);
	
	КонецЕсли;
    		
КонецПроцедуры

// при закрытии формы
Процедура ПриЗакрытии()
	
	мПоискОбъектовВСпискахДанных.СохранитьНастройки();
	
КонецПроцедуры


//УНИВЕРСАЛЬНЫЙ ПОИСК ОБЪЕКТОВ
///////////////////////////////////////////////////////////////////////////////

// Процедура - обработчик события ПриИзменении элемента управления ЗначениеОтбораСпискаФизЛиц.
//
Процедура ЗначениеОтбораСпискаФизЛицПриИзменении(Элемент)
	
	мПоискОбъектовВСпискахДанных.ЗначениеОтбораПоискаданныхПриИзменении(Элемент, ЗначениеОтбораСпискаФизЛиц);
				
КонецПроцедуры

// Процедура - обработчик события АвтоПодборТекста элемента управления ЗначениеОтбораСпискаФизЛиц.
//
Процедура ЗначениеОтбораСпискаФизЛицАвтоПодборТекста(Элемент, Текст, ТекстАвтоПодбора, СтандартнаяОбработка)
	
	мПоискОбъектовВСпискахДанных.АвтоПодборТекстаПоиска(Элемент, Текст, ТекстАвтоПодбора, СтандартнаяОбработка);
			
КонецПроцедуры

// при выводе строки списка
Процедура СписокПриВыводеСтроки(Элемент, ОформлениеСтроки, ДанныеСтроки)
	
	мПоискОбъектовВСпискахДанных.СписокПриВыводеСтрокиСпискаОтбораДанных(Элемент, ОформлениеСтроки, ДанныеСтроки);
			
КонецПроцедуры

Процедура ТипПоискаДанныхОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	// обработка выбора элемента из списка
	мПоискОбъектовВСпискахДанных.ОбработатьВыборТипаОграниченияИзСписка(ЭтаФорма, Элемент, ВыбранноеЗначение, 
		СтандартнаяОбработка, ЗначениеОтбораСпискаФизЛиц);
	
КонецПроцедуры

// кнопка открытия насчтройки
Процедура ТипПоискаДанныхОткрытие(Элемент, СтандартнаяОбработка)
	
	мПоискОбъектовВСпискахДанных.НастройкаОтбораДанныхОткрытие(ЗначениеОтбораСпискаФизЛиц, Элемент, СтандартнаяОбработка, ЭтаФорма);
	
КонецПроцедуры


мПоискОбъектовВСпискахДанных = МодульПоискаВДанных.СоздатьОбъектПоискаДанныхДляФизЛиц(ЭлементыФормы.ЗначениеОтбораСпискаФизЛиц, 
	ЭлементыФормы.СправочникСписок, СправочникСписок);

