
Перем мКнопкаПереключенияРежима;

Перем мПустаяКартинка;

// Устанавливает режим списка справочника, или выбора номенклатуры контрагента
//
Процедура УстановитьРежимОтображенияФормы()

	Если мКнопкаПереключенияРежима.Пометка Тогда
		ЭлементыФормы.ПанельТабличныхПолей.ТекущаяСтраница = ЭлементыФормы.ПанельТабличныхПолей.Страницы.ВыборНоменклатурыКонтрагента;
		ЭлементыФормы.ДействияФормы.ИсточникДействий = ЭлементыФормы.СписокНоменклатурыКонтрагента;
	Иначе
		ЭлементыФормы.ПанельТабличныхПолей.ТекущаяСтраница = ЭлементыФормы.ПанельТабличныхПолей.Страницы.ВыборНоменклатуры;
		ЭлементыФормы.ДействияФормы.ИсточникДействий = ЭлементыФормы.СправочникСписок;
	КонецЕсли;
	
	ЭлементыФормы.ДействияФормы.ЦветФона = ЦветаСтиля.ЦветФонаКнопки;
	
КонецПроцедуры




// Процедура - обработчик события "ПриАктивизацииСтроки" элемента СправочникСписок.
//
Процедура СправочникСписокПриАктивизацииСтроки(Элемент)

	ЭлементыФормы.СправочникДерево.ТекущаяСтрока = ЭлементыФормы.СправочникСписок.ТекущийРодитель;

КонецПроцедуры // СправочникСписокПриАктивизацииСтроки()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

// Процедура - обработчик события "ПриОткрытии" формы.
//
Процедура ПриОткрытии()

	Если НЕ ЗначениеЗаполнено(КонтрагентОтбораНоменклатуры) Тогда
		мКнопкаПереключенияРежима.Доступность = Ложь;
		мКнопкаПереключенияРежима.Пометка = Ложь;
	Иначе
		мКнопкаПереключенияРежима.Доступность = Истина;
		Если УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОткрыватьФормуВыбораСправочникаНоменклатураСОтборомПоПоставщику") = Истина Тогда
			мКнопкаПереключенияРежима.Пометка = Истина;
		КонецЕсли;
		СписокНоменклатурыКонтрагента.Отбор.Контрагент.Значение = КонтрагентОтбораНоменклатуры;
		СписокНоменклатурыКонтрагента.Отбор.Контрагент.Использование = Истина;
		ЭлементыФормы.СписокНоменклатурыКонтрагента.НастройкаОтбора.Контрагент.Доступность = Ложь;
	КонецЕсли;
	
	УстановитьРежимОтображенияФормы();
	
КонецПроцедуры // ПриОткрытии()


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ КОМАНДНЫХ ПАНЕЛЕЙ ФОРМЫ

// Процедура - обработчик события "Нажатие" элемента формы ДействияФормы.НоменклатураКонтрагента.
//
Процедура ДействияФормыНоменклатураКонтрагента(Кнопка)
	
	мКнопкаПереключенияРежима.Пометка = НЕ мКнопкаПереключенияРежима.Пометка;
	УстановитьРежимОтображенияФормы();
	
КонецПроцедуры

// Процедура - обработчик события "Нажатие" элемента формы ДействияФормы.Действие.
//
Процедура ДействияФормыДействие(Кнопка)
	
	Если мКнопкаПереключенияРежима.Пометка Тогда
		Если ЭлементыФормы.СписокНоменклатурыКонтрагента.ТекущиеДанные = Неопределено Тогда
			Возврат;
		КонецЕсли;
		НоменклатураВыбора = ЭлементыФормы.СписокНоменклатурыКонтрагента.ТекущиеДанные.Номенклатура;
	Иначе
		Если ЭлементыФормы.СправочникСписок.ТекущиеДанные = Неопределено Тогда
			Возврат;
		КонецЕсли;
		НоменклатураВыбора = ЭлементыФормы.СправочникСписок.ТекущиеДанные.Ссылка;
	КонецЕсли;
	
	Если ТипЗнч(ЭтаФорма.ВладелецФормы) = Тип("ПолеВвода") Тогда
		Если НоменклатураВыбора.ЭтоГруппа И ЭтаФорма.ВладелецФормы.ВыборГруппИЭлементов = ИспользованиеГруппИЭлементов.Элементы Тогда
			Возврат;
		КонецЕсли; 
	КонецЕсли; 
	
	ОповеститьОВыборе(НоменклатураВыбора);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ



// Процедура - обработчик события "Нажатие" элемента формы ОсновноеИзображениеКонтрагента.
//
Процедура ОсновноеИзображениеКонтрагентаНажатие(Элемент)
	
	ТекущиеДанныеСписка = ЭлементыФормы.СписокНоменклатурыКонтрагента.ТекущиеДанные;
	
	Если ТекущиеДанныеСписка = Неопределено Тогда
		Предупреждение(НСтр("ru='Укажите в списке элемент номенклатуры!';uk='Вкажіть у списку елемент номенклатури!'"));
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ТекущиеДанныеСписка.Номенклатура) ИЛИ ТекущиеДанныеСписка.Номенклатура.ЭтоГруппа Тогда
		Предупреждение(НСтр("ru='Укажите в списке элемент номенклатуры!';uk='Вкажіть у списку елемент номенклатури!'"));
		Возврат;
	КонецЕсли;
	
	Если ТекущиеДанныеСписка.Номенклатура.ОсновноеИзображение.Пустая() Тогда
		Предупреждение(НСтр("ru='Основное изображение номенклатуры не задано!';uk='Основне зображення номенклатури не задано!'"));
		Возврат;
	КонецЕсли;
	
	РаботаСФайлами.ОткрытьФормуИзображения(ЭтаФорма, ТекущиеДанныеСписка.Номенклатура.ОсновноеИзображение, ТекущиеДанныеСписка.Номенклатура);
	
КонецПроцедуры

// Процедура - обработчик события "Выбор" элемента формы СписокНоменклатурыКонтрагента.
//
Процедура СписокНоменклатурыКонтрагентаВыбор(Элемент, ВыбраннаяСтрока, Колонка, СтандартнаяОбработка)
	
	Если ВыбраннаяСтрока <> Неопределено Тогда
		ОповеститьОВыборе(ВыбраннаяСтрока.Номенклатура);
	КонецЕсли; 
	
КонецПроцедуры

мПустаяКартинка = Новый Картинка;

мКнопкаПереключенияРежима = ЭлементыФормы.ДействияФормы.Кнопки.Подменю.Кнопки.НоменклатураКонтрагента;


