
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

Процедура ПриОткрытии()
	
	Если Отбор.Организация.Значение.Пустая() Тогда
		Отбор.Организация.Значение = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"),"ОсновнаяОрганизация");
	КонецЕсли;	
	Отбор.Организация.Использование = Не Отбор.Организация.Значение.Пустая();
	
КонецПроцедуры


Процедура ПриЗакрытии()
	
	Если Не ЭтаФорма.ВладелецФормы = Неопределено И ТипЗнч(ЭтаФорма.ВладелецФормы.ЭтотОбъект) = Тип("СправочникОбъект.ПодразделенияОрганизаций") Тогда
		Оповестить("ОбновитьНадписьОтражениеВБухучете");
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЧНОГО ПОЛЯ РегистрСведенийСписок

Процедура РегистрСведенийСписокПриВыводеСтроки(Элемент, ОформлениеСтроки, ДанныеСтроки)
	
	Если НЕ ЗначениеЗаполнено(ДанныеСтроки.СпособОтраженияВБухучете) Тогда
		ОформлениеСтроки.Ячейки.СпособОтраженияВБухучете.Текст = НСтр("ru='<как задано для предприятия в целом>';uk='<як задано для підприємства в цілому>'");	
	КонецЕсли;
	
КонецПроцедуры


