////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ МОДУЛЯ

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

// Процедура - обработчик события "Перед открытием" формы отчета.
//
Процедура ПередОткрытием(Отказ, СтандартнаяОбработка)

	// Установим дату начала отчета
	Если ЗначениеЗаполнено(глЗначениеПеременной("глТекущийПользователь")) Тогда
		ДатаАктуальности = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнаяДатаНачалаОтчетов");
		Организация = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнаяОрганизация");
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(ДатаАктуальности) Тогда
		ДатаАктуальности = РабочаяДата
	КонецЕсли;
	
	ВидОтчета = "СтруктураПодразделений";

КонецПроцедуры // ПередОткрытием()

// Процедура - обработчик события "При открытии" формы отчета.
//
Процедура ПриОткрытии()

	Если НЕ ВладелецФормы = Неопределено Тогда
		
		ЕстьОшибки = Ложь;
		СформироватьОтчет(ЭлементыФормы.ДокументРезультат, ЕстьОшибки);
		Если ЕстьОшибки Тогда
			Сообщить("Ошибки...");
		КонецЕсли;

	КонецЕсли;

КонецПроцедуры // ПриОткрытии()

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ КОМАНДНЫХ ПАНЕЛЕЙ

// Процедура - обработчик нажатия кнопки "Сформировать"
//
Процедура КнопкаСформироватьНажатие(Элемент)

	Если НЕ ЗначениеЗаполнено(ЭтотОбъект.Организация) Тогда
		Предупреждение(НСтр("ru='Не выбрана организация!';uk='Не обрана організація!'"));
		Возврат;
	КонецЕсли;	
		
	СформироватьОтчет(ЭлементыФормы.ДокументРезультат, ЭлементыФормы.ДействияФормы.Кнопки.Заголовок.Пометка);

КонецПроцедуры // КнопкаСформироватьНажатие()

Процедура ДействияФормыНастройка(Кнопка)
	
	ФормаНастройка = ПолучитьФорму("ФормаНастройки", ЭтаФорма);

	РезультатОткрытия = ФормаНастройка.ОткрытьМодально();

	СформироватьОтчет(Элементыформы.ДокументРезультат, ЭлементыФормы.ДействияФормы.Кнопки.Заголовок.Пометка)

КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ДИАЛОГА

Процедура ВидОтчетаПриИзменении(Элемент)
	
	СформироватьСписокПоказателей();
	Если ЗначениеЗаполнено(ЭтотОбъект.Организация) Тогда
		КнопкаСформироватьНажатие(Элемент);
	КонецЕсли;	
	
КонецПроцедуры

Процедура ДействияФормыЗаголовок(Кнопка)
	
	ЭлементыФормы.ДействияФормы.Кнопки.Заголовок.Пометка = НЕ ЭлементыФормы.ДействияФормы.Кнопки.Заголовок.Пометка;
	КнопкаСформироватьНажатие(Кнопка);
	
КонецПроцедуры



