
Процедура ПриОткрытии()
	
	// устанавливаем возможность сортировки
	ЭлементыФормы.РегистрСведенийСписок.НастройкаПорядка.ХешRU.Доступность    = Истина;
	ЭлементыФормы.РегистрСведенийСписок.НастройкаПорядка.ТекстRU.Доступность  = Истина;
	ЭлементыФормы.РегистрСведенийСписок.НастройкаПорядка.ТекстUK.Доступность  = Истина;
	
КонецПроцедуры // ПриОткрытии()

Процедура ДействияФормыПерезаполнитьПоМакету(Кнопка)
	Локализация.ОбновитьРегистрСведенийПереводыТекстовИзМакетаНачальногоЗаполнения();
КонецПроцедуры // ДействияФормыПерезаполнитьПоМакету

Процедура ДействияФормыОбновитьХеши(Кнопка)
	Локализация.ОбновитьХешиРегистраСведенийПереводыТекстов();
КонецПроцедуры // ДействияФормыОбновитьХеши

Процедура ДействияФормыЗагрузитьТекстыИзМетаданных(Кнопка)
	Локализация.ЗагрузитьТекстыИзМетаданных();
КонецПроцедуры // ДействияФормыЗагрузитьТекстыИзМетаданных

Процедура ДействияФормыВывестиНовые(Кнопка)
	
	Макет = РегистрыСведений.ПереводыТекстов.ПолучитьМакет("НачальноеЗаполнение");
	КоличествоЗаписей = Макет.ВысотаТаблицы;
	ОбластьРесурсов = Макет.ПолучитьОбласть("Ресурсы");
	
	ТаблицаМакета = Новый ТаблицаЗначений;
	
	ТаблицаМакета.Колонки.Добавить("ТекстRU");
	
	Для Сч = 2 По КоличествоЗаписей Цикл
		
		ТекстRU = СокрЛП(ОбластьРесурсов.Область(Сч, 1).Текст);
		// ТекстUK = СокрЛП(ОбластьРесурсов.Область(Сч, 2).Текст);
		
		НоваяСтрока = ТаблицаМакета.Добавить();
		
		НоваяСтрока.ТекстRU = ТекстRU;
		
	КонецЦикла;	
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "
	|ВЫБРАТЬ
	| 	ПереводыТекстов.ТекстRU КАК ТекстRU
	|ИЗ 
	|	РегистрСведений.ПереводыТекстов КАК ПереводыТекстов
	|
	|";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если ТаблицаМакета.Найти(Выборка.ТекстRU, "ТекстRU") = Неопределено Тогда
			Сообщить(Выборка.ТекстRU);
		КонецЕсли;	
	КонецЦикла;	
	
КонецПроцедуры // ДействияФормыВывестиНовые
