
Процедура КнопкаВыполнитьНажатие(Кнопка)
	Если Не ЗначениеЗаполнено(Сотрудник) Тогда Сообщить("Не выбран сотрудник!"); Возврат; КонецЕсли;
	
	лЗапрос = Новый Запрос("ВЫБРАТЬ МАКСИМУМ(ДокТЧ.Ссылка) КАК Ссылка ИЗ Документ.ПриемНаРаботуВОрганизацию.РаботникиОрганизации КАК ДокТЧ ГДЕ ДокТЧ.Ссылка.Проведен и ДокТЧ.Сотрудник = &Сотрудник");
	лЗапрос.УстановитьПараметр("Сотрудник", Сотрудник);
	лВыборка = лЗапрос.Выполнить().Выбрать();
	Если Не лВыборка.Следующий() Тогда
		Сообщить("Не найден приказ о приеме на работу для сотрудника - " + Сотрудник);
		Возврат;
	Иначе
		Если лВыборка.Ссылка = Null Тогда
			Сообщить("Не найден приказ о приеме на работу для сотрудника - " + Сотрудник);
			Возврат;
		КонецЕсли;
	КонецЕсли;
	СсылкаНаОбъект = лВыборка.Ссылка;
	Объект = лВыборка.Ссылка;
	ТабДокумент = Печать();
	ЭтоДокумент = Истина;
	ТабДокумент.АвтоМасштаб = Истина;
	УниверсальныеМеханизмы.НапечататьДокумент(ТабДокумент, 1, Ложь, ОбщегоНазначения.СформироватьЗаголовокДокумента(Объект.Ссылка), Объект.Ссылка);
КонецПроцедуры
