Перем мСведенияОСчетах;
Перем мСведенияОСтатьяхЗатрат;

Процедура РегистрРасчетаСписокПриВыводеСтроки(Элемент, ОформлениеСтроки, ДанныеСтроки)
		
	СведенияОСчете = БухгалтерскийУчет.ПолучитьСведенияОСчете(мСведенияОСчетах, ДанныеСтроки.СчетДт);
	БухгалтерскийУчет.НазначитьВидимостьСубконто(ОформлениеСтроки, "Дт", СведенияОСчете);
	
	// кроме того, назначим видимость колонке СпособРаспределенияЗатрат
	СведенияОСтатьеЗатрат = БухгалтерскийУчет.ПолучитьСведенияОСтатьеЗатратПоСтроке(мСведенияОСтатьяхЗатрат, "Дт", ДанныеСтроки);
	ОформлениеСтроки.Ячейки.СпособРаспределенияЗатрат.Видимость = (СведенияОСтатьеЗатрат <> Неопределено и СведенияОСтатьеЗатрат.ХарактерЗатрат = Перечисления.ХарактерЗатрат.ПроизводственныеРасходы);
	
	СведенияОСчете = БухгалтерскийУчет.ПолучитьСведенияОСчете(мСведенияОСчетах, ДанныеСтроки.СчетКт);
	БухгалтерскийУчет.НазначитьВидимостьСубконто(ОформлениеСтроки, "Кт", СведенияОСчете);
	

КонецПроцедуры

Процедура РегистрРасчетаСписокПриИзмененииФлажка(Элемент, Колонка)
		
	Если Колонка.ДанныеФлажка = "Взносы" Тогда
		
		ДанныеСтроки = ЭлементыФормы.СправочникСписок.ТекущиеДанные;
		Если НЕ ДанныеСтроки.Взносы Тогда
			ДанныеСтроки.СчетДтВзносы = ПланыСчетов.Хозрасчетный.ПустаяСсылка();
			Для СчетчикСубконто = 1 По 3 Цикл
				ДанныеСтроки["СубконтоДтВзносы"+СчетчикСубконто] = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ПустаяСсылка();
			КонецЦикла;
		КонецЕсли; 
		
	КонецЕсли; 
	
КонецПроцедуры


мСведенияОСчетах = Новый Соответствие;
мСведенияОСтатьяхЗатрат = Новый Соответствие;
