////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ


Процедура ДействияФормыРедактироватьКод(Кнопка)
	МеханизмНумерацииОбъектов.ИзменениеВозможностиРедактированияНомера(Метаданные.ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов, ЭлементыФормы.ПланВидовХарактеристикСписок, ЭлементыФормы.ДействияФормы.Кнопки.Подменю, ЭлементыФормы.ПланВидовХарактеристикСписок.Колонки.Код);
КонецПроцедуры

// Обработчик события ПриОткрытии Формы.
//
Процедура ПриОткрытии()

	МеханизмНумерацииОбъектов.ДобавитьВМенюДействияКнопкуРедактированияКода(ЭлементыФормы.ДействияФормы.Кнопки.Подменю);
	МеханизмНумерацииОбъектов.УстановитьДоступностьПоляВводаНомера(Метаданные.ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов, ЭлементыФормы.ПланВидовХарактеристикСписок, ЭлементыФормы.ДействияФормы.Кнопки.Подменю, ЭлементыФормы.ПланВидовХарактеристикСписок.Колонки.Код);
КонецПроцедуры //ПриОткрытии

Процедура ПередОткрытием(Отказ, СтандартнаяОбработка)
	Предупреждение(НСтр("ru='Данная форма является служебной."
"Интерактивная работа с ней запрещена.';uk='Дана форма є службовою."
"Інтерактивна робота з нею заборонена.'"));
	Отказ = Истина;				   
КонецПроцедуры

