///////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ МОДУЛЯ


Перем мТекущаяДатаДокумента; 	// Хранит текущую дату документа - для проверки
// перехода документа в другой период установки номера

Перем мДеревоМакетов; // Хранит дерево макетов печатных форм
Перем мПодменюПечати; // Хранит элемент управления подменю печати
Перем мПечатьПоУмолчанию; // Хранит элемент управления кнопку печать по умолчанию
Перем мКнопкиЗаполненияТЧ; // Хранит дерево кнопок подменю заполнение ТЧ

// Процедура - обработчик события "ПриИзменении" поля ввода даты документа.
//
Процедура ДатаПриИзменении(Элемент)
	
	Если Год(Элемент.Значение) > 3999 Тогда
		Элемент.Значение = Дата('00010101');
		Возврат;
	КонецЕсли;
	
	УстановитьКомментарий();
	
	ДатаКонецМесяца = КонецМесяца(Дата);
	Если День(Дата) <> День(ДатаКонецМесяца) Тогда
		Дата = НачалоДня(ДатаКонецМесяца);
		УстановитьВремя(РежимАвтоВремя.ТекущееИлиПоследним);
	КонецЕсли;
	
	мТекущаяДатаДокумента = Дата; // запомним текущую дату документа для контроля номера документа
	
	УстановитьДоступность(); //*/ добавлено 2011-12-13
	
КонецПроцедуры // ДатаПриИзменении()

// Процедура - обработчик события "ПриИзменении" поля ввода организации.
//
Процедура ОрганизацияПриИзменении(Элемент)
	
	УстановитьДоступность(); //*/ добавлено 2011-12-13
	
КонецПроцедуры // ОрганизацияПриИзменении()

// Процедура УстановитьКомментарий()
//                             
// Устанавливает текст комментария в зависимости от даты документа
//
//		Параметры: нет
//
Процедура УстановитьКомментарий()
	
	Если Не мТекущаяДатаДокумента = Дата Тогда
		Комментарий = "Закрытие месяца за " + Формат( Дата, "ДФ='ММММ гггг'");
	КонецЕсли;
	
КонецПроцедуры // УстановитьКомментарий()

// Процедура - обработчик события "ПриОткрытии" формы
//
Процедура ПриОткрытии()
	
	Если ЭтоНовый() Тогда
		
		УстановитьВремя(РежимАвтоВремя.ТекущееИлиПоследним);
		
		УстановитьКомментарий();
	КонецЕсли;
	
	// Обновить содержание информационных строк.
	// Запомнить текущие значения реквизитов формы.
	мТекущаяДатаДокумента = Дата;
	
	УстановитьДоступность(); //*/ добавлено 2011-12-13
	
КонецПроцедуры // ПриОткрытии()

Процедура УстановитьДоступность() //*/ добавлено 2011-12-13
КонецПроцедуры

Процедура ПередОткрытием(Отказ, СтандартнаяОбработка)
КонецПроцедуры

// Процедура вызывается при выборе пункта подменю "Движения документа по регистрам" меню "Перейти".
// командной панели формы. Процедура отрабатывает печать движений документа по регистрам.
//
Процедура ОсновныеДействияФормыНастройка(Кнопка)
	Серна.РучнаяКорректировкаОсновнаяФорма(ЭтоНовый(), Ссылка, ЭтотОбъект); 
КонецПроцедуры // ОсновныеДействияФормыНастройка()
