
// Устанавливает доступность и очищает реквизиты в зависимости
// от ЛьготныйСтаж
//
// Параметры
//  Нет
//
Процедура УстановитьДоступность(ОчищатьРеквизиты)

    Если ЛьготныйСтаж Тогда
		ЭлементыФормы.ОснованиеЛьготногоСтажа.Доступность = Истина; 
		ЭлементыФормы.Коэффициент.Доступность = Истина; 
	Иначе
		ЭлементыФормы.ОснованиеЛьготногоСтажа.Доступность = Ложь; 
		ЭлементыФормы.Коэффициент.Доступность = Ложь; 
	КонецЕсли;
	ЭлементыФормы.ОснованиеЛьготногоСтажа.ОтметкаНезаполненного = ЭлементыФормы.ОснованиеЛьготногоСтажа.Доступность;
	ЭлементыФормы.Коэффициент.ОтметкаНезаполненного = ЭлементыФормы.Коэффициент.Доступность;

	Если ОчищатьРеквизиты Тогда
        Коэффициент = ?(ЭлементыФормы.Коэффициент.Доступность, Коэффициент, 0);
		ОснованиеЛьготногоСтажа = ?(ЭлементыФормы.ОснованиеЛьготногоСтажа.Доступность, ОснованиеЛьготногоСтажа, NULL);
	КонецЕсли;	

КонецПроцедуры // УстановитьДоступность()


Процедура ЛьготныйСтажПриИзменении(Элемент)

	УстановитьДоступность(Истина);
	
КонецПроцедуры

Процедура ДействияФормыРедактироватьКод(Кнопка)
	МеханизмНумерацииОбъектов.ИзменениеВозможностиРедактированияНомера(ЭтотОбъект.Метаданные(), ЭтаФорма, ЭлементыФормы.ДействияФормы.Кнопки.Подменю, ЭлементыФормы.Код);
КонецПроцедуры

Процедура ПриОткрытии()

	МеханизмНумерацииОбъектов.ДобавитьВМенюДействияКнопкуРедактированияКода(ЭлементыФормы.ДействияФормы.Кнопки.Подменю);
	МеханизмНумерацииОбъектов.УстановитьДоступностьПоляВводаНомера(Метаданные(), ЭтаФорма, ЭлементыФормы.ДействияФормы.Кнопки.Подменю,ЭлементыФормы.Код);
	
	УстановитьДоступность(Ложь);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)

	Если ЛьготныйСтаж Тогда
		Если ОснованиеЛьготногоСтажа = Неопределено Тогда
			Предупреждение(НСтр("ru='Не заполнено основание льготного стажа!';uk='Не заповнена підстава пільгового стажу!'"));
			Отказ = Истина;
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Если Коэффициент = Неопределено Тогда
		Предупреждение(НСтр("ru='Не заполнен коэффициент льготного стажа!';uk='Не заповнений коефіцієнт пільгового стажу!'"));
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

// Обработчик события ПослеЗаписи формы.
//
Процедура ПослеЗаписи()
	
	МеханизмНумерацииОбъектов.ОбновитьПодсказкуКодНомерОбъекта(ЭтотОбъект.Метаданные(), ЭлементыФормы.ДействияФормы.Кнопки.Подменю, ЭлементыФормы.Код);
	
КонецПроцедуры





