Процедура ДействияФормыРедактироватьКод(Кнопка)
	МеханизмНумерацииОбъектов.ИзменениеВозможностиРедактированияНомера(ЭтотОбъект.Метаданные(), ЭтаФорма, ЭлементыФормы.ДействияФормы.Кнопки.Подменю, ЭлементыФормы.Код);
КонецПроцедуры

Функция ВыполняетсяДополнительноеУсловие(ЭтаФорма) Экспорт
		
	НастройкиБухучетаДоступны = НастройкаПравДоступа.ДоступнаРольРасчетчикаРегл();
	
	ЭтаФорма.ЭлементыФормы.ПанельПрочихДанных.Страницы.БухучетЗарплаты.Видимость = НастройкиБухучетаДоступны;

	Возврат НастройкиБухучетаДоступны;

КонецФункции

// Процедура получает из регистра сведений текущее отражение в учете
Процедура ПрочитатьОтражениеВУчете(ЭтаФорма, ЭтотОбъект) Экспорт

	Отбор = Новый Структура;
	Отбор.Вставить("ПодразделениеОрганизации", ЭтотОбъект.Ссылка);
	Отбор.Вставить("Организация", ЭтотОбъект.Ссылка.Владелец);
	
	СрезПоследних   = РегистрыСведений.УчетОсновногоЗаработкаПодразделенияОрганизации.СрезПоследних(ТекущаяДата(), Отбор);
	
	НадписьОтражениеВБухучете = "";
	
	ПодпадаетПодЕНВД = Ложь;
	ОтражениеНачисленийПоУмолчанию = Справочники.СпособыОтраженияЗарплатыВРеглУчете.ОтражениеНачисленийПоУмолчанию;
	ПолучитьСпособыОтраженияПоУмолчанию(ЭтотОбъект.Ссылка.Владелец, ОтражениеНачисленийПоУмолчанию);
	
	Если ЭтотОбъект.ЭтоНовый() ИЛИ СрезПоследних.Количество() = 0 Тогда
		
		НадписьОтражениеВБухучете = НСтр("ru='Зарплата сотрудников подразделения отражается как задано для предприятия в целом:';uk='Зарплата співробітників підрозділу відображається як задано для підприємства в цілому:'") + Символы.ПС;
		//добавим представление способа отражения по умолчанию
		НадписьОтражениеВБухучете = НадписьОтражениеВБухучете + ПолучитьПредставлениеСпособаОтражения(ОтражениеНачисленийПоУмолчанию) + Символы.ПС;
		
	Иначе // зарегистированы данные в регистре
		
		НадписьОтражениеВБухучете = НСтр("ru='С ';uk='З '") + Формат(СрезПоследних[0].Период, "ДЛФ=DD") + НСтр("ru=' зарплата сотрудников подразделения отражается как:';uk=' зарплата співробітників підрозділу відображається як:'") + Символы.ПС;
		//добавим представление способа отражения по умолчанию
		НадписьОтражениеВБухучете = НадписьОтражениеВБухучете + ПолучитьПредставлениеСпособаОтражения(СрезПоследних[0].СпособОтраженияВБухучете) + Символы.ПС;
				
		Если ЗначениеЗаполнено(СрезПоследних[0].СпособОтраженияВБухучете) Тогда
			                                                                                 
			НадписьОтражениеВБухучете = НСтр("ru='С ';uk='З '") + Формат(СрезПоследних[0].Период, "ДЛФ=DD") + НСтр("ru=' зарплата сотрудников подразделения отражается как:';uk=' зарплата співробітників підрозділу відображається як:'") + Символы.ПС;
			//добавим представление способа отражения по умолчанию
			НадписьОтражениеВБухучете = НадписьОтражениеВБухучете + ПолучитьПредставлениеСпособаОтражения(СрезПоследних[0].СпособОтраженияВБухучете);

			НадписьОтражениеВБухучете = НадписьОтражениеВБухучете + Символы.ПС;
			
		Иначе // зарегистрирован пустой способ отражения
			
			НадписьОтражениеВБухучете = НСтр("ru='С ';uk='З '") + Формат(СрезПоследних[0].Период, "ДЛФ=DD") + НСтр("ru=' зарплата сотрудников подразделения отражается как задано для предприятия в целом:';uk=' зарплата співробітників підрозділу відображається як задано для підприємства в цілому:'") + Символы.ПС;
			//добавим представление способа отражения по умолчанию
			НадписьОтражениеВБухучете = НадписьОтражениеВБухучете + ПолучитьПредставлениеСпособаОтражения(ОтражениеНачисленийПоУмолчанию) + Символы.ПС;
	
		КонецЕсли;

	КонецЕсли;
	
	ЭтаФорма.ЭлементыФормы.НадписьОтражениеВБухучете.Заголовок = НадписьОтражениеВБухучете;

КонецПроцедуры // ПрочитатьОтражениеВУчете() 


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

Процедура ПередОткрытием(Отказ, СтандартнаяОбработка)
	
	Если ВыполняетсяДополнительноеУсловие(ЭтаФорма) Тогда
		ПрочитатьОтражениеВУчете(ЭтаФорма, ЭтотОбъект);	
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриОткрытии()
	
	МеханизмНумерацииОбъектов.ДобавитьВМенюДействияКнопкуРедактированияКода(ЭлементыФормы.ДействияФормы.Кнопки.Подменю);
	МеханизмНумерацииОбъектов.УстановитьДоступностьПоляВводаНомера(Метаданные(), ЭтаФорма, ЭлементыФормы.ДействияФормы.Кнопки.Подменю,ЭлементыФормы.Код);
	
КонецПроцедуры

Процедура ПослеЗаписи()
	
	МеханизмНумерацииОбъектов.ОбновитьПодсказкуКодНомерОбъекта(ЭтотОбъект.Метаданные(), ЭлементыФормы.ДействияФормы.Кнопки.Подменю, ЭлементыФормы.Код);
	
КонецПроцедуры

Функция ПолучитьПредставлениеСпособаОтражения(СпособОтражения) Экспорт
	
	Если Не СпособОтражения.Предопределенный Тогда
		
		// для не предопределенных способов отражения возвращаем наименование способа,
		//как пользователь задал его в справочнике
		Возврат СпособОтражения.Наименование+"(Дт" + СпособОтражения.СчетДт + " Кт" + СпособОтражения.СчетКт+")";
		
	Иначе
		
		//для предопределенных способов сформируем представление
		ПредставлениеСпособаОтражения = "Дт" + СпособОтражения.СчетДт + " Кт" + СпособОтражения.СчетКт;
		
		Возврат ПредставлениеСпособаОтражения;
		
	КонецЕсли;

КонецФункции

Процедура ПолучитьСпособыОтраженияПоУмолчанию(Организация, ОтражениеНачисленийПоУмолчанию) Экспорт
	
	Отбор = Новый Структура;
	Отбор.Вставить("Организация", Организация);
	СрезПоследних   = РегистрыСведений.УчетОсновногоЗаработкаОрганизации.СрезПоследних(ТекущаяДата(), Отбор);
	
	Если СрезПоследних.Количество() > 0 Тогда
		Если ЗначениеЗаполнено(СрезПоследних[0].СпособОтраженияВБухучете) Тогда
			ОтражениеНачисленийПоУмолчанию = СрезПоследних[0].СпособОтраженияВБухучете;
		КонецЕсли;
	КонецЕсли;	

КонецПроцедуры

Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ОбновитьНадписьОтражениеВБухучете" Тогда
		//ПодразделенияОрганизацийПереопределяемый.ПрочитатьОтражениеВУчете(ЭтаФорма, ЭтотОбъект);
 	Отбор = Новый Структура;
	Отбор.Вставить("ПодразделениеОрганизации", ЭтотОбъект.Ссылка);
	Отбор.Вставить("Организация", ЭтотОбъект.Ссылка.Владелец);
	
	СрезПоследних   = РегистрыСведений.УчетОсновногоЗаработкаПодразделенияОрганизации.СрезПоследних(ТекущаяДата(), Отбор);
	
	НадписьОтражениеВБухучете = "";
	
	ОтражениеНачисленийПоУмолчанию = Справочники.СпособыОтраженияЗарплатыВРеглУчете.ОтражениеНачисленийПоУмолчанию;
	ПолучитьСпособыОтраженияПоУмолчанию(ЭтотОбъект.Ссылка.Владелец, ОтражениеНачисленийПоУмолчанию);
	
	Если ЭтотОбъект.ЭтоНовый() ИЛИ СрезПоследних.Количество() = 0 Тогда
		
		НадписьОтражениеВБухучете = НСтр("ru='Зарплата сотрудников подразделения отражается как задано для предприятия в целом:';uk='Зарплата співробітників підрозділу відображається як задано для підприємства в цілому:'") + Символы.ПС;
		//добавим представление способа отражения по умолчанию
		НадписьОтражениеВБухучете = НадписьОтражениеВБухучете + ПолучитьПредставлениеСпособаОтражения(ОтражениеНачисленийПоУмолчанию) + Символы.ПС;
		
	Иначе // зарегистированы данные в регистре
		
		НадписьОтражениеВБухучете = НСтр("ru='С ';uk='З '") + Формат(СрезПоследних[0].Период, "ДЛФ=DD") + НСтр("ru=' зарплата сотрудников подразделения отражается как:';uk=' зарплата співробітників підрозділу відображається як:'") + Символы.ПС;
		//добавим представление способа отражения по умолчанию
		НадписьОтражениеВБухучете = НадписьОтражениеВБухучете + ПолучитьПредставлениеСпособаОтражения(СрезПоследних[0].СпособОтраженияВБухучете) + Символы.ПС;
				
		Если ЗначениеЗаполнено(СрезПоследних[0].СпособОтраженияВБухучете) Тогда
			                                                                                 
			НадписьОтражениеВБухучете = НСтр("ru='С ';uk='З '") + Формат(СрезПоследних[0].Период, "ДЛФ=DD") + НСтр("ru=' зарплата сотрудников подразделения отражается как:';uk=' зарплата співробітників підрозділу відображається як:'") + Символы.ПС;
			//добавим представление способа отражения по умолчанию
			НадписьОтражениеВБухучете = НадписьОтражениеВБухучете + ПолучитьПредставлениеСпособаОтражения(СрезПоследних[0].СпособОтраженияВБухучете);
			
			НадписьОтражениеВБухучете = НадписьОтражениеВБухучете + Символы.ПС;
			
		Иначе // зарегистрирован пустой способ отражения
			
			НадписьОтражениеВБухучете = НСтр("ru='С ';uk='З '") + Формат(СрезПоследних[0].Период, "ДЛФ=DD") + НСтр("ru=' зарплата сотрудников подразделения отражается как задано для предприятия в целом:';uk=' зарплата співробітників підрозділу відображається як задано для підприємства в цілому:'") + Символы.ПС;
			//добавим представление способа отражения по умолчанию
			НадписьОтражениеВБухучете = НадписьОтражениеВБухучете + ПолучитьПредставлениеСпособаОтражения(ОтражениеНачисленийПоУмолчанию) + Символы.ПС;

		КонецЕсли;
		
	КонецЕсли;
	
	ЭтаФорма.ЭлементыФормы.НадписьОтражениеВБухучете.Заголовок = НадписьОтражениеВБухучете;

   КонецЕсли;
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

Процедура НадписьОтражениеВБухучетеИзменитьНажатие(Элемент)
	
	Отказ = Ложь;

	Если ЭтоНовый() Тогда
		Вопрос = НСтр("ru='Перед заданием бухучета зарплаты необходимо записать подразделение. Записать?';uk='Перед завданням бухобліку зарплати необхідно записати підрозділ. Записати?'");
		Ответ  = Вопрос(Вопрос, РежимДиалогаВопрос.ОКОтмена);
		Если Ответ = КодВозвратаДиалога.ОК Тогда
			Попытка
				Отказ = Не ЗаписатьВФорме();
			Исключение
				ОбщегоНазначения.СообщитьОбОшибке(НСтр("ru='Не удалось записать элемент!';uk='Не вдалося записати елемент!'"));
				Отказ = Истина;
			КонецПопытки;
		Иначе
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;

	Если Не Отказ Тогда
		ФормаРегистра = РегистрыСведений.УчетОсновногоЗаработкаПодразделенияОрганизации.ПолучитьФормуСписка("ФормаСпискаОтборПоПодразделению", ЭтаФорма, Элемент);
		ФормаРегистра.РегистрСведенийСписок.Отбор.ПодразделениеОрганизации.Установить(Ссылка);
		ФормаРегистра.РегистрСведенийСписок.Отбор.Организация.Установить(Ссылка.Владелец);
		ФормаРегистра.ЭлементыФормы.РегистрСведенийСписок.НачальноеОтображениеСписка = НачальноеОтображениеСписка.Конец;
		ФормаРегистра.Заголовок = НСтр("ru='Бухучет зарплаты сотрудников подразделения ';uk='Бухоблік зарплати співробітників підрозділу '") +СОКРЛП(Наименование);
		ФормаРегистра.Открыть();
	КонецЕсли;

	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ДЕЙСТВИЯ КОМАНДНЫХ ПАНЕЛЕЙ ФОРМЫ

// Процедура выполняет открытие формы работы со свойствами документа
//
Процедура ДействияФормыДействиеОткрытьСвойства(Кнопка)

	РаботаСДиалогами.ОткрытьСвойстваДокумента(ЭтотОбъект, ЭтаФорма);

КонецПроцедуры // ДействияФормыДействиеОткрытьСвойства()

// Процедура выполняет открытие формы работы с категориями документа
//
Процедура ДействияФормыДействиеОткрытьКатегории(Кнопка)

	РаботаСДиалогами.ОткрытьКатегорииДокумента(ЭтотОбъект, ЭтаФорма);

КонецПроцедуры // ДействияФормыДействиеОткрытьКатегории()

