

// Устанавливает отбор записей в списке регистра
//
// Параметры: 
//  Организация -
//  ФизЛицо -
//
// Возвращаемое значение:
//  Нет.
//
Процедура УстановитьОтборРегиструСтажа(ФизЛицо, Организация)

    Если ФизЛицо = Неопределено Тогда
		ФизЛицо = Справочники.ФизическиеЛица.ПустаяСсылка();
	КонецЕсли;
	
	Если Не Организация.Пустая() Тогда
		РегистрСведенийСписок.Отбор.ФизЛицо.Значение          = ФизЛицо;
		РегистрСведенийСписок.Отбор.ФизЛицо.Использование     = Истина;
		РегистрСведенийСписок.Отбор.Организация.Значение      = Организация;
		РегистрСведенийСписок.Отбор.Организация.Использование = Истина;
  	Иначе
		РегистрСведенийСписок.Отбор.ФизЛицо.Значение          = ФизЛицо;
		РегистрСведенийСписок.Отбор.ФизЛицо.Использование     = Истина;
		РегистрСведенийСписок.Отбор.Организация.Использование = Ложь;
	КонецЕсли;

КонецПроцедуры // УстановитьОтборРегиструСтажа

// Процедура открывает форму списка регистра.
//
Процедура ДействияФормыИстория(Кнопка)
	
	ПоказыватьВсеЗаписиРегистра = Не Кнопка.Пометка;
	
	ЭлементыФормы.РегистрСведенийСписок.ВыбиратьСрез = ?(ПоказыватьВсеЗаписиРегистра,ИспользованиеСреза.НеИспользовать,ИспользованиеСреза.Последние);
	ЭлементыФормы.ДействияФормы.Кнопки.История.Пометка	= ПоказыватьВсеЗаписиРегистра;
	
КонецПроцедуры // ДействияФормыИстория()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

Процедура ПриОткрытии()
	
	Организация = РегистрСведенийСписок.Отбор.Организация.Значение;
	Если РегистрСведенийСписок.Отбор.ФизЛицо.Использование = ИСТИНА Тогда
		Сотрудники.Отбор.Ссылка.Установить(РегистрСведенийСписок.Отбор.Физлицо.Значение);
		ЭлементыФормы.Сотрудники.ТекущаяСтрока = РегистрСведенийСписок.Отбор.Физлицо.Значение;
	КонецЕсли;
	//Если нет отбора, получаем организацию по умолчанию
	Если Не ЗначениеЗаполнено(Организация) Тогда
		Организация = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнаяОрганизация");
	КонецЕсли;
	
    	
КонецПроцедуры

// Процедура прописывает заголовок формы 
//
// Параметры:
//  Элемент - элемент формы, который отображает организацию
//  
Процедура ОрганизацияПриИзменении(Элемент)

	Заголовок = НСтр("ru='Начальный стаж сотрудников организации ';uk='Початковий стаж співробітників організації '") + Элемент.Значение.Наименование;
    ФизЛицо = ЭлементыФормы.Сотрудники.ТекущаяСтрока;
	УстановитьОтборРегиструСтажа(ФизЛицо, Организация);
	
КонецПроцедуры

// Процедура обеспечивает отбор по сотруднику 
//
// Параметры:
//  Элемент - элемент формы, который отображает сотрудника
//  
Процедура СотрудникиПриАктивизацииСтроки(Элемент)

	ФизЛицо = Элемент.ТекущаяСтрока;
    УстановитьОтборРегиструСтажа(ФизЛицо, Организация);
	
КонецПроцедуры


