Процедура ДействияФормыДействие(Кнопка)
		
	//1. 
	СхемаКомпоновкиДанных = ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	
	//2.1
	Настройки = КомпоновщикНастроек.Настройки;
	///КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(ОтчетОбъект.СхемаКомпоновкиДанных));
	//ЗаполнитьПараметры(КомпоновщикНастроек.Настройки);
	ЗаполнитьПараметры();
	
	//ЗначениеКонецПериода  = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("КонецПериода"));

	
	//2.7
	ПараметрВывода = Настройки.ПараметрыВывода.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ВыводитьОтбор"));
	ПараметрВывода.Использование = Истина;
	ПараметрВывода.Значение = ТипВыводаТекстаКомпоновкиДанных.НеВыводить;
	
	ПараметрВывода = Настройки.ПараметрыВывода.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ВыводитьПараметрыДанных"));
	ПараметрВывода.Использование = Истина;
	ПараметрВывода.Значение = ТипВыводаТекстаКомпоновкиДанных.НеВыводить;
	
	ПараметрВывода = Настройки.ПараметрыВывода.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("МакетОформления"));
	ПараметрВывода.Использование = Истина;
	ПараметрВывода.Значение = БиблиотекаМакетовОформленияКомпоновкиДанных.БезОформления.Имя;
	
	//3
	КомпоновщикМакета  = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки= КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки);
	
	//4
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);
	
	//5
	ДокументРезультат = ЭлементыФормы.Результат;
	ДокументРезультат.Очистить();
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	
	ПроцессорВывода.НачатьВывод();
	
	Пока Истина цикл
		ЭлементРезультата = ПроцессорКомпоновки.Следующий();
		Если ЭлементРезультата = Неопределено Тогда
			Прервать;
		Иначе
			ПроцессорВывода.ВывестиЭлемент(ЭлементРезультата);
		КонецЕсли;
	КонецЦикла;
	
	ПроцессорВывода.ЗакончитьВывод();
	
	ДокументРезультат.ОтображатьСетку = Ложь;
	ДокументРезультат.Защита = Истина;
	ДокументРезультат.Показать();
			
КонецПроцедуры

Процедура ПериодНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	РаботаСДиалогами.НачалоВыбораИзСпискаПредставленияПериодаРегистрации(Элемент, СтандартнаяОбработка, Период, ЭтаФорма);
КонецПроцедуры

Процедура ПериодОчистка(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

Процедура ПериодРегулирование(Элемент, Направление, СтандартнаяОбработка)
	РаботаСДиалогами.РегулированиеПредставленияПериодаРегистрации(Направление, СтандартнаяОбработка, Период, ПредставлениеПериода);
КонецПроцедуры

Процедура ПриОткрытии()
	
Период = ТекущаяДата();
ПредставлениеПериода = РаботаСДиалогами.ПолучитьПредставлениеПериодаРегистрации(Период);

ЗаполнитьПараметры();
КонецПроцедуры

Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	СохранитьНастройкиПользователя(); //настройки сохраняем самостятельно, для того чтоб нормально сохранялись параметы СКД
КонецПроцедуры
