
Процедура РегистрРасчетаСписокПриВыводеСтроки(Элемент, ОформлениеСтроки, ДанныеСтроки)
		
	ОформлениеСтроки.Ячейки.Период.Видимость = Ложь;
	ОформлениеСтроки.Ячейки.НалоговыйПериод.Видимость = Ложь;
	ОформлениеСтроки.Ячейки.Дни.Видимость = Ложь;
	
КонецПроцедуры

Процедура ПриОткрытии()
	
	ИспользуетсяЕСВ = ПроведениеРасчетов.ИспользуетсяЕСВ();
	ЭлементыФормы.РегистрРасчетаСписок.Колонки.БазаВычет.Видимость = ИспользуетсяЕСВ;
	ЭлементыФормы.РегистрРасчетаСписок.Колонки.КодКатегорииЗЛ.Видимость = ИспользуетсяЕСВ;
	ЭлементыФормы.РегистрРасчетаСписок.Колонки.ТипНачисления.Видимость = ИспользуетсяЕСВ;
	
КонецПроцедуры
