
Процедура КнопкаВыполнитьНажатие(Элемент)
	
	Если ТипОбъекта = "ВсеОбъекты" Тогда
		ЗаполнитьВсеОбъекты()
	Иначе	
		ЗаполнитьОбъект(ТипОбъекта, НаименованиеОбъекта);
	КонецЕсли;	
		
КонецПроцедуры

Процедура ТипОбъектаПриИзменении(Элемент)
	
	ИмяМакетаЗаполнения = "НачальноеЗаполнение";
	НаименованиеОбъекта = "";
	ОчиститьПередЗаписью = Ложь;
	ЭлементыФормы.ОчиститьПередЗаписью.Доступность = Ложь;
	
	Если ТипОбъекта = "Справочник" Тогда
		ЭлементыФормы.НаименованиеОбъекта.СписокВыбора.Очистить();
		Для каждого ОбъектМД из Метаданные.Справочники Цикл
			Если ОбъектМД.Макеты.Найти(ИмяМакетаЗаполнения) = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			ЭлементыФормы.НаименованиеОбъекта.СписокВыбора.Добавить(ОбъектМД.Имя,ОбъектМД.Синоним);
		КонецЦикла;	
	ИначеЕсли ТипОбъекта = "ПланВидовХарактеристик" Тогда
		ЭлементыФормы.НаименованиеОбъекта.СписокВыбора.Очистить();
		Для каждого ОбъектМД из Метаданные.ПланыВидовХарактеристик Цикл
			Если ОбъектМД.Макеты.Найти(ИмяМакетаЗаполнения) = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			ЭлементыФормы.НаименованиеОбъекта.СписокВыбора.Добавить(ОбъектМД.Имя,ОбъектМД.Синоним);
		КонецЦикла;	
	ИначеЕсли ТипОбъекта = "ПланВидовРасчета" Тогда
		ЭлементыФормы.НаименованиеОбъекта.СписокВыбора.Очистить();
		Для каждого ОбъектМД из Метаданные.ПланыВидовРасчета Цикл
			Если ОбъектМД.Макеты.Найти(ИмяМакетаЗаполнения) = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			ЭлементыФормы.НаименованиеОбъекта.СписокВыбора.Добавить(ОбъектМД.Имя,ОбъектМД.Синоним);
		КонецЦикла;	
	ИначеЕсли ТипОбъекта = "ПланСчетов" Тогда
		ЭлементыФормы.НаименованиеОбъекта.СписокВыбора.Очистить();
		Для каждого ОбъектМД из Метаданные.ПланыСчетов Цикл
			Если ОбъектМД.Макеты.Найти(ИмяМакетаЗаполнения) = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			ЭлементыФормы.НаименованиеОбъекта.СписокВыбора.Добавить(ОбъектМД.Имя,ОбъектМД.Синоним);
		КонецЦикла;	
	ИначеЕсли ТипОбъекта = "РегистрСведений" Тогда
		ЭлементыФормы.НаименованиеОбъекта.СписокВыбора.Очистить();
		Для каждого ОбъектМД из Метаданные.РегистрыСведений Цикл
			Если ОбъектМД.Макеты.Найти(ИмяМакетаЗаполнения) = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			ЭлементыФормы.НаименованиеОбъекта.СписокВыбора.Добавить(ОбъектМД.Имя,ОбъектМД.Синоним);
		КонецЦикла;	
        ЭлементыФормы.ОчиститьПередЗаписью.Доступность = Истина;
	ИначеЕсли ТипОбъекта = "ВсеОбъекты" Тогда
		ЭлементыФормы.НаименованиеОбъекта.СписокВыбора.Очистить();
	    ЭлементыФормы.ОчиститьПередЗаписью.Доступность = Истина;
	КонецЕсли;	
	
	ЭлементыФормы.ОсновныеДействияФормы.Кнопки.Открыть.Доступность = НЕ (ТипОбъекта = "ВсеОбъекты");
	
КонецПроцедуры

Процедура ПриОткрытии()
	
	ТипОбъектаПриИзменении(ЭтаФорма);
	
КонецПроцедуры

Процедура ОсновныеДействияФормыОткрыть(Кнопка)
	
	Если ТипОбъекта = "Справочник" Тогда
		Справочники[НаименованиеОбъекта].ПолучитьФормуСписка().Открыть();
	ИначеЕсли ТипОбъекта = "ПланВидовХарактеристик" Тогда
		ПланыВидовХарактеристик[НаименованиеОбъекта].ПолучитьФормуСписка().Открыть();
	ИначеЕсли ТипОбъекта = "ПланВидовРасчета" Тогда
		ПланыВидовРасчета[НаименованиеОбъекта].ПолучитьФормуСписка().Открыть();
	ИначеЕсли ТипОбъекта = "ПланСчетов" Тогда
		ПланыСчетов[НаименованиеОбъекта].ПолучитьФормуСписка().Открыть();
	ИначеЕсли ТипОбъекта = "РегистрСведений" Тогда
		РегистрыСведений[НаименованиеОбъекта].ПолучитьФормуСписка().Открыть();
	КонецЕсли;
	
КонецПроцедуры



