// Процедура - обработчик события "ПриОткрытии" формы
//
Процедура ПриОткрытии()

	Если Организация.Пустая() Тогда // проверить объект на то, что он еще не внесен в ИБ
		// Заполнить реквизиты значениями по умолчанию.
		Организация = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнаяОрганизация");
		КоэффициентВечерних = 0.20;
		КоэффициентНочных = 0.20;
		ОкруглятьДо = 0.01;
		ГруппаВзносов = Справочники.ГруппыВзносовВФонды.ОсновнойСостав;
	КонецЕсли;
	ВидимостьОписанияПараметраНДФЛ();
	
КонецПроцедуры // ПриОткрытии()

// Обработчик события "ПередЗаписью"
//
Процедура ПередЗаписью(Отказ)
	
	Если НЕ ЗначениеЗаполнено(Организация) Тогда
		Предупреждение(НСтр("ru='Заполните реквизит ""Организация""!';uk='Заповніть реквізит ""Організація""!'"));
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры // ПередЗаписью()

Процедура ВидимостьОписанияПараметраНДФЛ()
	Если ПрименятьЛьготуНДФЛБазовуюИДетскуюПоПорогуДетской Тогда
		ЭлементыФормы.НадписьНДФЛ.Заголовок = НСтр("ru='Если флаг включен, при расчете НДФЛ базовая льгота применяется одновременно с льготами на детей при условии, что облагаемый доход не превышает порога, установленного п. 169.4.1. НКУ, рассчитанного пропорционально количеству детей';uk='Якщо прапор включений, при розрахунку ПДФО базова пільга застосовується одночасно з пільгами на дітей за умови, що оподатковуваний дохід не перевищує порогу, встановленого п. 169.4.1. ПКУ, розрахованого пропорційно кількості дітей'");
	Иначе
		ЭлементыФормы.НадписьНДФЛ.Заголовок = НСтр("ru='Если флаг не включен, при расчете НДФЛ базовая льгота применяется одновременно с льготами на детей только при условии, что облагаемый доход не превышает порога, установленного п. 169.4.1. НКУ';uk='Якщо прапор не включений, при розрахунку ПДФО базова пільга застосовується одночасно з пільгами на дітей тільки за умови, що оподатковуваний дохід не перевищує порогу, встановленого п. 169.4.1. ПКУ'");
	КонецЕсли;
	
КонецПроцедуры

Процедура ПрименятьЛьготуНДФЛБазовуюИДетскуюПоПорогуДетскойПриИзменении(Элемент)
	
	ВидимостьОписанияПараметраНДФЛ();
	
КонецПроцедуры
