// Процедура-обработчик нажатия на кнопку "Сформировать"
Процедура КоманднаяПанельСформировать(Элемент)
	
	СформироватьИВывестиОтчет();

КонецПроцедуры

Процедура СформироватьИВывестиОтчет() Экспорт
	
	Если НЕ ЗначениеЗаполнено(Документ) Тогда
		Предупреждение(НСтр("ru='Выберите документ, движения которого Вы хотите увидеть';uk='Виберіть документ, рухи якого Ви хочете побачити'"));
		возврат;
	КонецЕсли;
	
	СформироватьОтчет(ЭлементыФормы.ПолеТабличногоДокумента);
	
	
КонецПроцедуры

Процедура ПоказыватьПериодПриИзменении(Элемент)
	
	СформироватьОтчет(ЭлементыФормы.ПолеТабличногоДокумента);
	СохранитьЗначение("ПоказыватьПериодДвижений",ПоказыватьПериод);
	
КонецПроцедуры

Процедура ПриОткрытии()
	
	ПП = ВосстановитьЗначение("ПоказыватьПериодДвижений");
	Если ПП = Неопределено Тогда
		ПоказыватьПериод = Ложь;
	Иначе
		ПоказыватьПериод = ПП;
	КонецЕсли;
	
КонецПроцедуры
 
