////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ УПРАВЛЕНИЯ ВНЕШНИМ ВИДОМ ФОРМЫ

Процедура ДействияФормыРедактироватьКод(Кнопка)
	МеханизмНумерацииОбъектов.ИзменениеВозможностиРедактированияНомера(Метаданные.Справочники.Помещения, ЭлементыФормы.СправочникСписок, ЭлементыФормы.ДействияФормы.Кнопки.Подменю, ЭлементыФормы.СправочникСписок.Колонки.Код);
КонецПроцедуры
// Устанавливает доступность поля списка помещений
//
// Параметры: 
//  ЗначениеТерритории - ссылка на эл. спр. ТерриторииКомпании (явл. владельцем)
//
// Возвращаемое значение:
//  Нет.
//
Процедура УстановитьДоступностьЭлементов(ЗначениеТерритории)
	
	ЭлементыФормы.СправочникСписок.ТолькоПросмотр = НЕ ЗначениеЗаполнено(ЗначениеТерритории)
	
КонецПроцедуры // УстановитьДоступностьЭлементов

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

Процедура ПриОткрытии()
	// установим доступность списка помещений
	УстановитьДоступностьЭлементов(Отбор.Владелец.Значение);
	МеханизмНумерацииОбъектов.ДобавитьВМенюДействияКнопкуРедактированияКода(ЭлементыФормы.ДействияФормы.Кнопки.Подменю);
	МеханизмНумерацииОбъектов.УстановитьДоступностьПоляВводаНомера(Метаданные.Справочники.Помещения, ЭлементыФормы.СправочникСписок, ЭлементыФормы.ДействияФормы.Кнопки.Подменю, ЭлементыФормы.СправочникСписок.Колонки.Код);
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ РЕКВИЗИТОВ

Процедура ТерриторияПриИзменении(Элемент)
	// установим доступность списка помещений
	УстановитьДоступностьЭлементов(Элемент.Значение)
КонецПроцедуры



