
Процедура ОбновитьКомментарии()
	
	Если РасчетНДФЛ17 = Перечисления.ВариантыАлгоритмовРасчетНДФЛ17.ДоначислениеНаСуммуПревышения Тогда
		ЭлементыФормы.КомментарийРасчетНДФЛ17.Заголовок = 
		НСтр("ru='При данном варианте алгоритма осуществляется расчет базы НДФЛ (доход за вычетом ЕСВ), расчет налога по ставке 15% со всей суммы базы начисления и доначисление НДФЛ по ставке 17% суммы превышения порога с учетом уже рассчитанного налога по ставке 15%. При наличии нескольких видов дохода сумма превышения распределяется по ним пропорционально.';uk='При цьому варіанті алгоритму здійснюється розрахунок бази ПДФО (дохід за вирахуванням ЄСВ), розрахунок податку за ставкою 15% із всієї суми бази нарахування та донарахування за ставкою 17% суми перевищення порогу з урахуванням вже розрахованого податку за ставкою 15%. При наявності декількох видів доходу сума перевищення розподіляється між ними пропорційно'");
	ИначеЕсли РасчетНДФЛ17 = Перечисления.ВариантыАлгоритмовРасчетНДФЛ17.ОтдельныйРасчетБазы Тогда
		ЭлементыФормы.КомментарийРасчетНДФЛ17.Заголовок = 
		НСтр("ru='ВНИМАНИЕ! Алгоритм противоречит Закону №4661 от 24.04.2012! В соответствии с письмами ГНАУ №2918/7/17-0717 и №2919/7/17-0717 осуществляется отдельный расчет базы НДФЛ (доход за вычетом ЕСВ) для ставки 15% и ставки 17%. При этом сумма ЕСВ разделяется на две части, сумма ЕСВ с больничных учитывается после суммы ЕСВ с зарплаты. При наличии нескольких видов дохода сначала производится расчет НДФЛ для заработной платы, затем - в порядке возникновения доходов.';uk='УВАГА! Алгоритм суперечить Закону №4661 від 24.04.2012!Відповідно до листів ДПАУ №2918/7/17-0717 та №2919/7/17-0717 здійснюється окремий розрахунок бази ПДФО (дохід за вирахуванням ЄСВ) для ставки 15% та ставки 17%. При цьому сума ЄСВ розподіляється на дві частини, сума ЄСВ з лікарняних враховується після суми ЄСВ з зарплати. При наявності декількох видів доходу спочатку проводиться розрахунок ПДФО для заробітної плати, потім - в порядку виникнення доходів.'");
	Иначе
		ЭлементыФормы.КомментарийРасчетНДФЛ17.Заголовок = "";
	КонецЕсли;
	
	Если РасчетИндексацииПропорционально = Перечисления.ВариантыАлгоритмовРасчетИндексацииПропорционально.НеПрименять Тогда
		ЭлементыФормы.КомментарийРасчетИндексацииПропорционально.Заголовок = 
		НСтр("ru='При данном варианте алгоритма отработанное время при расчете индексации не учитывается.';uk='При даному варіанті алгоритму відпрацьований час при розрахунку індексації не враховується.'");
	ИначеЕсли РасчетИндексацииПропорционально = Перечисления.ВариантыАлгоритмовРасчетИндексацииПропорционально.ДляНеполногоРабочегоВремени Тогда
		ЭлементыФормы.КомментарийРасчетИндексацииПропорционально.Заголовок = 
		НСтр("ru='При данном варианте алгоритма отработанное время при расчете индексации учитывается только для сотрудников, работающих неполное рабочее время (сокращенный рабочий день либо сокращенная рабочая неделя).';uk='При даному варіанті алгоритму відпрацьований час при розрахунку індексації враховується тільки для співробітників, що працюють неповний робочий час (скорочений робочий день або скорочений робочий тиждень).'");
	ИначеЕсли РасчетИндексацииПропорционально = Перечисления.ВариантыАлгоритмовРасчетИндексацииПропорционально.ДляВсехСотрудников Тогда
		ЭлементыФормы.КомментарийРасчетИндексацииПропорционально.Заголовок = 
		НСтр("ru='При данном варианте алгоритма отработанное время при расчете индексации учитывается для всех сотрудников.';uk='При даному варіанті алгоритму відпрацьований час при розрахунку індексації враховується для всіх співробітників.'");	
	Иначе
		ЭлементыФормы.КомментарийРасчетИндексацииПропорционально.Заголовок = "";
	КонецЕсли;
	
	ЭлементыФормы.КомментарийСчет378.Заголовок = 
	НСтр("ru='Ранее этой даты в проводках по начислениям за счет ФСС будет использоваться счет 652.';uk='Раніше цієї дати в проводках по нарахуванням за рахунок ФСС буде використовуватись рахунок 652.'");	
	ЭлементыФормы.КомментарийНеУчитыватьНДСДляПочтовогоСбора.Заголовок = 
	НСтр("ru='При установленном флажке не учитывается НДС при расчете удержания почтового сбора с 01.01.2012 г.';uk='При встановленому прапорі не враховується ПДВ при розрахунку утримання поштового збору з 01.01.2012 р.'");	
	
	Если ПорогИндексации103 = Перечисления.ВариантыАлгоритмовПорогИндексации103.ПрименятьС01012016 Тогда
		ЭлементыФормы.КомментарийПорогИндексации103.Заголовок = 
		НСтр("ru='При данном варианте алгоритма порог индексации 103% применяется для всех начислений зарплаты с января 2016 г.';uk='При цьому варіанті алгоритму поріг індексації 103% застосовується для всіх нарахувань зарплати з січня 2016 р.'");
	ИначеЕсли ПорогИндексации103 = Перечисления.ВариантыАлгоритмовПорогИндексации103.ПрименятьПоИндексуИнфляции Тогда
		ЭлементыФормы.КомментарийПорогИндексации103.Заголовок = 
		НСтр("ru='При данном варианте алгоритма порог индексации 103% применяется впервые для индекса инфляции за январь 2016 г.';uk='При цьому варіанті алгоритму поріг індексації 103% застосовується вперше для індексу інфляції за січень 2016 р.'");
	Иначе
		ЭлементыФормы.КомментарийПорогИндексации103.Заголовок = "";
	КонецЕсли;
	
КонецПроцедуры	

Процедура ПриОткрытии()
	
	Если Не ЗначениеЗаполнено(РасчетНДФЛ17) Тогда
		РасчетНДФЛ17 = Перечисления.ВариантыАлгоритмовРасчетНДФЛ17.ДоначислениеНаСуммуПревышения;
	КонецЕсли;	

	Если Не ЗначениеЗаполнено(РасчетИндексацииПропорционально) Тогда
		РасчетИндексацииПропорционально = Перечисления.ВариантыАлгоритмовРасчетИндексацииПропорционально.НеПрименять;
	КонецЕсли;	
	
	Если Не ЗначениеЗаполнено(ПорогИндексации103) Тогда
		ПорогИндексации103 = Перечисления.ВариантыАлгоритмовПорогИндексации103.ПрименятьС01012016;
	КонецЕсли;	
	
	ОбновитьКомментарии();
	
КонецПроцедуры

Процедура РасчетНДФЛ17ПриИзменении(Элемент)
	
	ОбновитьКомментарии();
	
КонецПроцедуры

Процедура РасчетИндексацииПропорциональноПриИзменении(Элемент)
	
	ОбновитьКомментарии();
	
КонецПроцедуры

Процедура ПорогИндексации103ПриИзменении(Элемент)
	
	ОбновитьКомментарии();
	
КонецПроцедуры
