
Процедура ПриОткрытии()
	
	Отбор.СпособРасчета.Значение = Перечисления.СпособыРасчетаОплатыТруда.ГосударственноеПособие;
	Отбор.СпособРасчета.ВидСравнения = ВидСравнения.Равно;
	Отбор.СпособРасчета.Использование = ИСТИНА;
	
	////СписокПособий = Новый СписокЗначений;
	////СписокПособий.Добавить(Перечисления.ВидыГосударственныхПособий.БлаготворительнаяПомощь);
	////СписокПособий.Добавить(Перечисления.ВидыГосударственныхПособий.НаПогребение);
	////Отбор.ВидПособия.Значение = СписокПособий;
	////
	////Отбор.ВидПособия.ВидСравнения = ВидСравнения.ВСписке;
	////
	////Отбор.ВидПособия.Использование = ИСТИНА;

КонецПроцедуры
