
Процедура ОсновныеДействияФормыОК(Кнопка)
	
	Модифицированность = Ложь;
	Закрыть(Построитель);
	
КонецПроцедуры

Процедура ЗакрытьФорму(Отказ, СтандартнаяОбработка)

	Если Модифицированность Тогда
	
		Отказ = Истина;
	
		ОтветНаВопрос = Вопрос(НСтр("ru='Данные были изменены. Сохранить изменения?';uk='Дані були змінені. Зберегти зміни?'"), РежимДиалогаВопрос.ДаНетОтмена);
		
		Если ОтветНаВопрос = КодВозвратаДиалога.Да Тогда
			Модифицированность = Ложь;
			Закрыть(Построитель);
		ИначеЕсли ОтветНаВопрос = КодВозвратаДиалога.Нет Тогда
			Модифицированность = Ложь;
			Закрыть();
		ИначеЕсли ОтветНаВопрос = КодВозвратаДиалога.Отмена Тогда
			Возврат;
		КонецЕсли; 
		
	КонецЕсли;

КонецПроцедуры

Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	
	ЗакрытьФорму(Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

