Процедура ДействияФормыРедактироватьКод(Кнопка)

	МеханизмНумерацииОбъектов.ИзменениеВозможностиРедактированияНомера(Метаданные.Справочники.ПричиныНетрудоспособности, ЭлементыФормы.СправочникСписок, ЭлементыФормы.ДействияФормы.Кнопки.Подменю, ЭлементыФормы.СправочникСписок.Колонки.Код);

КонецПроцедуры

Процедура ПриОткрытии()

	МеханизмНумерацииОбъектов.УстановитьДоступностьПоляВводаНомера(Метаданные.Справочники.ПричиныНетрудоспособности, ЭлементыФормы.СправочникСписок, ЭлементыФормы.ДействияФормы.Кнопки.Подменю, ЭлементыФормы.СправочникСписок.Колонки.Код);
	СписокВыбора = ПолучитьСписокНеобходимыхНалоговыхДеклараций();
	
	ЭлементыФормы.СправочникСписок.Колонки.СтатьяРасчетовСФСС.ЭлементУправления.СписокВыбора = СписокВыбора;

КонецПроцедуры

Процедура СправочникСписокСтатьяРасчетовСФССНачалоВыбора(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	СписокВыбора = ПолучитьСписокНеобходимыхНалоговыхДеклараций();
	
	ЭлементСписка = ВыбратьИзСписка(СписокВыбора,Элемент,СписокВыбора.НайтиПоЗначению(Элемент.Значение));
	Если ЭлементСписка <> Неопределено И Элемент.Значение <> ЭлементСписка.Значение Тогда
		Элемент.Значение = ЭлементСписка.Значение;
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьСписокНеобходимыхНалоговыхДеклараций()
	СписокВыбора = Новый СписокЗначений;
	
	СписокВыбора.Добавить(Справочники.СтатьиНалоговыхДеклараций.ФССУтрТрудосп_ВремНетрудосп);
	СписокВыбора.Добавить(Справочники.СтатьиНалоговыхДеклараций.ФССУтрТрудосп_Берем);
	СписокВыбора.Добавить(Справочники.СтатьиНалоговыхДеклараций.ФССУтрТрудосп_ВремНетрудоспУход);                                                                                        	
	СписокВыбора.Добавить(Справочники.СтатьиНалоговыхДеклараций.ФССНесчСлуч_ВремНетрудосп);

	Возврат СписокВыбора;
КонецФункции
