
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

Процедура ПриОткрытии()

	ЭлементыФормы.РегистрСведенийСписок.Колонки.Организация.Видимость = Отбор.Организация.Значение.Пустая();

КонецПроцедуры


Процедура ПриЗакрытии()
	
	Если Не ЭтаФорма.ВладелецФормы = Неопределено И ТипЗнч(ЭтаФорма.ВладелецФормы.ЭтотОбъект) = Тип("СправочникОбъект.Организации") Тогда
		Оповестить("ОбновитьНадписьОтражениеВБухучете", , ЭтаФорма.ВладелецФормы);
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЧНОГО ПОЛЯ РегистрСведенийСписок

Процедура РегистрСведенийСписокПриВыводеСтроки(Элемент, ОформлениеСтроки, ДанныеСтроки)
	
	Если НЕ ЗначениеЗаполнено(ДанныеСтроки.СпособОтраженияВБухучете) Тогда
		ОформлениеСтроки.Ячейки.СпособОтраженияВБухучете.Текст = НСтр("ru='<способом отражения по умолчанию>';uk='<способом відображення по умовчанню>'");	
	КонецЕсли;
	
КонецПроцедуры


