Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	СтандартнаяОбработка    = Ложь;
	
	
	Схема   = ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	КМ      = Новый КомпоновщикМакетаКомпоновкиДанных;
	Макет   = КМ.Выполнить(Схема, КомпоновщикНастроек.Настройки);
	
	тзПланы = ПолучитьРезультатДляВывода();
	НаборыДанных = Новый Структура("тзПланы", тзПланы);
	ПК  = Новый ПроцессорКомпоновкиДанных;
	ПК.Инициализировать(Макет, НаборыДанных);
	
	ПВ  = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПВ.УстановитьДокумент(ДокументРезультат);
	ПВ.Вывести(ПК, Истина);
КонецПроцедуры

Функция ПолучитьРезультатДляВывода()
	лЗапрос = Новый Запрос;
	лЗапрос.УстановитьПараметр("ДатаОтчета", КонецМесяца( ДатаОтчета ) );
	лЗапрос.УстановитьПараметр("ГГУ", глЗначениеПеременной("ОрганизацииГленкорАгрикалчерУкраина") );
	лЗапрос.УстановитьПараметр("НоменклатураЗПУ", глЗначениеПеременной("НоменклатураЗПУВартаУніверсал") );
	лЗапрос.УстановитьПараметр("Администрация", глЗначениеПеременной("ПодразделенияАдминистрация") );
	лЗапрос.УстановитьПараметр("Винница", глЗначениеПеременной("ПодразделенияВинница") );
	лЗапрос.УстановитьПараметр("Киев", глЗначениеПеременной("ПодразделенияКиев") );
	лЗапрос.УстановитьПараметр("Николаев", глЗначениеПеременной("ПодразделенияНиколаев") );
	лЗапрос.УстановитьПараметр("Одеса", глЗначениеПеременной("ПодразделенияОдеса") );
	лЗапрос.УстановитьПараметр("Харьков", глЗначениеПеременной("ПодразделенияХарьков") );
	лЗапрос.УстановитьПараметр("Чернигов", глЗначениеПеременной("ПодразделенияЧернигов") );
	лЗапрос.УстановитьПараметр("Гнип", глЗначениеПеременной("ФизическиеЛицаГнипАртурТомаш") );
	лЗапрос.УстановитьПараметр("FODirector", глЗначениеПеременной("ДолжностиОрганизацийFODirector") );
	лЗапрос.УстановитьПараметр("Планы", ПланыЗакупок.Выгрузить() );
	лЗапрос.Текст =
	"ВЫБРАТЬ
	|	ТЗ.Работник,
	|	ТЗ.Подразделение,
	|	ТЗ.План,
	|	ТЗ.БонусПоПлану,
	|	ТЗ.Должность,
	|	ТЗ.Фильтр
	|ПОМЕСТИТЬ Планы
	|ИЗ
	|	&Планы КАК ТЗ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&Винница КАК Подразделение,
	|	ВЫРАЗИТЬ(10300.00 * РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&ДатаОтчета, ГОД), КОНЕЦПЕРИОДА(&ДатаОтчета, МЕСЯЦ), СЕКУНДА) / РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&ДатаОтчета, ГОД), КОНЕЦПЕРИОДА(&ДатаОтчета, ГОД), СЕКУНДА) КАК ЧИСЛО(15, 2)) КАК БонусПоПлану
	|ПОМЕСТИТЬ АдминБонусы
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&Чернигов,
	|	ВЫРАЗИТЬ( 9200.00 * РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&ДатаОтчета, ГОД), КОНЕЦПЕРИОДА(&ДатаОтчета, МЕСЯЦ), СЕКУНДА) / РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&ДатаОтчета, ГОД), КОНЕЦПЕРИОДА(&ДатаОтчета, ГОД), СЕКУНДА) КАК ЧИСЛО(15, 2))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&Николаев,
	|	ВЫРАЗИТЬ( 4000.00 * РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&ДатаОтчета, ГОД), КОНЕЦПЕРИОДА(&ДатаОтчета, МЕСЯЦ), СЕКУНДА) / РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&ДатаОтчета, ГОД), КОНЕЦПЕРИОДА(&ДатаОтчета, ГОД), СЕКУНДА) КАК ЧИСЛО(15, 2))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&Одеса,
	|	ВЫРАЗИТЬ(18800.00 * РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&ДатаОтчета, ГОД), КОНЕЦПЕРИОДА(&ДатаОтчета, МЕСЯЦ), СЕКУНДА) / РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&ДатаОтчета, ГОД), КОНЕЦПЕРИОДА(&ДатаОтчета, ГОД), СЕКУНДА) КАК ЧИСЛО(15, 2))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&Харьков,
	|	ВЫРАЗИТЬ(13800.00 * РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&ДатаОтчета, ГОД), КОНЕЦПЕРИОДА(&ДатаОтчета, МЕСЯЦ), СЕКУНДА) / РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&ДатаОтчета, ГОД), КОНЕЦПЕРИОДА(&ДатаОтчета, ГОД), СЕКУНДА) КАК ЧИСЛО(15, 2))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫРАЗИТЬ(ТЗ.Работник КАК Справочник.ФизическиеЛица) КАК Работник,
	|	ВЫРАЗИТЬ(ТЗ.Должность КАК Справочник.ДолжностиОрганизаций) КАК Должность,
	|	ВЫРАЗИТЬ(ТЗ.Подразделение КАК Справочник.Подразделения) КАК Подразделение,
	|	ТЗ.План,
	|	ТЗ.БонусПоПлану
	|ПОМЕСТИТЬ ПланыПоФилиалам
	|ИЗ
	|	Планы КАК ТЗ
	|ГДЕ
	|	ТИПЗНАЧЕНИЯ(ТЗ.Фильтр) = ТИП(Справочник.Подразделения)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫРАЗИТЬ(ТЗ.Работник КАК Справочник.ФизическиеЛица) КАК Работник,
	|	ВЫРАЗИТЬ(ТЗ.Должность КАК Справочник.ДолжностиОрганизаций) КАК Должность,
	|	ВЫРАЗИТЬ(ТЗ.Подразделение КАК Справочник.Подразделения) КАК Подразделение,
	|	ТЗ.План,
	|	ТЗ.БонусПоПлану
	|ПОМЕСТИТЬ ПланыПоРаботникам
	|ИЗ
	|	Планы КАК ТЗ
	|ГДЕ
	|	НЕ ТИПЗНАЧЕНИЯ(ТЗ.Фильтр) = ТИП(Справочник.Подразделения)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ДокТЧ.Ссылка.ДоговорКонтрагента.Подразделение = &Администрация
	|			ТОГДА &Киев
	|		ИНАЧЕ ДокТЧ.Ссылка.ДоговорКонтрагента.Подразделение
	|	КОНЕЦ КАК Подразделение,
	|	ВЫБОР
	|		КОГДА ДокТЧ.Ссылка.ДоговорКонтрагента.Подразделение = &Администрация
	|				ИЛИ ДокТЧ.Ссылка.ДоговорКонтрагента.Подразделение = &Киев
	|			ТОГДА &Гнип
	|		ИНАЧЕ ДокТЧ.Ссылка.ДоговорКонтрагента.Ответственный.ФизЛицо
	|	КОНЕЦ КАК Работник,
	|	ДокТЧ.Номенклатура КАК Номенклатура,
	|	ДокТЧ.Ссылка КАК Документ,
	|	СУММА(ДокТЧ.Количество) КАК КоличествоГАУ,
	|	0 КАК КоличествоГГБВ
	|ПОМЕСТИТЬ ДокТЧ
	|ИЗ
	|	Документ.ПоступлениеТоваровУслуг.Товары КАК ДокТЧ
	|ГДЕ
	|	ДокТЧ.Ссылка.Проведен
	|	И ДокТЧ.Ссылка.Организация = &ГГУ
	|	И ДокТЧ.Ссылка.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&ДатаОтчета, ГОД) И КОНЕЦПЕРИОДА(&ДатаОтчета, МЕСЯЦ)
	|	И НЕ ДокТЧ.Номенклатура = &НоменклатураЗПУ
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР
	|		КОГДА ДокТЧ.Ссылка.ДоговорКонтрагента.Подразделение = &Администрация
	|			ТОГДА &Киев
	|		ИНАЧЕ ДокТЧ.Ссылка.ДоговорКонтрагента.Подразделение
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ДокТЧ.Ссылка.ДоговорКонтрагента.Подразделение = &Администрация
	|				ИЛИ ДокТЧ.Ссылка.ДоговорКонтрагента.Подразделение = &Киев
	|			ТОГДА &Гнип
	|		ИНАЧЕ ДокТЧ.Ссылка.ДоговорКонтрагента.Ответственный.ФизЛицо
	|	КОНЕЦ,
	|	ДокТЧ.Ссылка,
	|	ДокТЧ.Номенклатура
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ДокТЧ.Ссылка.ДоговорОтправитель.Подразделение = &Администрация
	|			ТОГДА &Киев
	|		ИНАЧЕ ДокТЧ.Ссылка.ДоговорОтправитель.Подразделение
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ДокТЧ.Ссылка.ДоговорОтправитель.Подразделение = &Администрация
	|				ИЛИ ДокТЧ.Ссылка.ДоговорОтправитель.Подразделение = &Киев
	|			ТОГДА &Гнип
	|		ИНАЧЕ ДокТЧ.Ссылка.ДоговорОтправитель.Ответственный.ФизЛицо
	|	КОНЕЦ,
	|	ДокТЧ.Номенклатура,
	|	ДокТЧ.Ссылка,
	|	0,
	|	СУММА(ВЫБОР
	|			КОГДА ДокТЧ.Ссылка.СтатусДокумента = ЗНАЧЕНИЕ(Справочник.СтатусыДокументов.Возврат)
	|				ТОГДА -ДокТЧ.КоличествоРазгрузка
	|			ИНАЧЕ ДокТЧ.КоличествоРазгрузка
	|		КОНЕЦ)
	|ИЗ
	|	Документ.ЦБТ_ДвижениеЗапасов.Товары КАК ДокТЧ
	|ГДЕ
	|	ДокТЧ.Ссылка.Проведен
	|	И НЕ ДокТЧ.Ссылка.ДоговорОтправитель = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	|	И НЕ ДокТЧ.Ссылка.Организация = &ГГУ
	|	И ДокТЧ.Ссылка.Отправитель ССЫЛКА Справочник.Контрагенты
	|	И ДокТЧ.Ссылка.Получатель ССЫЛКА Справочник.Склады
	|	И ДокТЧ.Ссылка.ДатаРазгрузки МЕЖДУ НАЧАЛОПЕРИОДА(&ДатаОтчета, ГОД) И КОНЕЦПЕРИОДА(&ДатаОтчета, МЕСЯЦ)
	|	И НЕ ДокТЧ.Номенклатура = &НоменклатураЗПУ
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР
	|		КОГДА ДокТЧ.Ссылка.ДоговорОтправитель.Подразделение = &Администрация
	|			ТОГДА &Киев
	|		ИНАЧЕ ДокТЧ.Ссылка.ДоговорОтправитель.Подразделение
	|	КОНЕЦ,
	|	ДокТЧ.Номенклатура,
	|	ДокТЧ.Ссылка,
	|	ВЫБОР
	|		КОГДА ДокТЧ.Ссылка.ДоговорОтправитель.Подразделение = &Администрация
	|				ИЛИ ДокТЧ.Ссылка.ДоговорОтправитель.Подразделение = &Киев
	|			ТОГДА &Гнип
	|		ИНАЧЕ ДокТЧ.Ссылка.ДоговорОтправитель.Ответственный.ФизЛицо
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПланыПоФилиалам.Работник,
	|	ПланыПоФилиалам.Должность,
	|	ПланыПоФилиалам.Подразделение,
	|	ПланыПоФилиалам.План,
	|	ПланыПоФилиалам.БонусПоПлану,
	|	ЕСТЬNULL(ДокТЧ.Номенклатура, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)) КАК Номенклатура,
	|	СУММА(ЕСТЬNULL(ДокТЧ.КоличествоГАУ, 0)) КАК КоличествоГАУ,
	|	СУММА(ЕСТЬNULL(ДокТЧ.КоличествоГГБВ, 0)) КАК КоличествоГГБВ
	|ПОМЕСТИТЬ ПоФилиалам
	|ИЗ
	|	ПланыПоФилиалам КАК ПланыПоФилиалам
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДокТЧ КАК ДокТЧ
	|		ПО ПланыПоФилиалам.Подразделение = ДокТЧ.Подразделение
	|
	|СГРУППИРОВАТЬ ПО
	|	ПланыПоФилиалам.Работник,
	|	ПланыПоФилиалам.Должность,
	|	ПланыПоФилиалам.Подразделение,
	|	ПланыПоФилиалам.План,
	|	ПланыПоФилиалам.БонусПоПлану,
	|	ЕСТЬNULL(ДокТЧ.Номенклатура, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПланыПоФилиалам.Работник,
	|	ПланыПоФилиалам.Подразделение,
	|	ПланыПоФилиалам.План,
	|	ПланыПоФилиалам.БонусПоПлану,
	|	СУММА(ПланыПоФилиалам.КоличествоГАУ) КАК КоличествоГАУ,
	|	СУММА(ПланыПоФилиалам.КоличествоГГБВ) КАК КоличествоГГБВ
	|ПОМЕСТИТЬ ПоФилиаламСвернуто
	|ИЗ
	|	ПоФилиалам КАК ПланыПоФилиалам
	|
	|СГРУППИРОВАТЬ ПО
	|	ПланыПоФилиалам.Работник,
	|	ПланыПоФилиалам.Подразделение,
	|	ПланыПоФилиалам.План,
	|	ПланыПоФилиалам.БонусПоПлану
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПланыПоРаботникам.Работник КАК Работник,
	|	ПланыПоРаботникам.Должность,
	|	ПланыПоРаботникам.Подразделение,
	|	ПланыПоРаботникам.План,
	|	ПланыПоРаботникам.БонусПоПлану,
	|	ЕСТЬNULL(ДокТЧ.Номенклатура, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)) КАК Номенклатура,
	|	СУММА(ЕСТЬNULL(ДокТЧ.КоличествоГАУ, 0)) КАК КоличествоГАУ,
	|	СУММА(ЕСТЬNULL(ДокТЧ.КоличествоГГБВ, 0)) КАК КоличествоГГБВ
	|ПОМЕСТИТЬ ПоРаботникам
	|ИЗ
	|	ПланыПоРаботникам КАК ПланыПоРаботникам
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДокТЧ КАК ДокТЧ
	|		ПО ПланыПоРаботникам.Подразделение = ДокТЧ.Подразделение
	|			И ПланыПоРаботникам.Работник = ДокТЧ.Работник
	|
	|СГРУППИРОВАТЬ ПО
	|	ПланыПоРаботникам.Работник,
	|	ПланыПоРаботникам.Должность,
	|	ПланыПоРаботникам.Подразделение,
	|	ПланыПоРаботникам.План,
	|	ПланыПоРаботникам.БонусПоПлану,
	|	ЕСТЬNULL(ДокТЧ.Номенклатура, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка))
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Работник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПланыПоРаботникам.Работник,
	|	ПланыПоРаботникам.Подразделение,
	|	ПланыПоРаботникам.План,
	|	ПланыПоРаботникам.БонусПоПлану,
	|	СУММА(ПланыПоРаботникам.КоличествоГАУ) КАК КоличествоГАУ,
	|	СУММА(ПланыПоРаботникам.КоличествоГГБВ) КАК КоличествоГГБВ
	|ПОМЕСТИТЬ ПоРаботникамСвернуто
	|ИЗ
	|	ПоРаботникам КАК ПланыПоРаботникам
	|
	|СГРУППИРОВАТЬ ПО
	|	ПланыПоРаботникам.Работник,
	|	ПланыПоРаботникам.Подразделение,
	|	ПланыПоРаботникам.План,
	|	ПланыПоРаботникам.БонусПоПлану
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Планы.Работник,
	|	Планы.Должность,
	|	Планы.Подразделение,
	|	Планы.План,
	|	Планы.БонусПоПлану,
	|	Планы.Номенклатура,
	|	ВЫБОР
	|		КОГДА Планы.Подразделение = &Киев
	|			ТОГДА СУММА(Планы.КоличествоГАУ) + СУММА(Планы.КоличествоГГБВ)
	|		ИНАЧЕ СУММА(Планы.КоличествоГАУ) + СУММА(Планы.КоличествоГГБВ)
	|	КОНЕЦ КАК Количество,
	|	ВЫБОР
	|		КОГДА Планы.Подразделение = &Киев
	|			ТОГДА СУММА(Планы.КоличествоГАУ)
	|		ИНАЧЕ СУММА(Планы.КоличествоГАУ)
	|	КОНЕЦ КАК КоличествоГАУ,
	|	ВЫБОР
	|		КОГДА Планы.Подразделение = &Киев
	|			ТОГДА СУММА(Планы.КоличествоГГБВ)
	|		ИНАЧЕ СУММА(Планы.КоличествоГГБВ)
	|	КОНЕЦ КАК КоличествоГГБВ,
	|	СУММА(ВЫБОР
	|			КОГДА Свернуто.КоличествоГАУ + Свернуто.КоличествоГГБВ = 0
	|				ТОГДА 0
	|			ИНАЧЕ ВЫБОР
	|					КОГДА Свернуто.КоличествоГАУ + Свернуто.КоличествоГГБВ >= Планы.План
	|						ТОГДА Планы.БонусПоПлану * (Планы.КоличествоГАУ + Планы.КоличествоГГБВ) / (Свернуто.КоличествоГАУ + Свернуто.КоличествоГГБВ)
	|					ИНАЧЕ Планы.БонусПоПлану * (Планы.КоличествоГАУ + Планы.КоличествоГГБВ) / Планы.План
	|				КОНЕЦ
	|		КОНЕЦ) КАК Бонус,
	|	СУММА(ВЫБОР
	|			КОГДА Свернуто.КоличествоГАУ + Свернуто.КоличествоГГБВ = 0
	|				ТОГДА 0
	|			ИНАЧЕ ЕСТЬNULL(АдминБонусы.БонусПоПлану, 0) * (Планы.КоличествоГАУ + Планы.КоличествоГГБВ) / (Свернуто.КоличествоГАУ + Свернуто.КоличествоГГБВ)
	|		КОНЕЦ) КАК БонусАдмин
	|ПОМЕСТИТЬ Врем
	|ИЗ
	|	ПоФилиалам КАК Планы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПоФилиаламСвернуто КАК Свернуто
	|		ПО Планы.Работник = Свернуто.Работник
	|			И Планы.Подразделение = Свернуто.Подразделение
	|			И Планы.План = Свернуто.План
	|			И Планы.БонусПоПлану = Свернуто.БонусПоПлану
	|		ЛЕВОЕ СОЕДИНЕНИЕ АдминБонусы КАК АдминБонусы
	|		ПО Планы.Подразделение = АдминБонусы.Подразделение
	|
	|СГРУППИРОВАТЬ ПО
	|	Планы.Работник,
	|	Планы.Должность,
	|	Планы.Подразделение,
	|	Планы.План,
	|	Планы.БонусПоПлану,
	|	Планы.Номенклатура,
	|	АдминБонусы.БонусПоПлану
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Планы.Работник,
	|	Планы.Должность,
	|	Планы.Подразделение,
	|	Планы.План,
	|	Планы.БонусПоПлану,
	|	Планы.Номенклатура,
	|	ВЫБОР
	|		КОГДА Планы.Подразделение = &Киев
	|			ТОГДА СУММА(Планы.КоличествоГАУ) + СУММА(Планы.КоличествоГГБВ)
	|		ИНАЧЕ СУММА(Планы.КоличествоГАУ) + СУММА(Планы.КоличествоГГБВ)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА Планы.Подразделение = &Киев
	|			ТОГДА СУММА(Планы.КоличествоГАУ)
	|		ИНАЧЕ СУММА(Планы.КоличествоГАУ)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА Планы.Подразделение = &Киев
	|			ТОГДА СУММА(Планы.КоличествоГГБВ)
	|		ИНАЧЕ СУММА(Планы.КоличествоГГБВ)
	|	КОНЕЦ,
	|	СУММА(ВЫБОР
	|			КОГДА Свернуто.КоличествоГАУ + Свернуто.КоличествоГГБВ = 0
	|				ТОГДА 0
	|			ИНАЧЕ ВЫБОР
	|					КОГДА Свернуто.КоличествоГАУ + Свернуто.КоличествоГГБВ >= Планы.План
	|						ТОГДА Планы.БонусПоПлану * (Планы.КоличествоГАУ + Планы.КоличествоГГБВ) / (Свернуто.КоличествоГАУ + Свернуто.КоличествоГГБВ)
	|					ИНАЧЕ Планы.БонусПоПлану * (Планы.КоличествоГАУ + Планы.КоличествоГГБВ) / Планы.План
	|				КОНЕЦ
	|		КОНЕЦ),
	|	0
	|ИЗ
	|	ПоРаботникам КАК Планы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПоРаботникамСвернуто КАК Свернуто
	|		ПО Планы.Работник = Свернуто.Работник
	|			И Планы.Подразделение = Свернуто.Подразделение
	|			И Планы.План = Свернуто.План
	|			И Планы.БонусПоПлану = Свернуто.БонусПоПлану
	|
	|СГРУППИРОВАТЬ ПО
	|	Планы.Работник,
	|	Планы.Должность,
	|	Планы.Подразделение,
	|	Планы.План,
	|	Планы.БонусПоПлану,
	|	Планы.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Врем.Подразделение,
	|	МАКСИМУМ(Врем.Номенклатура) КАК Номенклатура
	|ПОМЕСТИТЬ НоменклатураПоПодразделениям
	|ИЗ
	|	Врем КАК Врем
	|ГДЕ
	|	Врем.Номенклатура <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	Врем.Подразделение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Врем.Работник,
	|	Врем.Должность,
	|	Врем.Подразделение КАК Подразделение,
	|	Врем.План,
	|	Врем.БонусПоПлану,
	|	ВЫБОР
	|		КОГДА Врем.Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|			ТОГДА НоменклатураПоПодразделениям.Номенклатура
	|		ИНАЧЕ Врем.Номенклатура
	|	КОНЕЦ КАК Номенклатура,
	|	Врем.Количество,
	|	Врем.КоличествоГАУ,
	|	Врем.КоличествоГГБВ,
	|	Врем.Бонус,
	|	Врем.БонусАдмин
	|ПОМЕСТИТЬ Врем2
	|ИЗ
	|	Врем КАК Врем
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НоменклатураПоПодразделениям КАК НоменклатураПоПодразделениям
	|		ПО Врем.Подразделение = НоменклатураПоПодразделениям.Подразделение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Врем3.Работник,
	|	Врем3.Должность,
	|	Врем3.Подразделение,
	|	Врем3.Номенклатура,
	|	СУММА(Врем3.План) КАК План,
	|	СУММА(Врем3.БонусПоПлану) КАК БонусПоПлану,
	|	СУММА(Врем3.Количество) КАК Количество,
	|	СУММА(Врем3.КоличествоГАУ) КАК КоличествоГАУ,
	|	СУММА(Врем3.КоличествоГГБВ) КАК КоличествоГГБВ,
	|	СУММА(Врем3.Бонус) КАК Бонус,
	|	СУММА(Врем3.БонусАдмин) КАК БонусАдмин
	|ИЗ
	|	Врем2 КАК Врем3
	|
	|СГРУППИРОВАТЬ ПО
	|	Врем3.Работник,
	|	Врем3.Должность,
	|	Врем3.Подразделение,
	|	Врем3.Номенклатура";
	
	Возврат лЗапрос.Выполнить().Выгрузить();
КонецФункции
