////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ УПРАВЛЕНИЯ

// Процедура прописывает заголовок формы 
//
// Параметры:
//  Элемент - элемент формы, который отображает организацию
//  
Процедура ОрганизацияПриИзменении(Элемент)

	Заголовок = "Дополнительные начисления работников организации " + Элемент.Значение.Наименование;
    Отбор.Организация.Использование = Не Элемент.Значение.Пустая();
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

// Если форма открывается из списка документов, процедура заполняет организацию 
// прописывает заголовок формы и выставляет отбор регистру
//
Процедура ПриОткрытии()
	
	Если ЗначениеЗаполнено(ПараметрОтборПоРегистратору) Тогда
		
		МетаданныеДокумента = ПараметрОтборПоРегистратору.Метаданные();
		
		Если МетаданныеДокумента.Реквизиты.Найти("Организация") <> Неопределено Тогда
			
			Отбор.Организация.Значение = ПараметрОтборПоРегистратору.Организация;
			Заголовок				   = "Дополнительные начисления работников организации " + Отбор.Организация.Значение.Наименование;
			ЭлементыФормы.Организация.ТолькоПросмотр = Истина
			
		КонецЕсли;
		
		Отбор.Организация.Использование = Истина;
		
	Иначе
		
		Отбор.Организация.Значение = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"),"ОсновнаяОрганизация");
		Заголовок				   = "Дополнительные начисления работников организации " + Отбор.Организация.Значение.Наименование;
	    Отбор.Организация.Использование 			 = Не Отбор.Организация.Значение.Пустая();
		Отбор.Сторно.Значение 	   	  				 = Ложь;
		Отбор.Сторно.Использование 	  				 = Истина;
		Отбор.Активность.Значение 	  				 = Истина;
		Отбор.Активность.Использование				 = Истина;
		Отбор.ФизЛицо.Значение		   				 = ВладелецФормы.ЭлементыФормы.ДополнительныеНачисления.ТекущаяСтрока.Физлицо;
        Отбор.ФизЛицо.Использование    				 = Истина;
		Отбор.ПодразделениеОрганизации.Значение		 = ВладелецФормы.ЭлементыФормы.ДополнительныеНачисления.ТекущаяСтрока.ПодразделениеОрганизации;
        Отбор.ПодразделениеОрганизации.Использование = Истина;
		Отбор.ПериодРегистрации.Значение             = ВладелецФормы.ЭлементыФормы.ПериодРегистрации.Значение;
		Отбор.ПериодРегистрации.ВидСравнения         = ВидСравнения.Меньше;
		Отбор.ПериодРегистрации.Использование        = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриПовторномОткрытии(СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(ПараметрОтборПоРегистратору) Тогда
		
		МетаданныеДокумента = ПараметрОтборПоРегистратору.Метаданные();
		
		Если МетаданныеДокумента.Реквизиты.Найти("Организация") <> Неопределено Тогда
			
			Организация = ПараметрОтборПоРегистратору.Организация;
			Заголовок = "Дополнительные начисления работников организации " + Отбор.Организация.Значение.Наименование;
			ЭлементыФормы.Организация.ТолькоПросмотр = Истина;
			Возврат
			
		КонецЕсли;
		
		Отбор.Организация.Использование = Истина;

	Иначе
		
		Отбор.Организация.Значение		= УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"),"ОсновнаяОрганизация");
	    Отбор.Организация.Использование 			 = Не Отбор.Организация.Значение.Пустая();
		Отбор.Сторно.Значение 	   	  				 = Ложь;
		Отбор.Сторно.Использование 	  				 = Истина;
		Отбор.Активность.Значение 	  				 = Истина;
		Отбор.Активность.Использование				 = Истина;
		Отбор.ФизЛицо.Значение		   				 = ВладелецФормы.ЭлементыФормы.ДополнительныеНачисления.ТекущаяСтрока.Физлицо;
        Отбор.ФизЛицо.Использование    				 = Истина;
		Отбор.ПодразделениеОрганизации.Значение		 = ВладелецФормы.ЭлементыФормы.ДополнительныеНачисления.ТекущаяСтрока.ПодразделениеОрганизации;
        Отбор.ПодразделениеОрганизации.Использование = Истина;
		Отбор.ПериодРегистрации.Значение             = ВладелецФормы.ЭлементыФормы.ПериодРегистрации.Значение;
		Отбор.ПериодРегистрации.ВидСравнения         = ВидСравнения.Меньше;
		Отбор.ПериодРегистрации.Использование        = Истина;
		
	КонецЕсли;
	
	Заголовок = "Дополнительные начисления работников организации";
	ЭлементыФормы.Организация.ТолькоПросмотр = Ложь;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

// Обработчик события выбора строки
Процедура РегистрРасчетаСписокВыборЗначения(Элемент, СтандартнаяОбработка, Значение)
	
	// получим данные записи регистра
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	                      |	*
	                      |ИЗ
	                      |	РегистрРасчета.ДополнительныеНачисленияРаботниковОрганизаций КАК ДополнительныеНачисленияРаботниковОрганизаций
	                      |
	                      |ГДЕ
	                      |	ДополнительныеНачисленияРаботниковОрганизаций.Регистратор = &парамРегистратор И
	                      |	ДополнительныеНачисленияРаботниковОрганизаций.НомерСтроки = &парамНомерСтроки");
	Запрос.УстановитьПараметр("парамРегистратор", Значение.Регистратор);
	Запрос.УстановитьПараметр("парамНомерСтроки", Значение.НомерСтроки);
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	ОповеститьОВыборе(Выборка);
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры


// Обработчик события вывода строки списка регистра
Процедура РегистрРасчетаСписокПриВыводеСтроки(Элемент, ОформлениеСтроки, ДанныеСтроки)
	
	// не показываем некоторые ячейки
	ОформлениеСтроки.Ячейки.КолонкаБазовыйПериод.Видимость = Ложь;
	
КонецПроцедуры

