Процедура ДействияФормыРедактироватьКод(Кнопка)

	МеханизмНумерацииОбъектов.ИзменениеВозможностиРедактированияНомера(Метаданные.Справочники.ВидыДоходовНДФЛ, ЭтаФорма, ЭлементыФормы.ДействияФормы.Кнопки.Подменю, ЭлементыФормы.СправочникСписок.Колонки.Код);

КонецПроцедуры

Процедура ПриОткрытии()
	
	МеханизмНумерацииОбъектов.УстановитьДоступностьПоляВводаНомера(Метаданные.Справочники.ВидыДоходовНДФЛ, ЭлементыФормы.СправочникСписок, ЭлементыФормы.ДействияФормы.Кнопки.Подменю, ЭлементыФормы.СправочникСписок.Колонки.Код);
	
	Если ПроведениеРасчетов.ИспользуетсяНК() Тогда
		ЭлементыФормы.СправочникСписок.Колонки.СтавкаНалогообложенияНеРезидента.Видимость = Ложь;
	КонецЕсли;	
	
КонецПроцедуры

Процедура СправочникСписокПриВыводеСтроки(Элемент, ОформлениеСтроки, ДанныеСтроки)
	
	ОформлениеСтроки.Ячейки.Ставки.Видимость = Ложь;
	
КонецПроцедуры
