////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

// Обработчик события ПриОткрытии формы.
//
Процедура ПриОткрытии()

	Макет = Справочники.КлассификаторСтранМира.ПолучитьМакет("КлассификаторСтранМира");

	КодЯзыка = Локализация.КодЯзыкаИнформационнойБазы();
	Макет.КодЯзыкаМакета = КодЯзыка;
	
	Макет.Параметры.Расшифровка = Истина; // чтобы работала расшифровка
	
	ТабличныйДокумент = ЭлементыФормы.ПолеТабличногоДокумента;

	ТабличныйДокумент.Вывести(Макет);

	ТабличныйДокумент.ФиксацияСверху      = ТабличныйДокумент.Области.ОбластьРасшифровки.Верх - 1;

	ТабличныйДокумент.ОтображатьЗаголовки = Ложь;
	ТабличныйДокумент.ОтображатьСетку     = Ложь;
	ТабличныйДокумент.ТолькоПросмотр      = Истина;

КонецПроцедуры

// Обработчик события ОбработкаРасшифровки элемента ПолеТабличногоДокумента.
//
Процедура ПолеТабличногоДокументаОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;

	// Получение значений полей выбранной строки.

	ТабличныйДокумент = ЭлементыФормы.ПолеТабличногоДокумента;
	ТекущаяОбласть    = ТабличныйДокумент.ТекущаяОбласть;

	ОбластьКодЧисловой         = ТабличныйДокумент.Области.КодЧисловой;
	ОбластьНаименованиеКраткое = ТабличныйДокумент.Области.НаименованиеКраткое;
	
	КодЧисловой         = ТабличныйДокумент.Область(ТекущаяОбласть.Верх, ОбластьКодЧисловой.        Лево, ТекущаяОбласть.Низ, ОбластьКодЧисловой.        Право).Текст;
	НаименованиеКраткое = ТабличныйДокумент.Область(ТекущаяОбласть.Верх, ОбластьНаименованиеКраткое.Лево, ТекущаяОбласть.Низ, ОбластьНаименованиеКраткое.Право).Текст;
	
	// Проверка наличия выбранного элемента.
	Ссылка = Справочники.КлассификаторСтранМира.НайтиПоКоду(КодЧисловой);

	Если НЕ Ссылка.Пустая() Тогда
		Вопрос = НСтр("ru='В справочнике ""Классификатор стран мира"" уже существует элемент с кодом ""';uk='У довіднику ""Класифікатора країн світу"" вже існує елемент з кодом ""'") + КодЧисловой + НСтр("ru='""! Открыть существующий?';uk='""! Відкрити існуючий?'");
		Ответ  = Вопрос(Вопрос, РежимДиалогаВопрос.ДаНетОтмена, , КодВозвратаДиалога.Отмена, );

		Если      Ответ = КодВозвратаДиалога.Да Тогда
			Ссылка.ПолучитьФорму( , ВладелецФормы, ).Открыть();
			Возврат;

		ИначеЕсли Ответ = КодВозвратаДиалога.Отмена Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;

	// Создание нового элемента справочника.
	ФормаНовогоЭлемента = Справочники.КлассификаторСтранМира.ПолучитьФормуНовогоЭлемента(, ВладелецФормы, );

	ФормаНовогоЭлемента.Код                = КодЧисловой;
	ФормаНовогоЭлемента.Наименование       = НаименованиеКраткое;
	ФормаНовогоЭлемента.НаименованиеПолное = НаименованиеКраткое;

	ФормаНовогоЭлемента.Открыть();

КонецПроцедуры
