
Процедура СписокПриВыводеСтроки(Элемент, ОформлениеСтроки, ДанныеСтроки)

	Колонка  = ОформлениеСтроки.Ячейки;
	Субконто = ДанныеСтроки.ВидыСубконто;

	Если Субконто.Количество() >= 1 Тогда
		Колонка.Субконто1.Текст = ?(Субконто[0].ТолькоОбороты, "(об) ", "") + Субконто[0].ВидСубконто;
		Колонка.Субконто1.ОтображатьТекст = Истина;
	КонецЕсли;

	Если Субконто.Количество() >= 2 Тогда
		Колонка.Субконто2.Текст = ?(Субконто[1].ТолькоОбороты, "(об) ", "") + Субконто[1].ВидСубконто;
		Колонка.Субконто2.ОтображатьТекст = Истина;
	КонецЕсли;

	Если Субконто.Количество() >= 3 Тогда
		Колонка.Субконто3.Текст = ?(Субконто[2].ТолькоОбороты, "(об) ", "") + Субконто[2].ВидСубконто;
		Колонка.Субконто3.ОтображатьТекст = Истина;
	КонецЕсли;

	Если Субконто.Количество() >= 4 Тогда
		Колонка.Субконто4.Текст = ?(Субконто[3].ТолькоОбороты, "(об) ", "") + Субконто[3].ВидСубконто;
		Колонка.Субконто4.ОтображатьТекст = Истина;
	КонецЕсли;
	
	Если ДанныеСтроки.ЗапретитьИспользоватьВПроводках Тогда
		ОформлениеСтроки.ЦветФона = WebЦвета.СветлоЖелтый;
	КонецЕсли; 

	Вид = ДанныеСтроки.Вид;
	Если Вид = ВидСчета.Активный  Тогда
		Колонка.Вид.Текст = "А";
	ИначеЕсли Вид = ВидСчета.Пассивный  Тогда
		Колонка.Вид.Текст = "П";
	Иначе
		Колонка.Вид.Текст = "АП";
	КонецЕсли;

	Колонка.Вид.ОтображатьТекст = Истина;

КонецПроцедуры

ПланСчетовСписок.Колонки.Добавить("ВидыСубконто", Ложь);
ПланСчетовСписок.Колонки.Добавить("ЗапретитьИспользоватьВПроводках", Ложь);
ПланСчетовСписок.Колонки.Добавить("Вид", Ложь);
