Функция ОпределитьИспользуетсяЛиВНД(ВидНалоговойДеятельности, УчитыватьНеоблагаемыйВидДеятельностиНДС)

	ЕстьНеИспользуется = Ложь;
	Выборка = Справочники.НалоговыеНазначенияАктивовИЗатрат.Выбрать();
	Пока Выборка.Следующий() Цикл
		Если (НЕ УчитыватьНеоблагаемыйВидДеятельностиНДС) И (Выборка.ВидДеятельностиНДС = Перечисления.ВидыДеятельностиНДС.Необлагаемая) Тогда
			Продолжить;
			// не проверяем эти элементы
		КонецЕсли; 
		Если Выборка.ВидНалоговойДеятельности = ВидНалоговойДеятельности Тогда
			Если НЕ Выборка.Используется Тогда
				ЕстьНеИспользуется = Истина;
			КонецЕсли; 
		КонецЕсли;
	КонецЦикла;
	Возврат НЕ ЕстьНеИспользуется;
	
КонецФункции // ОпределитьИспользуетсяЛиВНД()

Функция ОпределитьИспользуетсяЛиВидДеятельностиНДС(ВидДеятельностиНДС)

	ЕстьНеИспользуется = Ложь;
	Выборка = Справочники.НалоговыеНазначенияАктивовИЗатрат.Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.ВидДеятельностиНДС = ВидДеятельностиНДС Тогда
			Если НЕ Выборка.Используется Тогда
				ЕстьНеИспользуется = Истина;
			КонецЕсли; 
		КонецЕсли;
	КонецЦикла;
	Возврат НЕ ЕстьНеИспользуется;
	
КонецФункции // ОпределитьИспользуетсяЛиВидДеятельностиНДС()
 

Процедура ПриОткрытии()
	
	ИспользоватьНеоблагаемыйВидДеятельностиНДС = ОпределитьИспользуетсяЛиВидДеятельностиНДС(Перечисления.ВидыДеятельностиНДС.Необлагаемая);

	Выборка = Справочники.ВидыНалоговойДеятельности.Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.Ссылка = Справочники.ВидыНалоговойДеятельности.ОблагаемаяПоОбычнойСтавке 
			ИЛИ Выборка.Ссылка = Справочники.ВидыНалоговойДеятельности.НеОблагаемая Тогда
			// используются всегда
			Продолжить;
		КонецЕсли; 
		
		Строка = ТаблицаВНД.Добавить();
		Строка.ВидНалоговойДеятельности = Выборка.Ссылка;
		Строка.Используется  = ОпределитьИспользуетсяЛиВНД(Строка.ВидНалоговойДеятельности, ИспользоватьНеоблагаемыйВидДеятельностиНДС);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОсновныеДействияФормыОК(Кнопка)
	
	Для каждого Строка Из ТаблицаВНД Цикл
		Выборка = Справочники.НалоговыеНазначенияАктивовИЗатрат.Выбрать();
		Пока Выборка.Следующий() Цикл
			Если Выборка.ВидНалоговойДеятельности = Строка.ВидНалоговойДеятельности Тогда
				ФлагИспользуется = Строка.Используется И (?(Выборка.ВидДеятельностиНДС = Перечисления.ВидыДеятельностиНДС.Необлагаемая,ИспользоватьНеоблагаемыйВидДеятельностиНДС,Истина));
				Если НЕ Выборка.Используется = ФлагИспользуется Тогда
					Объект = Выборка.ПолучитьОбъект();
					Объект.Используется = ФлагИспользуется;
					Объект.Записать();
				КонецЕсли; 
			КонецЕсли; 	
		КонецЦикла;
	КонецЦикла;
	
	Закрыть();
	
КонецПроцедуры

