// Обработчик события ПриОткрытии Формы.
//
Процедура ПриОткрытии()

	МеханизмНумерацииОбъектов.УстановитьДоступностьПоляВводаНомера(Метаданные(), ЭтаФорма, ЭлементыФормы.ДействияФормы.Кнопки.Подменю,ЭлементыФормы.Код);
	
	
	Если ЭтоНовый() Тогда
		ЭлементыФормы.Совтав.ТолькоПросмотр = Истина;
	Конецесли;	
	Состав.Отбор.ГруппаВзносов.Значение = Ссылка;
	Состав.Отбор.ГруппаВзносов.Использование = Истина;

КонецПроцедуры // ПриОткрытии()

Процедура ДействияФормыРедактироватьКод(Кнопка)
	
	МеханизмНумерацииОбъектов.ИзменениеВозможностиРедактированияНомера(ЭтотОбъект.Метаданные(), ЭтаФорма, ЭлементыФормы.ДействияФормы.Кнопки.Подменю, ЭлементыФормы.Код);
	
КонецПроцедуры // ДействияФормыРедактироватьКод()

Процедура ПриЗаписи(Отказ)
	
	ЭлементыФормы.Совтав.ТолькоПросмотр = Ложь;
	Состав.Отбор.ГруппаВзносов.Значение = Ссылка;
	Состав.Отбор.ГруппаВзносов.Использование = Истина;
	
КонецПроцедуры
