Перем мСведенияОВидахРасчета;
Перем мДлинаСуток;

Процедура НачисленияПриВыводеСтроки(Элемент, ОформлениеСтроки, ДанныеСтроки)
	
	ВидРасчета = ДанныеСтроки.ВидРасчета;
	СведенияОВидеРасчета = РаботаСДиалогами.ПолучитьСведенияОВидеРасчетаСхемыМотивации(мСведенияОВидахРасчета, ВидРасчета);
	ТолькоПросмотрЯчеек = Ложь;
	
	ЕстьПоказатели = Ложь;
	Для СчПоказателей = 1 По 6 Цикл
		Если СчПоказателей <= СведенияОВидеРасчета["КоличествоПоказателей"] Тогда
			ВидимостьПоказателяИВалюты = Истина;
			Если СведенияОВидеРасчета["Показатель" + СчПоказателей + "НаименованиеВидимость"] Тогда
				ОформлениеСтроки.Ячейки["НаименованиеПоказатель" + СчПоказателей].Видимость = Истина;
				ЕстьПоказатели = Истина;
				ОформлениеСтроки.Ячейки["НаименованиеПоказатель" + СчПоказателей].УстановитьТекст(СведенияОВидеРасчета["Показатель" + СчПоказателей + "Наименование"]);
				ОформлениеСтроки.Ячейки["НаименованиеПоказательТР" + СчПоказателей].Видимость = Ложь;
				ОформлениеСтроки.Ячейки["ТарифныйРазряд" +СчПоказателей].Видимость = Ложь;
			ИначеЕсли СведенияОВидеРасчета["ПоказательТР" + СчПоказателей + "НаименованиеВидимость"] Тогда
				ВидимостьПоказателяИВалюты = Ложь;
				ЕстьПоказатели = Истина;
				ОформлениеСтроки.Ячейки["НаименованиеПоказатель" + СчПоказателей].Видимость = Ложь;
				ОформлениеСтроки.Ячейки["Показатель" + СчПоказателей].Видимость = Ложь;
				ОформлениеСтроки.Ячейки["НаименованиеПоказательТР" + СчПоказателей].УстановитьТекст(СведенияОВидеРасчета["ПоказательТР" + СчПоказателей + "Наименование"]);
				ОформлениеСтроки.Ячейки["НаименованиеПоказательТР" + СчПоказателей].Видимость = Истина;	
				ОформлениеСтроки.Ячейки["ТарифныйРазряд" + СчПоказателей].Видимость = Истина;
			Иначе
				ОформлениеСтроки.Ячейки["НаименованиеПоказатель" + СчПоказателей].Видимость = Ложь;
				ОформлениеСтроки.Ячейки["НаименованиеПоказательТР" + СчПоказателей].Видимость = Ложь;
				ОформлениеСтроки.Ячейки["ТарифныйРазряд" +СчПоказателей].Видимость = Ложь;
			КонецЕсли;
			Если ВидимостьПоказателяИВалюты Тогда
				ОформлениеСтроки.Ячейки["Показатель" + СчПоказателей].Видимость = СведенияОВидеРасчета["Показатель" + СчПоказателей + "Видимость"];
				ОформлениеСтроки.Ячейки["Валюта" + СчПоказателей].Видимость = СведенияОВидеРасчета["Валюта" + СчПоказателей + "Видимость"];
			Иначе
				ОформлениеСтроки.Ячейки["Показатель" + СчПоказателей].Видимость = Ложь;
				ОформлениеСтроки.Ячейки["Валюта" + СчПоказателей].Видимость = Ложь;
			КонецЕсли;
		Иначе
			ОформлениеСтроки.Ячейки["Показатель" + СчПоказателей].Видимость = Ложь;
			ОформлениеСтроки.Ячейки["НаименованиеПоказатель" + СчПоказателей].Видимость = Ложь;
			ОформлениеСтроки.Ячейки["НаименованиеПоказательТР" + СчПоказателей].Видимость = Ложь;
			ОформлениеСтроки.Ячейки["ТарифныйРазряд" +СчПоказателей].Видимость = Ложь;					
			ОформлениеСтроки.Ячейки["Валюта" + СчПоказателей].Видимость = Ложь;
		КонецЕсли;
	КонецЦикла;
	Если не ЕстьПоказатели Тогда
		ОформлениеСтроки.Ячейки.НаименованиеПоказатель1.Видимость = Истина;
		ОформлениеСтроки.Ячейки["Показатель1"].Видимость = Истина;
		ОформлениеСтроки.Ячейки["Валюта1"].Видимость = Истина;
		ОформлениеСтроки.Ячейки["НаименованиеПоказательТР1"].Видимость = Ложь;
		ОформлениеСтроки.Ячейки["ТарифныйРазряд1"].Видимость = Ложь;
	КонецЕсли;
	ОформлениеСтроки.Ячейки.Показатели.Видимость = Ложь;
	
	// События завершения
	Если ДанныеСтроки.ВидРасчетаЗавершения.Пустая() Тогда
		
		Для СчПоказателей = 1 По 6 Цикл
			
			ОформлениеСтроки.Ячейки["НаименованиеПоказатель" + СчПоказателей + "Завершения"].Видимость		= Ложь;
			ОформлениеСтроки.Ячейки["НаименованиеПоказательТР" + СчПоказателей + "Завершения"].Видимость	= Ложь;
			ОформлениеСтроки.Ячейки["ТарифныйРазряд" +СчПоказателей + "Завершения"].Видимость				= Ложь;
			ОформлениеСтроки.Ячейки["Показатель" + СчПоказателей + "Завершения"].Видимость					= Ложь;
			ОформлениеСтроки.Ячейки["Валюта" + СчПоказателей + "Завершения"].Видимость						= Ложь;
			
		КонецЦикла;
		
	Иначе
	
		СведенияОВидеРасчета = РаботаСДиалогами.ПолучитьСведенияОВидеРасчетаСхемыМотивации(мСведенияОВидахРасчета, ДанныеСтроки.ВидРасчетаЗавершения);
		
		ЕстьПоказатели = Ложь;
		Для СчПоказателей = 1 По 6 Цикл
			Если СчПоказателей <= СведенияОВидеРасчета["КоличествоПоказателей"] Тогда
				ВидимостьПоказателяИВалюты = Истина;
				Если СведенияОВидеРасчета["Показатель" + СчПоказателей + "НаименованиеВидимость"] Тогда
					ОформлениеСтроки.Ячейки["НаименованиеПоказатель" + СчПоказателей + "Завершения"].Видимость = Истина;
					ЕстьПоказатели = Истина;
					ОформлениеСтроки.Ячейки["НаименованиеПоказатель" + СчПоказателей + "Завершения"].УстановитьТекст(СведенияОВидеРасчета["Показатель" + СчПоказателей + "Наименование"]);
					ОформлениеСтроки.Ячейки["НаименованиеПоказательТР" + СчПоказателей + "Завершения"].Видимость = Ложь;
					ОформлениеСтроки.Ячейки["ТарифныйРазряд" +СчПоказателей + "Завершения"].Видимость = Ложь;
				ИначеЕсли СведенияОВидеРасчета["ПоказательТР" + СчПоказателей + "НаименованиеВидимость"] Тогда
					ВидимостьПоказателяИВалюты = Ложь;
					ЕстьПоказатели = Истина;
					ОформлениеСтроки.Ячейки["НаименованиеПоказатель" + СчПоказателей + "Завершения"].Видимость = Ложь;
					ОформлениеСтроки.Ячейки["Показатель" + СчПоказателей + "Завершения"].Видимость = Ложь;
					ОформлениеСтроки.Ячейки["НаименованиеПоказательТР" + СчПоказателей + "Завершения"].УстановитьТекст(СведенияОВидеРасчета["ПоказательТР" + СчПоказателей + "Наименование"]);
					ОформлениеСтроки.Ячейки["НаименованиеПоказательТР" + СчПоказателей + "Завершения"].Видимость = Истина;
					ОформлениеСтроки.Ячейки["ТарифныйРазряд" + СчПоказателей + "Завершения"].Видимость = Истина;
				Иначе
					ОформлениеСтроки.Ячейки["НаименованиеПоказатель" + СчПоказателей + "Завершения"].Видимость = Ложь;
					ОформлениеСтроки.Ячейки["НаименованиеПоказательТР" + СчПоказателей + "Завершения"].Видимость = Ложь;
					ОформлениеСтроки.Ячейки["ТарифныйРазряд" +СчПоказателей + "Завершения"].Видимость = Ложь;
				КонецЕсли;
				Если ВидимостьПоказателяИВалюты Тогда
					ОформлениеСтроки.Ячейки["Показатель" + СчПоказателей + "Завершения"].Видимость = СведенияОВидеРасчета["Показатель" + СчПоказателей + "Видимость"];
					ОформлениеСтроки.Ячейки["Валюта" + СчПоказателей + "Завершения"].Видимость = СведенияОВидеРасчета["Валюта" + СчПоказателей + "Видимость"];
				Иначе
					ОформлениеСтроки.Ячейки["Показатель" + СчПоказателей + "Завершения"].Видимость = Ложь;
					ОформлениеСтроки.Ячейки["Валюта" + СчПоказателей + "Завершения"].Видимость = Ложь;
				КонецЕсли;
			Иначе
				ОформлениеСтроки.Ячейки["Показатель" + СчПоказателей + "Завершения"].Видимость = Ложь;
				ОформлениеСтроки.Ячейки["НаименованиеПоказатель" + СчПоказателей + "Завершения"].Видимость = Ложь;
				ОформлениеСтроки.Ячейки["НаименованиеПоказательТР" + СчПоказателей + "Завершения"].Видимость = Ложь;
				ОформлениеСтроки.Ячейки["ТарифныйРазряд" +СчПоказателей + "Завершения"].Видимость = Ложь;					
				ОформлениеСтроки.Ячейки["Валюта" + СчПоказателей + "Завершения"].Видимость = Ложь;
			КонецЕсли;
			
		КонецЦикла;
		Если не ЕстьПоказатели Тогда
			ОформлениеСтроки.Ячейки.НаименованиеПоказатель1.Видимость = Истина;
			ОформлениеСтроки.Ячейки["Показатель1Завершения"].Видимость = Истина;
			ОформлениеСтроки.Ячейки["Валюта1Завершения"].Видимость = Истина;
			ОформлениеСтроки.Ячейки["НаименованиеПоказательТР1Завершения"].Видимость = Ложь;
			ОформлениеСтроки.Ячейки["ТарифныйРазряд1Завершения"].Видимость = Ложь;
		КонецЕсли;
		ОформлениеСтроки.Ячейки.ПоказателиЗавершения.Видимость = Ложь;
	
	КонецЕсли; 
	
	Если Элемент.Колонки.ПериодЗавершения.Видимость Тогда
		ОформлениеСтроки.Ячейки.ПериодЗавершения.ОтображатьТекст = Истина;
		ОформлениеСтроки.Ячейки.ПериодЗавершения.УстановитьТекст(Формат(ДанныеСтроки.ПериодЗавершения - мДлинаСуток, "ДФ=dd.MM.yyyy"));
	КонецЕсли;
	
КонецПроцедуры

мСведенияОВидахРасчета = Новый Соответствие;
мДлинаСуток = 86400;

