
Процедура РегистрСведенийСписокПередНачаломДобавления(Элемент, Отказ, Копирование)
	Отказ = Истина;
КонецПроцедуры

Процедура РегистрСведенийСписокВыбор(Элемент, ВыбраннаяСтрока, Колонка, СтандартнаяОбработка)
	
	Если глМенеджерЗвит1С <> Неопределено И глМенеджерЗвит1С.ФлагОтладки Тогда
		Попытка
			ИДОтчета = Элемент.ТекущиеДанные.ИдОтчета;
			Данные = РегистрыСведений.РасшифровкиРегламентированныхОтчетовЗвит1С.Получить(Новый Структура("ИдОтчета", ИдОтчета));
			Данные.Расшифровка.Получить().ВыбратьСтроку();
		Исключение
		КонецПопытки;
	Иначе	
	     СтандартнаяОбработка = Ложь;
	 КонецЕсли;
	 
КонецПроцедуры
