

// обработчик события Выбор у РегистрСведенийСписок
Процедура РегистрСведенийСписокВыбор(Элемент, ВыбраннаяСтрока, Колонка, СтандартнаяОбработка)

	Если ВыбраннаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ФормаРедактирования = РегистрыСведений.ЗначенияПравПользователя.ПолучитьФорму("ФормаРедактирования", ЭтаФорма);
	ФормаРедактирования.НаборПрав = ВыбраннаяСтрока.НаборПрав;
	ФормаРедактирования.Право = ВыбраннаяСтрока.Право;
	ФормаРедактирования.Открыть();
	
КонецПроцедуры




