Перем мСведенияОВидахРасчетаНачислений;

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

Процедура ПередОткрытием(Отказ, СтандартнаяОбработка)
	РегистрРасчетаСписок.Колонки.Добавить("ПоВременнойСхемеМотивации");
КонецПроцедуры

// Процедура - обработчик события "ПриОткрытии" формы
//
Процедура ПриОткрытии()
	
	мМассивЭУ = Новый Массив();
	мМассивЭУ.Добавить(ЭлементыФормы.РегистрРасчетаСписок.Колонки.ВидСхемыМотивации);
	РаботаСДиалогами.УстановитьВидимостьЭУПоУчетнойПолитикеПоПерсоналу(мМассивЭУ,глЗначениеПеременной("глУчетнаяПолитикаПоПерсоналу"));
	
	мСведенияОВидахРасчетаНачислений = Новый Соответствие;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЧНОГО ПОЛЯ РегистрРасчетаСписок

Процедура РегистрРасчетаСписокПриПолученииДанных(Элемент, ОформленияСтрок)
	Для каждого ОформлениеСтроки Из ОформленияСтрок Цикл
		
		Если ОформлениеСтроки.ДанныеСтроки.Сторно Тогда
			
			ОформлениеСтроки.ЦветТекста = Новый Цвет(255, 0, 0);
			
		КонецЕсли;
		
		// не показываем некоторые ячейки
		Если Элемент.Колонки.ПоВременнойСхемеМотивации.Видимость Тогда
			ОформлениеСтроки.Ячейки.ПоВременнойСхемеМотивации.ОтображатьКартинку = Истина;
			ОформлениеСтроки.Ячейки.ПоВременнойСхемеМотивации.ИндексКартинки = ОформлениеСтроки.ДанныеСтроки.ПоВременнойСхемеМотивации;
		КонецЕсли;
		
		РаботаСДиалогами.ПриВыводеСтрокиНачисленийИУдержаний(ОформлениеСтроки.ДанныеСтроки, ОформлениеСтроки, мСведенияОВидахРасчетаНачислений, Ложь);
		
	КонецЦикла;
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ДЕЙСТВИЯ КОМАНДНЫХ ПАНЕЛЕЙ ФОРМЫ

// Процедура РасчетныйЛистокНажатие 
//
// Параметры:
//  Элемент - Кнопка - "Расчетный листок"
//  
Процедура ДействияФормыРасчетныйЛисток(Кнопка)
	
	УправлениеОтчетами.ВызовРасчетногоЛисткаИзФормыСпискаРР(ЭлементыФормы.РегистрРасчетаСписок.ТекущиеДанные, "УправленческиеНачисления");

КонецПроцедуры //ДействияФормыРасчетныйЛисток

