#Если Клиент Тогда

// Обработчик события формы "ПередОткрытием".
// 
Процедура ПередОткрытием(Отказ, СтандартнаяОбработка)
	
	Если НЕ ПризнакОткрытияФормыИзЯзыка Тогда
		Предупреждение(НСтр("ru='Данная обработка используется в служебных целях, открытие формы запрещено.';uk='Дана обробка використовується в службових цілях, відкриття форми заборонене.'"));
		Отказ = Истина;
	КонецЕсли; 
	
КонецПроцедуры

// Обработчик события "Нажатие" кнопки "ОК" командной панели формы "ОсновныеДействияФормы"
// 
Процедура ОсновныеДействияФормыОК(Кнопка)
	
	Перем HTTP;
	
	Если ЗапомнитьИмяИПароль Тогда
		СохранитьЗначение("ЗапомнитьИмяИПарольПрокси", Истина);
		СохранитьЗначение("ИмяПользователяПрокси"    , ИмяПользователя);
		СохранитьЗначение("ПарольПользователяПрокси" , ПарольПользователя);
	Иначе
		СохранитьЗначение("ЗапомнитьИмяИПарольПрокси", Ложь);
		СохранитьЗначение("ИмяПользователяПрокси"    , "");
		СохранитьЗначение("ПарольПользователяПрокси" , "");
	КонецЕсли; 
	
	Попытка
		ПроксиСервер = Новый ИнтернетПрокси();
		ПроксиСервер.Пользователь = ИмяПользователя;
		ПроксиСервер.Пароль       = ПарольПользователя;
		HTTP = Новый HTTPСоединение(СерверИсточник,,,, ПроксиСервер);
		HTTP.Получить(СтрокаПараметраПолучения, ИмяВходящегоФайла);
	Исключение
		Если ПустаяСтрока(ОписаниеОшибки()) Тогда
			Сообщить(НСтр("ru='Не удалось установить соединение с сервером!';uk=""Не вдалося встановити з'єднання із сервером!"""));
		ИначеЕсли Найти(ОписаниеОшибки(), "407") <> 0 И Найти(НРег(ОписаниеОшибки()), "auth") <> 0 Тогда
			Предупреждение(НСтр("ru='Не правильные имя или пароль доступа!';uk=""Не правильні ім'я або пароль доступу!"""));
		Иначе
			Сообщить("" + ОписаниеОшибки());
		КонецЕсли; 
		Возврат;
	КонецПопытки;
	
	ЭтаФорма.Закрыть(HTTP);
	
КонецПроцедуры

#КонецЕсли
