Перем	мИмяОбъектаМетаданных;

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

// Процедура выполняет запись новой строки в истории ввода
//
Процедура ДополнитьИсторию()

	СписокДляИстории = Новый СписокЗначений();
	СписокДляИстории.Добавить(Отбор.ДокументыПоРаботникуОрганизации.Значение);
	
	РаботаСДиалогами.ДополнитьСписокИсторииВвода(мИмяОбъектаМетаданных + "." + "ФизЛицо", СписокДляИстории);

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ДЕЙСТВИЯ КОМАНДНЫХ ПАНЕЛЕЙ ФОРМЫ

// Процедура вызывается при нажатии кнопки "Печать" командной панели формы,
// вызывает печать по умолчанию для формы документа.
//
Процедура ДействияФормыДействиеПечать(Кнопка)

	Если ЭлементыФормы.ЖурналДокументовСписок.ТекущаяСтрока <> Неопределено Тогда

		Попытка
			УниверсальныеМеханизмы.НапечататьДокументИзФормыСписка(ЭлементыФормы.ЖурналДокументовСписок.ТекущаяСтрока.ПолучитьОбъект())
		Исключение
		КонецПопытки
			
	КонецЕсли;

КонецПроцедуры // ОсновныеДействияФормыДействиеПечать()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ УПРАВЛЕНИЯ

// Процедура - обработчик события "ПриИзменении" поля ввода Физ Лицо.
//
Процедура ФизЛицоПриИзменении(Элемент)

	ДополнитьИсторию();
	Отбор.ДокументыПоРаботникуОрганизации.Использование = ЗначениеЗаполнено(Элемент.Значение);

КонецПроцедуры

// Процедура - обработчик события "НачалоВыбораИзСписка" поля ввода Физ Лицо.
//
Процедура ФизЛицоНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	НовоеЗначение = ВыбратьИзСписка(РаботаСДиалогами.ПолучитьСписокИсторииВвода(мИмяОбъектаМетаданных + "." + "ФизЛицо"), Элемент);

	Если НовоеЗначение <> Неопределено Тогда
		Если ТипЗнч(НовоеЗначение.Значение) = Тип("СписокЗначений") Тогда
			Элемент.Значение = НовоеЗначение.Значение.Получить(0).Значение;
		КонецЕсли;

		// При изменении
		ДополнитьИсторию();
		Отбор.ДокументыПоРаботникуОрганизации.Использование = ЗначениеЗаполнено(Элемент.Значение);
	КонецЕсли;

КонецПроцедуры

Процедура ДействияФормыДвиженияДокументаПоРегистрам(Кнопка)
		
	Если ЭтаФорма.ЭлементыФормы.ЖурналДокументовСписок.ТекущаяСтрока = Неопределено тогда
		Возврат
	КонецЕсли;

	РаботаСДиалогами.НапечататьДвиженияДокумента(ЭлементыФормы.ЖурналДокументовСписок.ТекущиеДанные.Ссылка);

КонецПроцедуры

Процедура ДействияФормыСтруктураПодчиненностиДокумента(Кнопка)
	
	Если ЭлементыФормы.ЖурналДокументовСписок.ТекущиеДанные = Неопределено тогда
		Возврат
	КонецЕсли;
	
	ФормаСтруктурыПодчиненности = ПолучитьОбщуюФорму("ФормаСтруктурыПодчиненности", ЭтаФорма);
	Если ФормаСтруктурыПодчиненности.Открыта() Тогда
		ФормаСтруктурыПодчиненности.Закрыть();
	КонецЕсли;
	ФормаСтруктурыПодчиненности.ДокументСсылка = ЭлементыФормы.ЖурналДокументовСписок.ТекущиеДанные.Ссылка;
	ФормаСтруктурыПодчиненности.Открыть();
	
КонецПроцедуры


мИмяОбъектаМетаданных =  "ЖурналДокументов.ОтклоненияОрганизаций";
