Процедура ТипОбъектаПриИзменении(Элемент)
	
	ИмяМакетаЗаполнения = "НачальноеЗаполнение";
	НаименованиеОбъекта = "";
	
	Если ТипОбъекта = "Справочник" Тогда
		ЭлементыФормы.НаименованиеОбъекта.СписокВыбора.Очистить();
		Для каждого ОбъектМД из Метаданные.Справочники Цикл
			Если ОбъектМД.Макеты.Найти(ИмяМакетаЗаполнения) = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			ЭлементыФормы.НаименованиеОбъекта.СписокВыбора.Добавить(ОбъектМД.Имя,ОбъектМД.Синоним);
		КонецЦикла;	
	ИначеЕсли ТипОбъекта = "ПланВидовХарактеристик" Тогда
		ЭлементыФормы.НаименованиеОбъекта.СписокВыбора.Очистить();
		Для каждого ОбъектМД из Метаданные.ПланыВидовХарактеристик Цикл
			Если ОбъектМД.Макеты.Найти(ИмяМакетаЗаполнения) = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			ЭлементыФормы.НаименованиеОбъекта.СписокВыбора.Добавить(ОбъектМД.Имя,ОбъектМД.Синоним);
		КонецЦикла;	
	ИначеЕсли ТипОбъекта = "ПланВидовРасчета" Тогда
		ЭлементыФормы.НаименованиеОбъекта.СписокВыбора.Очистить();
		Для каждого ОбъектМД из Метаданные.ПланыВидовРасчета Цикл
			Если ОбъектМД.Макеты.Найти(ИмяМакетаЗаполнения) = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			ЭлементыФормы.НаименованиеОбъекта.СписокВыбора.Добавить(ОбъектМД.Имя,ОбъектМД.Синоним);
		КонецЦикла;	
	ИначеЕсли ТипОбъекта = "ПланСчетов" Тогда
		ЭлементыФормы.НаименованиеОбъекта.СписокВыбора.Очистить();
		Для каждого ОбъектМД из Метаданные.ПланыСчетов Цикл
			Если ОбъектМД.Макеты.Найти(ИмяМакетаЗаполнения) = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			ЭлементыФормы.НаименованиеОбъекта.СписокВыбора.Добавить(ОбъектМД.Имя,ОбъектМД.Синоним);
		КонецЦикла;	
	ИначеЕсли ТипОбъекта = "ВсеОбъекты" Тогда
		ЭлементыФормы.НаименованиеОбъекта.СписокВыбора.Очистить();
	КонецЕсли;	
	
	ЭлементыФормы.ОсновныеДействияФормы.Кнопки.Открыть.Доступность = НЕ (ТипОбъекта = "ВсеОбъекты");
	
КонецПроцедуры

Процедура КнопкаВыполнитьНажатие(Кнопка)
	
	ТекстВопроса = НСтр("ru='Все синонимы предопределенных элементов будут перезаполнены на языке информационной базы. Продолжить?';uk='Усі синоніми напередвизначених елементів будуть перезаповнені  мовою інформаційної бази. Продовжити?'");
	Ответ = Вопрос(ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да, "");
	
	Если НЕ Ответ = КодВозвратаДиалога.Да Тогда
		Возврат
	КонецЕсли;
		
	Если ТипОбъекта = "ВсеОбъекты" Тогда
		ЗаполнитьВсеОбъекты()
	Иначе	
		ЗаполнитьОбъект(ТипОбъекта, НаименованиеОбъекта);
	КонецЕсли;	
	
КонецПроцедуры

Процедура ПриОткрытии()
	
	ЯзыкИнформационнойБазы = Локализация.КодЯзыкаИнформационнойБазы();
	
	ТипОбъектаПриИзменении(ЭтаФорма);

КонецПроцедуры
 
Процедура ОсновныеДействияФормыОткрыть(Кнопка)
	
	Если ТипОбъекта = "Справочник" Тогда
		Справочники[НаименованиеОбъекта].ПолучитьФормуСписка().Открыть();
	ИначеЕсли ТипОбъекта = "ПланВидовХарактеристик" Тогда
		ПланыВидовХарактеристик[НаименованиеОбъекта].ПолучитьФормуСписка().Открыть();
	ИначеЕсли ТипОбъекта = "ПланВидовРасчета" Тогда
		ПланыВидовРасчета[НаименованиеОбъекта].ПолучитьФормуСписка().Открыть();
	ИначеЕсли ТипОбъекта = "ПланСчетов" Тогда
		ПланыСчетов[НаименованиеОбъекта].ПолучитьФормуСписка().Открыть();
	КонецЕсли;
	
КонецПроцедуры

