////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

Процедура ПриОткрытии()
	Заголовок = НСтр("ru='Гражданство физ. лица: ';uk='Громадянство фіз. особи: '") + ФизЛицо.Наименование;
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

Процедура ФизЛицоПриИзменении(Элемент)
	Заголовок = НСтр("ru='Гражданство физ. лица: ';uk='Громадянство фіз. особи: '") + Элемент.Значение.Наименование;
КонецПроцедуры

