////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ МОДУЛЯ

Перем мСведенияОСчетах;  // для получения сведений о счетах на время работы формы
Перем мСведенияОСтатьяхЗатрат;  // для получения сведений о статьях затрат на время работы формы

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЧНОГО ПОЛЯ СправочникСписок

Процедура СправочникСписокСчетДтПриИзменении(Элемент)
	СведенияОСчете = БухгалтерскийУчет.ПолучитьСведенияОСчете(мСведенияОСчетах, Элемент.Значение);
	БухгалтерскийУчет.ПривестиЗначениеСубконто(ЭлементыФормы.СправочникСписок, "Дт", СведенияОСчете);
КонецПроцедуры

Процедура СправочникСписокСчетКтПриИзменении(Элемент)
	СведенияОСчете = БухгалтерскийУчет.ПолучитьСведенияОСчете(мСведенияОСчетах, Элемент.Значение);
	БухгалтерскийУчет.ПривестиЗначениеСубконто(ЭлементыФормы.СправочникСписок, "Кт", СведенияОСчете);
КонецПроцедуры

Процедура СправочникСписокПриВыводеСтроки(Элемент, ОформлениеСтроки, ДанныеСтроки)
	
	Если НЕ ДанныеСтроки.ЭтоГруппа Тогда 
		СведенияОСчете = БухгалтерскийУчет.ПолучитьСведенияОСчете(мСведенияОСчетах, ДанныеСтроки.СчетДт);
		БухгалтерскийУчет.НазначитьВидимостьСубконто(ОформлениеСтроки, "Дт", СведенияОСчете);
		
		СведенияОСчете = БухгалтерскийУчет.ПолучитьСведенияОСчете(мСведенияОСчетах, ДанныеСтроки.СчетКт);
		БухгалтерскийУчет.НазначитьВидимостьСубконто(ОформлениеСтроки, "Кт", СведенияОСчете);
	КонецЕсли;
	НастройкаВидимостиНалоговыхНазначенийПоЗатратам(Элемент, ОформлениеСтроки, ДанныеСтроки);
	
КонецПроцедуры

Процедура НастройкаВидимостиНалоговыхНазначенийПоЗатратам(Элемент, ОформлениеСтроки, ДанныеСтроки)
	
	Если ТипЗнч(ДанныеСтроки.СубконтоДт1) = Тип("СправочникСсылка.НоменклатурныеГруппы")
		И ЗначениеЗаполнено(ДанныеСтроки.СубконтоДт1) Тогда
		ОформлениеСтроки.Ячейки.НалоговоеНазначениеНДС.Текст = ДанныеСтроки.СубконтоДт1.НалоговоеНазначениеВПроизводстве;
	КонецЕсли;
	Если ТипЗнч(ДанныеСтроки.СубконтоДт2) = Тип("СправочникСсылка.НоменклатурныеГруппы")
		И ЗначениеЗаполнено(ДанныеСтроки.СубконтоДт2) Тогда
		ОформлениеСтроки.Ячейки.НалоговоеНазначениеНДС.Текст = ДанныеСтроки.СубконтоДт2.НалоговоеНазначениеВПроизводстве;
	КонецЕсли;	
	Если ТипЗнч(ДанныеСтроки.СубконтоДт3) = Тип("СправочникСсылка.НоменклатурныеГруппы")
		И ЗначениеЗаполнено(ДанныеСтроки.СубконтоДт3) Тогда
		ОформлениеСтроки.Ячейки.НалоговоеНазначениеНДС.Текст = ДанныеСтроки.СубконтоДт3.НалоговоеНазначениеВПроизводстве;
	КонецЕсли;
	
	Если ТипЗнч(ДанныеСтроки.СубконтоДт1) = Тип("СправочникСсылка.ОбъектыСтроительства")
		И ЗначениеЗаполнено(ДанныеСтроки.СубконтоДт1) Тогда
		ОформлениеСтроки.Ячейки.НалоговоеНазначениеНДС.Текст = ДанныеСтроки.СубконтоДт1.НалоговоеНазначение;
	КонецЕсли;
	Если ТипЗнч(ДанныеСтроки.СубконтоДт2) = Тип("СправочникСсылка.ОбъектыСтроительства")
		И ЗначениеЗаполнено(ДанныеСтроки.СубконтоДт2) Тогда
		ОформлениеСтроки.Ячейки.НалоговоеНазначениеНДС.Текст = ДанныеСтроки.СубконтоДт2.НалоговоеНазначение;
	КонецЕсли;	
	Если ТипЗнч(ДанныеСтроки.СубконтоДт3) = Тип("СправочникСсылка.ОбъектыСтроительства")
		И ЗначениеЗаполнено(ДанныеСтроки.СубконтоДт3) Тогда
		ОформлениеСтроки.Ячейки.НалоговоеНазначениеНДС.Текст = ДанныеСтроки.СубконтоДт3.НалоговоеНазначение;
	КонецЕсли;

КонецПроцедуры




мСведенияОСчетах = Новый Соответствие;
мСведенияОСтатьяхЗатрат = Новый Соответствие;
