
// Структура содержащая данные о связи элементов управления быстрых отборов с данными
Перем СтруктураСвязиЭлементовСДанными;

Процедура ПриОткрытии()
	
	УправлениеОтчетами.УстановитьСвязьПолейБыстрогоОтбораНаФорме(ЭлементыФормы, ПостроительОтчета.Отбор, СтруктураСвязиЭлементовСДанными, "ОбработкаОбъект.ПостроительОтчета.Отбор");
	ЭлектронныеПисьмаСписок.Отбор.ЭлектронныеПисьмаПоАдресуЭлектроннойПочты.Использование = Истина;
	ЭлементыФормы.ЭлектронныеПисьмаСписок.НастройкаОтбора.ЭлектронныеПисьмаПоАдресуЭлектроннойПочты.Доступность = Ложь;
	
КонецПроцедуры

Процедура ПолеВидаСравненияОбъектПоискаПриИзменении(Элемент)
	
	УправлениеОтчетами.ПолеВидаСравненияПриИзменении(Элемент, ЭлементыФормы);
	ОбновитьТаблицуПисем(ЭлектронныеПисьмаСписок);
	
КонецПроцедуры

Процедура ПолеНастройкиОбъектПоискаПриИзменении(Элемент)
	
	УправлениеОтчетами.ПолеНастройкиПриИзменении(Элемент, ПостроительОтчета.Отбор);
	ОбновитьТаблицуПисем(ЭлектронныеПисьмаСписок);
	
КонецПроцедуры

Процедура КоманднаяПанельОбновить(Кнопка)
	
	ОбновитьТаблицуПисем(ЭлектронныеПисьмаСписок);
	
КонецПроцедуры

Процедура ЭлектронныеПисьмаСписокПриВыводеСтроки(Элемент, ОформлениеСтроки, ДанныеСтроки)
	
	УправлениеЭлектроннойПочтой.ПриВыводеСтрокиЭлектронногоПисьма(Элемент, ОформлениеСтроки, ДанныеСтроки);
	
КонецПроцедуры

Процедура ПередОткрытием(Отказ, СтандартнаяОбработка)
	
	Если НЕ Константы.ИспользованиеВстроенногоПочтовогоКлиента.Получить() Тогда
		Предупреждение(НСтр("ru='Данная опция доступна только в режиме использования встроенного почтового клиента.';uk='Дана опція доступна тільки в режимі використання вбудованого поштового клієнта.'"));
		Отказ = Истина;
	КонецЕсли; 
	
КонецПроцедуры

Процедура ПриЗакрытии()
	
	Если ТипЗнч(ВладелецФормы) = Тип("Форма") Тогда
		Если ВладелецФормы.ЭлементыФормы.Найти("КоманднаяПанельПретендентов") <> Неопределено Тогда
			ВладелецФормы.ЭлементыФормы.КоманднаяПанельПретендентов.Кнопки.Переписка.Пометка = ложь
		КонецЕсли;	
	КонецЕсли;	
	
КонецПроцедуры


Для каждого Реквизит Из Метаданные.Документы.ЭлектронноеПисьмо.Реквизиты Цикл
	ЭлектронныеПисьмаСписок.Колонки.Добавить(Реквизит.Имя, Ложь);
КонецЦикла;
