// показывает заголовок формы
//
Процедура ПоказатьЗаголовок()
	
	Если НЕ ЗначениеЗаполнено(ФизЛицо) Тогда
		Заголовок = НСтр("ru='Фамилия, имя, отчество физ. лица: ';uk=""Прізвище, ім'я, по батькові фіз. особи: """);
	Иначе
		Заголовок = НСтр("ru='Фамилия, имя, отчество физ. лица: ';uk=""Прізвище, ім'я, по батькові фіз. особи: """) + ФизЛицо.Наименование;
	КонецЕсли;	
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

Процедура ПриОткрытии()
	
	ПоказатьЗаголовок();
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

Процедура ФизЛицоПриИзменении(Элемент)
	
	ПоказатьЗаголовок();

КонецПроцедуры





