
Процедура ПриОткрытии()
	
	СписокВыбора = ПолучитьСписокНеобходимыхНалоговыхДеклараций(); 
	
	ЭлементыФормы.РегистрСведенийСписок.Колонки.СтатьяРасчетовСФСС.ЭлементУправления.СписокВыбора = СписокВыбора;

КонецПроцедуры

Процедура РегистрСведенийСписокСтатьяРасчетовСФССНачалоВыбора(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СписокВыбора = ПолучитьСписокНеобходимыхНалоговыхДеклараций();
	
	ЭлементСписка = ВыбратьИзСписка(СписокВыбора,Элемент,СписокВыбора.НайтиПоЗначению(Элемент.Значение));
	Если ЭлементСписка <> Неопределено И Элемент.Значение <> ЭлементСписка.Значение Тогда
		Элемент.Значение = ЭлементСписка.Значение;
	КонецЕсли;

КонецПроцедуры

Функция ПолучитьСписокНеобходимыхНалоговыхДеклараций()
	СписокВыбора = Новый СписокЗначений;
	
	СписокВыбора.Добавить(Справочники.СтатьиНалоговыхДеклараций.ФССУтрТрудосп_Погребен);                                                                            	
	
	Возврат СписокВыбора;
КонецФункции

