Процедура ДействияФормыНастройкаОбновления(Кнопка)
	
	Форма = РегистрыСведений.НастройкаОбновленияВидовРасчета.ПолучитьФормуСписка();
	Форма.РегистрСведенийСписок.Отбор.ПланВидовРасчета.Использование = Истина;
	Форма.РегистрСведенийСписок.Отбор.ПланВидовРасчета.ВидСравнения = ВидСравнения.Равно;
	Форма.РегистрСведенийСписок.Отбор.ПланВидовРасчета.Значение = Перечисления.ПланыВидовРасчета.ВзносыВФонды;
	Форма.Открыть();
	
КонецПроцедуры

Процедура ПриОткрытии()
	
	Если ПроведениеРасчетов.ИспользуетсяЕСВ() Тогда
		ПланВидовРасчетаСписок.Отбор.Актуальность.Значение = Истина;
		ПланВидовРасчетаСписок.Отбор.Актуальность.ВидСравнения = ВидСравнения.Равно;
		ПланВидовРасчетаСписок.Отбор.Актуальность.Использование = Истина;
    КонецЕсли;
	
КонецПроцедуры
