////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

Процедура ДействияФормыРедактироватьКод(Кнопка)
	МеханизмНумерацииОбъектов.ИзменениеВозможностиРедактированияНомера(Метаданные.Справочники.ВариантыОтветовОпросов, ЭлементыФормы.СправочникСписок, ЭлементыФормы.ДействияФормы.Кнопки.Подменю, ЭлементыФормы.СправочникСписок.Колонки.Код);
КонецПроцедуры

// Обработчик события ПриОткрытии Формы.
//
Процедура ПриОткрытии()
	МеханизмНумерацииОбъектов.ДобавитьВМенюДействияКнопкуРедактированияКода(ЭлементыФормы.ДействияФормы.Кнопки.Подменю);
	МеханизмНумерацииОбъектов.УстановитьДоступностьПоляВводаНомера(Метаданные.Справочники.ВариантыОтветовОпросов, ЭлементыФормы.СправочникСписок, ЭлементыФормы.ДействияФормы.Кнопки.Подменю, ЭлементыФормы.СправочникСписок.Колонки.Код);
КонецПроцедуры //ПриОткрытии

// Обработчик события ОбновлениеОтображения Формы.
//
Процедура ОбновлениеОтображения()
	
    Если ПараметрОтборПоВладельцу <> Неопределено Тогда
		Заголовок = НСтр("ru='Варианты ответов на вопрос: ';uk='Варіанти відповідей на питання: '") + ПараметрОтборПоВладельцу.Наименование;
	Иначе
		Заголовок = НСтр("ru='Варианты ответов опросов';uk='Варіанти відповідей опитувань'"); 
	КонецЕсли;	
	
КонецПроцедуры

