////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

Процедура ПриОткрытии()
	Заголовок = НСтр("ru='Семейное положение физ. лица: ';uk='Сімейний стан фіз. особи: '") + ФизЛицо.Наименование;
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

Процедура ФизЛицоПриИзменении(Элемент)
	Заголовок = НСтр("ru='Семейное положение физ. лица: ';uk='Сімейний стан фіз. особи: '") + Элемент.Значение.Наименование;
КонецПроцедуры

