// Процедура прописывает заголовок формы 
//
// Параметры:
//  Элемент - элемент формы, который отображает организацию
//  
Процедура ОрганизацияПриИзменении(Элемент)

	Заголовок = "НДФЛ: расчеты с бюджетом по работникам организации " + Элемент.Значение.Наименование;
    Отбор.Организация.Использование = Не Элемент.Значение.Пустая();

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

// Если форма открывается из списка документов, процедура заполняет организацию 
// прописывает заголовок формы и выставляет отбор регистру
//
Процедура ПриОткрытии()

	Если ЗначениеЗаполнено(ПараметрОтборПоРегистратору) Тогда
		
        МетаданныеДокумента = ПараметрОтборПоРегистратору.Метаданные();
		
		Если МетаданныеДокумента.Реквизиты.Найти("Организация") <> Неопределено Тогда
            Отбор.Организация.Значение = ПараметрОтборПоРегистратору.Организация;
			
			ЭлементыФормы.Организация.ТолькоПросмотр = Истина
			
		КонецЕсли;

		Отбор.Организация.Использование = Истина;
		
	Иначе
		
		ОрганизацияПоУмолчанию = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"),"ОсновнаяОрганизация");
		Отбор.Организация.Значение = ОрганизацияПоУмолчанию;

		Отбор.Организация.Использование = Не Отбор.Организация.Значение.Пустая();

	КонецЕсли;
	
	Заголовок = НСтр("ru='НДФЛ: расчеты с бюджетом по работникам организации ';uk='ПДФО: розрахунки з бюджетом по працівниках організації '") + Отбор.Организация.Значение.Наименование;

КонецПроцедуры

Процедура ПриПовторномОткрытии(СтандартнаяОбработка)

	Если ЗначениеЗаполнено(ПараметрОтборПоРегистратору) Тогда
		
        МетаданныеДокумента = ПараметрОтборПоРегистратору.Метаданные();
		
		Если МетаданныеДокумента.Реквизиты.Найти("Организация") <> Неопределено Тогда
			Отбор.Организация.Значение = ПараметрОтборПоРегистратору.Организация;

			Заголовок = "НДФЛ: расчеты с бюджетом по работникам организации " + Отбор.Организация.Значение.Наименование;
			ЭлементыФормы.Организация.ТолькоПросмотр = Истина;
        	Возврат
			
		КонецЕсли;
		
	КонецЕсли;

	ОрганизацияПоУмолчанию = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"),"ОсновнаяОрганизация");
	Отбор.Организация.Значение = ОрганизацияПоУмолчанию;
	
	Отбор.Организация.Использование = Не Отбор.Организация.Значение.Пустая();
	Заголовок = "НДФЛ: расчеты с бюджетом по работникам организации " + Отбор.Организация.Значение.Наименование;
	ЭлементыФормы.Организация.ТолькоПросмотр = Ложь;

КонецПроцедуры

