////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ, ВЫЗЫВАЕМЫЕ ИЗ ОБРАБОТЧИКОВ ЭЛЕМЕНТОВ ФОРМЫ

Процедура ДокументСписокПриВыводеСтроки(Элемент, ОформлениеСтроки, ДанныеСтроки)
	
	//Если ДанныеСтроки.ТипСобытия = Перечисления.ВходящееИсходящееСобытие.Входящее Тогда
	//	ОформлениеСтроки.Ячейки.ТипСобытия.ИндексКартинки = 0;
	//Иначе
	//	ОформлениеСтроки.Ячейки.ТипСобытия.ИндексКартинки = 1;
	//КонецЕсли; 

	Если НЕ ДанныеСтроки.ВидСобытия.Пустая() Тогда
		ОформлениеСтроки.Ячейки.ВидСобытия.ОтображатьФлажок   = Ложь;
		ОформлениеСтроки.Ячейки.ВидСобытия.ОтображатьКартинку = Истина;
		ОформлениеСтроки.Ячейки.ВидСобытия.ИндексКартинки     = РаботаСДиалогами.ОпределитьИндексКартинкиВидаСобытия(ДанныеСтроки.ВидСобытия,ДанныеСтроки.ТипСобытия);
	Иначе
		ОформлениеСтроки.Ячейки.ВидСобытия.ОтображатьФлажок   = Ложь;
		ОформлениеСтроки.Ячейки.ВидСобытия.ОтображатьКартинку = Ложь;
	КонецЕсли;

	ОформлениеСтроки.Ячейки.СостояниеСобытия.ОтображатьТекст    = Ложь;
	ОформлениеСтроки.Ячейки.СостояниеСобытия.ОтображатьФлажок   = Ложь;
	ОформлениеСтроки.Ячейки.СостояниеСобытия.ОтображатьКартинку = Истина;
	
	Если ДанныеСтроки.СостояниеСобытия = Перечисления.СостоянияСобытий.Запланировано Тогда
		ОформлениеСтроки.Ячейки.СостояниеСобытия.ИндексКартинки = 6;
	ИначеЕсли ДанныеСтроки.СостояниеСобытия = Перечисления.СостоянияСобытий.Завершено Тогда
		ОформлениеСтроки.Ячейки.СостояниеСобытия.ИндексКартинки = 4;
	ИначеЕсли ДанныеСтроки.СостояниеСобытия = Перечисления.СостоянияСобытий.Отменено Тогда
		ОформлениеСтроки.Ячейки.СостояниеСобытия.ИндексКартинки = 5;
	КонецЕсли; 
	
	Если ТипЗнч(ДанныеСтроки.КонтактноеЛицо) = Тип("Строка") Тогда
		ОформлениеСтроки.Ячейки.КонтактноеЛицо.Шрифт       = Новый Шрифт(,, Истина);
		ОформлениеСтроки.Ячейки.КонтактноеЛицо.ЦветТекста  = WebЦвета.ТемноСиний;
	КонецЕсли; 
	
	ОформлениеСтроки.Ячейки.ЕстьВложения.ОтображатьТекст    = Ложь;
	ОформлениеСтроки.Ячейки.ЕстьВложения.ОтображатьФлажок   = Ложь;
	ОформлениеСтроки.Ячейки.ЕстьВложения.ОтображатьКартинку = Истина;
	
	Если ДанныеСтроки.ЕстьВложения Тогда
		ОформлениеСтроки.Ячейки.ЕстьВложения.ИндексКартинки = 0;
	КонецЕсли;
	
КонецПроцедуры

// Процедура вызывается при выборе пункта подменю "Движения документа по регистрам" меню "Перейти".
// командной панели формы. Процедура отрабатывает печать движений документа по регистрам.
//
Процедура ДействияФормыДвиженияДокументаПоРегистрам(Кнопка)

	Если ЭлементыФормы.ДокументСписок.ТекущиеДанные = Неопределено тогда
		Возврат
	КонецЕсли;

	РаботаСДиалогами.НапечататьДвиженияДокумента(ЭлементыФормы.ДокументСписок.ТекущиеДанные.Ссылка);

КонецПроцедуры // ДействияФормыДвиженияДокументаПоРегистрам()
                        
// Процедура вызывается при выборе пункта подменю "Структура подчиненности" меню "Перейти".
Процедура ДействияФормыСтруктураПодчиненностиДокумента(Кнопка)
	
	Если ЭлементыФормы.ДокументСписок.ТекущиеДанные = Неопределено тогда
		Возврат
	КонецЕсли;
	
	РаботаСДиалогами.ПоказатьСтруктуруПодчиненностиДокумента(ЭлементыФормы.ДокументСписок.ТекущиеДанные.Ссылка);
	
КонецПроцедуры

ДокументСписок.Колонки.Добавить("ТипСобытия");
ДокументСписок.Колонки.Добавить("ЕстьВложения");

             

