
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

Процедура РегистрСведенийСписокПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	Ссылка = Справочники.ФизическиеЛица.ПустаяСсылка();
	Если ЭлементыФормы.РегистрСведенийСписок.ТекущиеДанные <> Неопределено Тогда
		Ссылка = ЭлементыФормы.РегистрСведенийСписок.ТекущиеДанные.ФизЛицо	
	КонецЕсли;
	Оповестить("ОбновитьФорму", Новый Структура("ИмяЭлемента","ФИО"),Ссылка);

КонецПроцедуры

Процедура РегистрСведенийСписокПослеУдаления(Элемент)

	Ссылка = Справочники.ФизическиеЛица.ПустаяСсылка();
	Если Отбор.ФизЛицо.Использование Тогда
		Ссылка = Отбор.ФизЛицо.Значение
	КонецЕсли;
	Оповестить("ОбновитьФорму", Новый Структура("ИмяЭлемента","ФИО"), Ссылка);

КонецПроцедуры

Процедура РегистрСведенийСписокПериодПриИзменении(Элемент)
	Если Элемент.Значение > РабочаяДата Тогда
		Ответ = Вопрос(НСтр("ru='Вы действительно хотите ввести фамилию,';uk='Ви дійсно хочете ввести прізвище,'") + Символы.ПС + НСтр("ru='имя и отчество физлица на будущую дату?';uk=""ім'я та по батькові фізособи на майбутню дату?"""), РежимДиалогаВопрос.ДаНет,,КодВозвратаДиалога.Нет);
		Если Ответ = КодВозвратаДиалога.Нет Тогда
			Элемент.Значение = РабочаяДата
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
