
Процедура ОбработкаВыбора(ЗначениеВыбора, Источник)
	СтандартнаяОбработка = Ложь;
	Параметр =КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра( ЭлементыФормы.ПараметрыДанных.ТекущаяСтрока.Параметр);
	Если ТипЗнч(Параметр.Значение) =  Тип("СписокЗначений") Тогда
		Параметр.Значение.Добавить(ЗначениеВыбора);
	КонецЕсли;
	
	ДвеЦифры = Строка(Прав(Параметр.Параметр,2));
	Если Лев(ДвеЦифры,1) = "а" Тогда
		НомерКолонки = Число(Прав(ДвеЦифры,1))
	Иначе
		НомерКолонки = Число(ДвеЦифры)
	КонецЕсли;
	
	Если Лев(Параметр.Параметр,  6) = "парамН" Тогда
		ВывестиИнформациюОКолонкеНачислено(НомерКолонки);
	Иначе
		ВывестиИнформациюОКолонкеУдержано(НомерКолонки);
	КонецЕсли;
	

КонецПроцедуры

Процедура ПриОткрытии()
	НачальныйВыводДанныхКолонок();
КонецПроцедуры


Процедура НачальныйВыводДанныхКолонок()
	ЦветФонаСправки		= РаботаСДиалогами.ВернутьШестнадцатиричноеПредставлениеЦвета(РаботаСДиалогами.ВстроеннаяСправка_ЦветФона());
	ЦветСсылкиСправки	= РаботаСДиалогами.ВернутьШестнадцатиричноеПредставлениеЦвета(РаботаСДиалогами.ВстроеннаяСправка_ЦветСсылки());
	
	ТекстНачальноеЗаполнение =
	"<HTML>
	|	<HEAD>
	|		<META http-equiv=Content-Type content=""text/html; charset=utf-8"">" + РаботаСДиалогами.ВстроеннаяСправка_СтилиДокумента() + "
	|	</HEAD>
	|
	|	<BODY aLink="+ЦветСсылкиСправки+" vLink="+ЦветСсылкиСправки+" link="+ЦветСсылкиСправки+" bgColor="+ЦветФонаСправки+" scroll=auto><FONT face=""MS Sans Serif"" size=1>
	|		<IMG src="+РаботаСДиалогами.ПолучитьПутьККартинкеДляHTML(БиблиотекаКартинок.КартинкаВстроеннойСправкиФормы, ЭлементыФормы.ДанныеКолонки)+">
	|			<DIV>Типовая форма П-6.</DIV>
	|			<DIV>Вы можете просмотреть данные для заполнения каждой из колонок и добавить требуемые виды расчета</DIV>
	/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	|<HR>
	|			<DIV>Тарифна ставка, посадовий оклад <A id=Команда href=""1C:ПерейтиКНачисленоКолонка1""> (нарахування, колонка 1)</A></DIV>
	|<HR>
	|			<DIV>Комісійні від реалізації продукції <A id=Команда href=""1C:ПерейтиКНачисленоКолонка2""> (нарахування, колонка 2)</A></DIV>
	|<HR>
	|			<DIV>Гонорар, авторська винагорода штатним працівника <A id=Команда href=""1C:ПерейтиКНачисленоКолонка3""> (нарахування, колонка 3)</A></DIV>
	|<HR>
	|			<DIV>Оплата праці за час перебування у відрядженні <A id=Команда href=""1C:ПерейтиКНачисленоКолонка4""> (нарахування, колонка 4)</A></DIV>
	|<HR>
	|			<DIV>Оплата за профнавчання інших працівників <A id=Команда href=""1C:ПерейтиКНачисленоКолонка5""> (нарахування, колонка 5)</A></DIV>
	|<HR>
	|			<DIV>Вартість продукції, виданої працівникам при натуральній формі оплати праці<A id=Команда href=""1C:ПерейтиКНачисленоКолонка6""> (нарахування, колонка 6)</A></DIV>
	|<HR>
	|			<DIV>Інші види нарахувань <A id=Команда href=""1C:ПерейтиКНачисленоКолонка7""> (нарахування, колонка 7)</A></DIV>
	|<HR>
	|			<DIV>Премія<A id=Команда href=""1C:ПерейтиКНачисленоКолонка8""> (нарахування, колонка 8)</A></DIV>
	|<HR>
	|			<DIV>Відсоткові або комісійні винагороди<A id=Команда href=""1C:ПерейтиКНачисленоКолонка9"">(колонка 9)</A></DIV>
	|<HR>
	|			<DIV>Оплата роботи в надурочний час, святкові та неробочі дні<A id=Команда href=""1C:ПерейтиКНачисленоКолонка10""> (нарахування, колонка 10)</A></DIV>
	|<HR>
	|			<DIV>Оплата днів відпочинку<A id=Команда href=""1C:ПерейтиКНачисленоКолонка11""> (нарахування, колонка 11)</A></DIV>
	|<HR>
	|			<DIV>Індексація заробітної плати<A id=Команда href=""1C:ПерейтиКНачисленоКолонка12""> (нарахування, колонка 12)</A></DIV>
	|<HR>
	|			<DIV>Компенсація працівникам у зв'язку з порушенням термінів виплати заробітньоїх плати<A id=Команда href=""1C:ПерейтиКНачисленоКолонка13""> (нарахування, колонка 13)</A></DIV>
	|<HR>
	|			<DIV>Витрати на безкоштовний проїзд<A id=Команда href=""1C:ПерейтиКНачисленоКолонка14""> (нарахування, колонка 14)</A></DIV>
	|<HR>
	|			<DIV>Вартість форменного одягу<A id=Команда href=""1C:ПерейтиКНачисленоКолонка15""> (нарахування, колонка 15)</A></DIV>
	|<HR>
	|			<DIV>Відпустка за поточний місяць<A id=Команда href=""1C:ПерейтиКНачисленоКолонка16""> (нарахування, колонка 16)</A></DIV>
	|<HR>
	|			<DIV>Відпустка за наступний період<A id=Команда href=""1C:ПерейтиКНачисленоКолонка17""> (нарахування, колонка 17)</A></DIV>
	|<HR>
	|			<DIV>Інші нарахування за невідпрацьований час<A id=Команда href=""1C:ПерейтиКНачисленоКолонка18""> (нарахування, колонка 18)</A></DIV>
	|<HR>
	|			<DIV>Суміщення професій<A id=Команда href=""1C:ПерейтиКНачисленоКолонка19""> (нарахування, колонка 19)</A></DIV>
	|<HR>
	|			<DIV>Розширення зони обслуговування або збільшення обсягу робіт<A id=Команда href=""1C:ПерейтиКНачисленоКолонка20""> (нарахування, колонка 20)</A></DIV>
	|<HR>
	|			<DIV>Виконання обов'язків тимчасово відсутнього працівниа<A id=Команда href=""1C:ПерейтиКНачалисленоКолонка21""> (нарахування, колонка 21)</A></DIV>	
	|<HR>
	|			<DIV>Робота у важких і шкідливих та особливо важких і особливо шкідливих умовах праці<A id=Команда href=""1C:ПерейтиКНачисленоКолонка22""> (нарахування, колонка 22)</A></DIV>	
	|<HR>
	|			<DIV>Інтенсивність праці<A id=Команда href=""1C:ПерейтиКНачисленоКолонка23""> (нарахування, колонка 23)</A></DIV>	
	|<HR>
	|			<DIV>Робота в нічний час<A id=Команда href=""1C:ПерейтиКНачисленоКолонка24""> (нарахування, колонка 24)</A></DIV>	
	|<HR>
	|			<DIV>Керівництво бригадою<A id=Команда href=""1C:ПерейтиКНачисленоКолонка25""> (нарахування, колонка 25)</A></DIV>	
	|<HR>
	|			<DIV>Висока професійна майстерність<A id=Команда href=""1C:ПерейтиКНачисленоКолонка26""> (нарахування, колонка 26)</A></DIV>	
	|<HR>
	|			<DIV>Класність водіям транспортних засобів<A id=Команда href=""1C:ПерейтиКНачисленоКолонка27""> (нарахування, колонка 27)</A></DIV>	
	|<HR>
	|			<DIV>Високі досягнення праці<A id=Команда href=""1C:ПерейтиКНачисленоКолонка28""> (нарахування, колонка 28)</A></DIV>	
	|<HR>
	|			<DIV>Виконання особливо важливої роботи на певний термін<A id=Команда href=""1C:ПерейтиКНачисленоКолонка29""> (нарахування, колонка 29)</A></DIV>	
	|<HR>
	|			<DIV>Знання та використання в роботі іноземної мови<A id=Команда href=""1C:ПерейтиКНачисленоКолонка30""> (нарахування, колонка 30)</A></DIV>	
	|<HR>
	|			<DIV>Допуск до державної таємниці<A id=Команда href=""1C:ПерейтиКНачисленоКолонка31""> (нарахування, колонка 31)</A></DIV>	
	|<HR>
	|			<DIV>Дипломатичні ранги, персональні звання службових осіб, ранги державних службовців <A id=Команда href=""1C:ПерейтиКНачисленоКолонка32""> (нарахування, колонка 32)</A></DIV>	
	|<HR>
	|			<DIV>Найковий ступінь<A id=Команда href=""1C:ПерейтиКНачисленоКолонка33""> (нарахування, колонка 33)</A></DIV>	
	|<HR>
	|			<DIV>Нормативний час перебування у шахті<A id=Команда href=""1C:ПерейтиКНачисленоКолонка34""> (нарахування, колонка 34)</A></DIV>	
	|<HR>
	|			<DIV>Робота на територіях радіоактивного забруднення<A id=Команда href=""1C:ПерейтиКНачисленоКолонка35""> (нарахування, колонка 35)</A></DIV>	
	|<HR>
	|			<DIV>Інші надбавки та доплати <A id=Команда href=""1C:ПерейтиКНачисленоКолонка36""> (нарахування, колонка 36)</A></DIV>	
	|<HR>
	|			<DIV>Інші види нарахувань<A id=Команда href=""1C:ПерейтиКНачисленоКолонка37""> (нарахування, колонка 37)</A></DIV>	
	|<HR>
	|			<DIV>Винагороди та заохочення, що мають одноразовий характер<A id=Команда href=""1C:ПерейтиКНачисленоКолонка38""> (нарахування, колонка 38)</A></DIV>	
	|<HR>
	|			<DIV>Матеріальна допомога, що має систематичний характер<A id=Команда href=""1C:ПерейтиКНачисленоКолонка39""> (нарахування, колонка 39)</A></DIV>	
	|<HR>
	|			<DIV>Виплати соціального характеру<A id=Команда href=""1C:ПерейтиКНачисленоКолонка40""> (нарахування, колонка 40)</A></DIV>	
	|<HR>
	|			<DIV>Інші виплати, що не належать до фонду оплати праці<A id=Команда href=""1C:ПерейтиКНачисленоКолонка41""> (нарахування, колонка 41)</A></DIV>	
	|<HR>
	|			<DIV>Оплата перших 5 днів тимчасової непрацездатності за рахунок коштів підприємства<A id=Команда href=""1C:ПерейтиКНачисленоКолонка42""> (нарахування, колонка 42)</A></DIV>	
	|<HR>
	|			<DIV>Виконання обов'язків тимчасово відсутнього працівниа<A id=Команда href=""1C:ПерейтиКНачисленоКолонка43""> (нарахування, колонка 43)</A></DIV>	
	|<HR>
	|			<DIV>Дивіденди, відсотки, виплати за паями<A id=Команда href=""1C:ПерейтиКНачисленоКолонка44""> (нарахування, колонка 44)</A></DIV>	
	|<HR>
	|			<DIV>Витрати на відрядження<A id=Команда href=""1C:ПерейтиКНачисленоКолонка45""> (нарахування, колонка 45)</A></DIV>	
	|<HR>
	|			<DIV>Матеріальна допомога разового характеру<A id=Команда href=""1C:ПерейтиКНачисленоКолонка46""> (нарахування, колонка 46)</A></DIV>	
	|<HR>
	|			<DIV>Внески підприємств на медичне та пенсійне страхування працівників<A id=Команда href=""1C:ПерейтиКНачисленоКолонка47""> (нарахування, колонка 47)</A></DIV>	
	|<HR>
	|			<DIV>Інші види нарахувань<A id=Команда href=""1C:ПерейтиКНачисленоКолонка48""> (нарахування, колонка 48)</A></DIV>	
	|<HR>
	|			<DIV>Видано за 1-у половину місяца (аванс)<A id=Команда href=""1C:ПерейтиКУдержаноКолонка1""> (утримання, колонка 1)</A></DIV>	
	|<HR>
	|			<DIV>Внески на загальнообов'язкове державне соціальне страхування: до Пенсійного фонду<A id=Команда href=""1C:ПерейтиКУдержаноКолонка2""> (утримання, колонка 2)</A></DIV>	
	|<HR>
	|			<DIV>Внески на загальнообов'язкове державне соціальне страхування: до Фонду зайнятості<A id=Команда href=""1C:ПерейтиКУдержаноКолонка3""> (утримання, колонка 3)</A></DIV>	
	|<HR>
	|			<DIV>Внески на загальнообов'язкове державне соціальне страхування: до фонду соціального страхування з тимчасової втрати працездатності<A id=Команда href=""1C:ПерейтиКУдержаноКолонка4""> (утримання, колонка 42)</A></DIV>	
	|<HR>
	|			<DIV>Податок на доходи фізичних осіб<A id=Команда href=""1C:ПерейтиКУдержаноКолонка5""> (утримання, колонка 5)</A></DIV>	
	|<HR>
	|			<DIV>Профспілкові внески<A id=Команда href=""1C:ПерейтиКУдержаноКолонка6""> (утримання, колонка 6)</A></DIV>			
	|<HR>
	|			<DIV>Аліменти<A id=Команда href=""1C:ПерейтиКУдержаноКолонка7""> (утримання, колонка 7)</A></DIV>	
	|<HR>
	|			<DIV>Аванс в банк<A id=Команда href=""1C:ПерейтиКУдержаноКолонка8""> (утримання, колонка 8)</A></DIV>	
	|<HR>
	|			<DIV>Каса (належить до видачі)<A id=Команда href=""1C:ПерейтиКУдержаноКолонка9""> (утримання, колонка 9)</A></DIV>	

	////////////////////////////////////////////////////////////////////////////////////
	|		</DIV>
	|	</FONT></BODY>
	|</HTML>";
	
	ЭлементыФормы.ДанныеКолонки.УстановитьТекст(ТекстНачальноеЗаполнение);

	
КонецПроцедуры
	
Процедура ВыполнитьКомандуФормы(Команда, Значение) Экспорт
	
	//Номер колонки может быть как двухзначеным, так и однозначным
	ДвеЦифры = Строка(Прав(Команда,2));
	Если Лев(ДвеЦифры,1) = "а" ИЛИ Лев(ДвеЦифры,1) = "о" Тогда
		НомерКолонки = Число(Прав(ДвеЦифры,1))
	Иначе
		НомерКолонки = Число(ДвеЦифры)
	КонецЕсли;

	Если Команда = "ПерейтиКНачисленоКолонка" + Строка(НомерКолонки) Тогда
		ВывестиИнформациюОКолонкеНачислено(НомерКолонки);
	КонецЕсли;
	
	Если Команда = "ПерейтиКУдержаноКолонка" + Строка(НомерКолонки) Тогда
		ВывестиИнформациюОКолонкеУдержано(НомерКолонки);
	КонецЕсли;

	//
	Если Команда = "ДобавитьККолонкеНачислено" + Строка(НомерКолонки) Тогда
		ДобавитьДанныеККолонкеНачислено(НомерКолонки)
	КонецЕсли;
	//
	
	Если Команда = "ДобавитьККолонкеУдержано" + Строка(НомерКолонки) Тогда
		ДобавитьДанныеККолонкеУдержано(НомерКолонки)
	КонецЕсли;
	
	Если Команда = "УдалитьОтмеченныеНачислено" + Строка(НомерКолонки) Тогда
		УдалитьОтмеченныеДанныеНачислено(НомерКолонки)
	КонецЕсли;

	Если Команда = "УдалитьОтмеченныеУдержано" + Строка(НомерКолонки) Тогда
		УдалитьОтмеченныеДанныеУдержано(НомерКолонки)
	КонецЕсли;


КонецПроцедуры

Процедура ВывестиИнформациюОКолонкеНачислено(НомерКолонки)
	
	ЦветФонаСправки		= РаботаСДиалогами.ВернутьШестнадцатиричноеПредставлениеЦвета(РаботаСДиалогами.ВстроеннаяСправка_ЦветФона());
	ЦветСсылкиСправки	= РаботаСДиалогами.ВернутьШестнадцатиричноеПредставлениеЦвета(РаботаСДиалогами.ВстроеннаяСправка_ЦветСсылки());

	Параметр = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра( Новый ПараметрКомпоновкиДанных("парамНачисленоКолонка"+НомерКолонки));
	
	Текст  = "
	|<HTML>
	|	<HEAD>
	|		<META http-equiv=Content-Type content=""text/html; charset=utf-8"">" + РаботаСДиалогами.ВстроеннаяСправка_СтилиДокумента() + "
	
	|		<style type=""text/css""> 
	|	<!-- 
	|	.medium { 
	|	   height: 15px; 
	|	   width: 10px; 
	|	} 
	|	.big { 
	|	   height: 50px; 
	|	   width: 50px; 
	|	   color: #FFFF00; 
	|	   background-color: #FF0000; 
	|	   border: 1px solid #FF9900; 
	|	}	
	|	--> 
	|</style>

	
	|	</HEAD>
	|
	|	<BODY aLink="+ЦветСсылкиСправки+" vLink="+ЦветСсылкиСправки+" link="+ЦветСсылкиСправки+" bgColor="+ЦветФонаСправки+" scroll=auto><FONT face=""MS Sans Serif"" size=1>
	|		<IMG src="+РаботаСДиалогами.ПолучитьПутьККартинкеДляHTML(БиблиотекаКартинок.КартинкаВстроеннойСправкиФормы, ЭлементыФормы.ДанныеКолонки)+">			<B><DIV>Типовая форма П-6.</DIV></B>
	|			<DIV>Данные попадающие в колонку № " + Строка(НомерКолонки) + """</DIV>
	|<HR> ";

	Если Параметр <> Неопределено Тогда	
		Если ТипЗнч(Параметр.Значение) = Тип("СписокЗначений") Тогда
			Для Каждого Элемент из Параметр.Значение Цикл
				ТипПараметра = ТипЗнч(Элемент.Значение);	
				Продолжить;
			КонецЦикла;
		Иначе
			ТипПараметра = ТипЗнч(Параметр.Значение);
		КонецЕсли;
	КонецЕсли;
	
	Текст = Текст + "<DIV> <B>" + Строка(ТипПараметра) + "   </B></DIV>";
   	Текст = Текст + "<DIV>   </DIV>";
	

	Если Параметр <> Неопределено Тогда	
		Если ТипЗнч(Параметр.Значение) = Тип("СписокЗначений") Тогда
			Для Каждого Элемент из Параметр.Значение Цикл
			//		Текст = Текст + "<DIV> " + Строка(Элемент.Значение) + "   </DIV>";	
				Если Строка(Элемент.Значение) <> "" Тогда
					Текст = Текст + "	<input type=""checkbox""  class=""medium"" size = 50 name = ""increase""  value = """ + Строка(Элемент.Значение)+""" > " + Строка(Элемент.Значение)+ "<br>";
				КонецЕсли
				

			КонецЦикла;
		Иначе
		Текст = Текст + "<DIV> " + Строка(Параметр.Значение) + "   </DIV>";
		КонецЕсли;
		
		Текст = Текст + "<HR>
		|<DIV><A id=Команда href=""1C:УдалитьОтмеченныеНачислено" + Строка(НомерКолонки) + " ""> Удалить отмеченные</A></DIV>
		|		</DIV>
		|</HTML>";

		
		Текст = Текст + "<HR>
		|<DIV><A id=Команда href=""1C:ДобавитьККолонкеНачислено" + Строка(НомерКолонки) + " ""> Добавить</A></DIV>
		|		</DIV>
		|	</FONT></BODY>
		|</HTML>";
	КонецЕсли;

		
	ЭлементыФормы.ДанныеКолонки.УстановитьТекст(Текст);
	
	//ЭлементыФормы.ПараметрыДанных.ТекущаяСтрока = ЭлементыФормы.ПараметрыДанных.
	
	//ЭлементыФормы.ПараметрыДанных.ТекущиеДанные.Параметр = "парамКолонка" + Строка(НомерКолонки);
	
	
КонецПроцедуры

Процедура ВывестиИнформациюОКолонкеУдержано(НомерКолонки)
	
	ЦветФонаСправки		= РаботаСДиалогами.ВернутьШестнадцатиричноеПредставлениеЦвета(РаботаСДиалогами.ВстроеннаяСправка_ЦветФона());
	ЦветСсылкиСправки	= РаботаСДиалогами.ВернутьШестнадцатиричноеПредставлениеЦвета(РаботаСДиалогами.ВстроеннаяСправка_ЦветСсылки());

	Параметр = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра( Новый ПараметрКомпоновкиДанных("парамУдержаноКолонка"+НомерКолонки));
	
	Текст  = "
	|<HTML>
	|	<HEAD>
	|		<META http-equiv=Content-Type content=""text/html; charset=utf-8"">" + РаботаСДиалогами.ВстроеннаяСправка_СтилиДокумента() + "
	
	|		<style type=""text/css""> 
	|	<!-- 
	|	.medium { 
	|	   height: 15px; 
	|	   width: 10px; 
	|	} 
	|	.big { 
	|	   height: 50px; 
	|	   width: 50px; 
	|	   color: #FFFF00; 
	|	   background-color: #FF0000; 
	|	   border: 1px solid #FF9900; 
	|	}	
	|	--> 
	|</style>

	
	|	</HEAD>
	|
	|	<BODY aLink="+ЦветСсылкиСправки+" vLink="+ЦветСсылкиСправки+" link="+ЦветСсылкиСправки+" bgColor="+ЦветФонаСправки+" scroll=auto><FONT face=""MS Sans Serif"" size=1>
	|		<IMG src="+РаботаСДиалогами.ПолучитьПутьККартинкеДляHTML(БиблиотекаКартинок.КартинкаВстроеннойСправкиФормы, ЭлементыФормы.ДанныеКолонки)+">			<B><DIV>Типовая форма П-6.</DIV></B>
	|			<DIV>Данные попадающие в колонку № " + Строка(НомерКолонки) + """</DIV>
	|<HR> ";

	Если Параметр <> Неопределено Тогда	
		Если ТипЗнч(Параметр.Значение) = Тип("СписокЗначений") Тогда
			Для Каждого Элемент из Параметр.Значение Цикл
				ТипПараметра = ТипЗнч(Элемент.Значение);	
				Продолжить;
			КонецЦикла;
		Иначе
			ТипПараметра = ТипЗнч(Параметр.Значение);
		КонецЕсли;
	КонецЕсли;
	
	Текст = Текст + "<DIV> <B>" + Строка(ТипПараметра) + "   </B></DIV>";
   	Текст = Текст + "<DIV>   </DIV>";
	

	Если Параметр <> Неопределено Тогда	
		Если ТипЗнч(Параметр.Значение) = Тип("СписокЗначений") Тогда
			Для Каждого Элемент из Параметр.Значение Цикл
	            //		Текст = Текст + "<DIV> " + Строка(Элемент.Значение) + "   </DIV>";	
				Если Строка(Элемент.Значение) <> "" Тогда
					Текст = Текст + "	<input type=""checkbox""  class=""medium"" size = 50 name = ""decrease""  value = """ + Строка(Элемент.Значение)+""" > " + Строка(Элемент.Значение)+ "<br>";
				КонецЕсли				
			КонецЦикла;
		Иначе
		Текст = Текст + "<DIV> " + Строка(Параметр.Значение) + "   </DIV>";
		КонецЕсли;

		
		Текст = Текст + "<HR>
		|<DIV><A id=Команда href=""1C:УдалитьОтмеченныеУдержано" + Строка(НомерКолонки) + " ""> Удалить отмеченные</A></DIV>
		|		</DIV>
		|</HTML>";

		//Добавлять к начислениям или удержаниям		
		Текст = Текст + "<HR>
		|<DIV><A id=Команда href=""1C:ДобавитьККолонкеУдержано" + Строка(НомерКолонки) + " ""> Добавить</A></DIV>
		|		</DIV>
		|	</FONT></BODY>
		|</HTML>";

	КонецЕсли;

		
	ЭлементыФормы.ДанныеКолонки.УстановитьТекст(Текст);
КонецПроцедуры


Процедура ДобавитьДанныеККолонкеНачислено(НомерКолонки)
	
	Параметр = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра( Новый ПараметрКомпоновкиДанных("парамНачисленоКолонка"+НомерКолонки));
	
	Если Параметр <> Неопределено Тогда	
		Если ТипЗнч(Параметр.Значение) = Тип("СписокЗначений") Тогда
			Для Каждого Элемент из Параметр.Значение Цикл
				ТипПараметра = (ТипЗнч(Элемент.Значение))	;
				Прервать;
			КонецЦикла;
		Иначе
			ТипПараметра = ТипЗнч(Параметр.Значение);
			Если ТипЗнч(ТипПараметра) = Тип("СписокЗначений") Тогда
				Для Каждого Элемент из Параметр.Значение Цикл
					ТипПараметра = (ТипЗнч(Элемент.Значение))	;
					Прервать;
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
		
		Если ТипПараметра = Тип("ПланВидовРасчетаСсылка.ОсновныеНачисленияОрганизаций") Тогда
			Форма = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ПолучитьФормуВыбора(,ЭтаФорма);
		ИначеЕсли ТипПараметра = Тип("ПланВидовРасчетаСсылка.ВзносыВФонды") Тогда
			Форма = ПланыВидовРасчета.ВзносыВФонды.ПолучитьФормуВыбора(,ЭтаФорма);
		ИначеЕсли ТипПараметра = Тип("ПланВидовРасчетаСсылка.УдержанияОрганизаций") Тогда
			Форма = ПланыВидовРасчета.УдержанияОрганизаций.ПолучитьФормуВыбора(,ЭтаФорма);
		ИначеЕсли ТипПараметра = Тип("ПеречислениеСсылка.СпособыРасчетаОплатыТруда") Тогда
			Форма = Перечисления.СпособыРасчетаОплатыТруда.ПолучитьФормуВыбора(,ЭтаФорма);
		ИначеЕсли ТипПараметра = Тип("ПеречислениеСсылка.ХарактерВыплатыЗарплаты") Тогда
			Форма = Перечисления.ХарактерВыплатыЗарплаты.ПолучитьФормуВыбора(,ЭтаФорма);
		ИначеЕсли ТипПараметра = Тип("ПеречислениеСсылка.КодыОперацийВзаиморасчетыСРаботникамиОрганизаций") Тогда
			Форма = Перечисления.ХарактерВыплатыЗарплаты.ПолучитьФормуВыбора(,ЭтаФорма);
		Иначе 
			Возврат;
		КонецЕсли;
		
		Форма.ОткрытьМодально();
		
	КонецЕсли;
	
	СамостоятельнаяНастройка = Истина;

	//ЭлементыФормы.ПараметрыДанных.ТекущаяСтрока.Параметр;



КонецПроцедуры

Процедура ДобавитьДанныеККолонкеУдержано(НомерКолонки)
	
	Параметр = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра( Новый ПараметрКомпоновкиДанных("парамУдержаноКолонка"+НомерКолонки));
	
	Если Параметр <> Неопределено Тогда	
		Если ТипЗнч(Параметр.Значение) = Тип("СписокЗначений") Тогда
			Для Каждого Элемент из Параметр.Значение Цикл
				ТипПараметра = (ТипЗнч(Элемент.Значение))	;
				Прервать;
			КонецЦикла;
		Иначе
			ТипПараметра = ТипЗнч(Параметр.Значение);
			Если ТипЗнч(ТипПараметра) = Тип("СписокЗначений") Тогда
				Для Каждого Элемент из Параметр.Значение Цикл
					ТипПараметра = (ТипЗнч(Элемент.Значение))	;
					Прервать;
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
		
		Если ТипПараметра = Тип("ПланВидовРасчетаСсылка.ОсновныеНачисленияОрганизаций") Тогда
			Форма = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ПолучитьФормуВыбора(,ЭтаФорма);
		ИначеЕсли ТипПараметра = Тип("ПланВидовРасчетаСсылка.ВзносыВФонды") Тогда
			Форма = ПланыВидовРасчета.ВзносыВФонды.ПолучитьФормуВыбора(,ЭтаФорма);
		ИначеЕсли ТипПараметра = Тип("ПланВидовРасчетаСсылка.УдержанияОрганизаций") Тогда
			Форма = ПланыВидовРасчета.УдержанияОрганизаций.ПолучитьФормуВыбора(,ЭтаФорма);
		ИначеЕсли ТипПараметра = Тип("ПеречислениеСсылка.СпособыРасчетаОплатыТруда") Тогда
			Форма = Перечисления.СпособыРасчетаОплатыТруда.ПолучитьФормуВыбора(,ЭтаФорма);
		ИначеЕсли ТипПараметра = Тип("ПеречислениеСсылка.ХарактерВыплатыЗарплаты") Тогда
			Форма = Перечисления.ХарактерВыплатыЗарплаты.ПолучитьФормуВыбора(,ЭтаФорма);
		ИначеЕсли ТипПараметра = Тип("ПеречислениеСсылка.КодыОперацийВзаиморасчетыСРаботникамиОрганизаций") Тогда
			Форма = Перечисления.ХарактерВыплатыЗарплаты.ПолучитьФормуВыбора(,ЭтаФорма);
		Иначе 
			Возврат;
		КонецЕсли;
		
		Форма.ОткрытьМодально();
		
	КонецЕсли;
	
	СамостоятельнаяНастройка = Истина;

	//ЭлементыФормы.ПараметрыДанных.ТекущаяСтрока.Параметр;



КонецПроцедуры

Процедура УдалитьОтмеченныеДанныеНачислено(НомерКолонки)

	
Параметр = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра( Новый ПараметрКомпоновкиДанных("парамНачисленоКолонка"+НомерКолонки));

Для Каждого ЭлементПоляHTMLДокумента ИЗ ЭлементыФормы.ДанныеКолонки.Документ.body.document.all Цикл
	Если ЭлементПоляHTMLДокумента.tagName = "INPUT" Тогда
		Если ЭлементПоляHTMLДокумента.checked Тогда
			Для Каждого ЗначениеПараметра ИЗ Параметр.Значение Цикл
				Если Строка(ЗначениеПараметра ) = ЭлементПоляHTMLДокумента.value Тогда
					Параметр.Значение.Удалить(ЗначениеПараметра);
					Если Параметр.Значение.Количество() = 0 Тогда
						Если ТипЗнч(ЗначениеПараметра.Значение) = Тип("ПланВидовРасчетаСсылка.ОсновныеНачисленияОрганизаций") Тогда
							Параметр.Значение.Добавить(ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ПустаяСсылка());
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;		
КонецЦикла;

 
	ВывестиИнформациюОКолонкеНачислено(НомерКолонки)	


КонецПроцедуры

Процедура УдалитьОтмеченныеДанныеУдержано(НомерКолонки)

	
Параметр = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра( Новый ПараметрКомпоновкиДанных("парамУдержаноКолонка"+НомерКолонки));

Для Каждого ЭлементПоляHTMLДокумента ИЗ ЭлементыФормы.ДанныеКолонки.Документ.body.document.all Цикл
	Если ЭлементПоляHTMLДокумента.tagName = "INPUT" Тогда
		Если ЭлементПоляHTMLДокумента.checked Тогда
			Для Каждого ЗначениеПараметра ИЗ Параметр.Значение Цикл
				Если Строка(ЗначениеПараметра ) = ЭлементПоляHTMLДокумента.value Тогда
					Параметр.Значение.Удалить(ЗначениеПараметра);
					Если Параметр.Значение.Количество() = 0 Тогда
						Если ТипЗнч(ЗначениеПараметра.Значение) = Тип("ПланВидовРасчетаСсылка.УдержанияОрганизаций") Тогда
							Параметр.Значение.Добавить(ПланыВидовРасчета.УдержанияОрганизаций.ПустаяСсылка());
						КонецЕсли;
						Если ТипЗнч(ЗначениеПараметра.Значение) = Тип("ПланВидовРасчетаСсылка.ВзносыВФонды") Тогда
							Параметр.Значение.Добавить(ПланыВидовРасчета.ВзносыВФонды.ПустаяСсылка());
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;		
КонецЦикла;

 
	ВывестиИнформациюОКолонкеУдержано(НомерКолонки)	


КонецПроцедуры


Процедура ДанныеКолонкиonclick(Элемент, pEvtObj)
	РаботаСДиалогами.ПолеHTMLДокументаOnClick(Элемент, pEvtObj, ЭтаФорма);
КонецПроцедуры

Процедура ДанныеКолонкиonmouseout(Элемент, pEvtObj)
	РаботаСДиалогами.ПолеHTMLДокументаOnMouseOut(Элемент, pEvtObj);
КонецПроцедуры

Процедура ДанныеКолонкиonmouseover(Элемент, pEvtObj)
		РаботаСДиалогами.ПолеHTMLДокументаOnMouseOver(Элемент, pEvtObj);
КонецПроцедуры


Процедура ПараметрыДанныхПриАктивизацииСтроки(Элемент)
	
	//Номер колонки может быть как двухзначеным, так и однозначным
	ДвеЦифры = Строка(Прав(Элемент.ТекущиеДанные.Параметр,2));
	Если Лев(ДвеЦифры,1) = "а" ИЛИ Лев(ДвеЦифры,1) = "о" Тогда
		НомерКолонки = Число(Прав(ДвеЦифры,1))
	Иначе
		НомерКолонки = Число(ДвеЦифры)
	КонецЕсли;
	
	Если Лев(Элемент.ТекущиеДанные.Параметр, 6) = "парамН" Тогда
		ВывестиИнформациюОКолонкеНачислено(НомерКолонки);
	Иначе
		ВывестиИнформациюОКолонкеУдержано(НомерКолонки);
	КонецЕсли;
	
КонецПроцедуры

Процедура КоманднаяПанельДереваСтруктурыЗаполнениеПоУмолчанию(Кнопка)	
	ЗаполнитьПараметры(,Истина);
	
	ДвеЦифры = Строка(Прав(ЭлементыФормы.ПараметрыДанных.ТекущаяСтрока.Параметр,2));
	Если Лев(ДвеЦифры,1) = "а" ИЛИ Лев(ДвеЦифры,1) = "о" Тогда
		НомерКолонки = Число(Прав(ДвеЦифры,1))
	Иначе
		НомерКолонки = Число(ДвеЦифры)
	КонецЕсли;

	
	Если Лев(ЭлементыФормы.ПараметрыДанных.ТекущаяСтрока.Параметр, 8) = "парамУде" Тогда
		ВывестиИнформациюОКолонкеУдержано(НомерКолонки)
	Иначе
		ВывестиИнформациюОКолонкеНачислено(НомерКолонки);
	КонецЕсли;
	
		
КонецПроцедуры

Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	Если СамостоятельнаяНастройка Тогда
		СохраненныеНастройки = КомпоновщикНастроек.ПолучитьНастройки();
		ОтчетОбъект.СамостоятельнаяНастройка = Истина;
	КонецЕсли;	
КонецПроцедуры

Процедура ОсновныеДействияФормыОсновныеДействияФормыОК(Кнопка)
	Закрыть();
КонецПроцедуры



