Процедура УстановитьДоступность()
	
	ЭлементыФормы.ВидГарантии.Доступность = НаличиеГарантий;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

Процедура ПриОткрытии()
	
	ФизЛицоПриОткрытии             = ФизЛицо;
	НаличиеГарантийПриОткрытии 	   = НаличиеГарантий;
	ПериодПриОткрытии              = Период;
	ВидГарантииПриОткрытии  	   = ВидГарантии;
	КомментарийПриОткрытии 		   = Комментарий;
		
	Заголовок = Заголовок + " " + ФизЛицо.Наименование;
	
	Прочитать();
	
	// У записи обязательно должны быть заполнены реквизиты ФизЛицо и Период
	Если ФизЛицо.Пустая() Тогда
	    ФизЛицо = ФизЛицоПриОткрытии;
		Период  = ПериодПриОткрытии;
		НаличиеГарантий = Ложь;
	КонецЕсли;
	
	УстановитьДоступность();
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	// Если поменяли дату, то тогда новая  запись
	Если ПериодПриОткрытии <> Период Тогда
		
		// Если что-то поменяли тогда запишем 
		Если ВидГарантииПриОткрытии <> ВидГарантии ИЛИ
			КомментарийПриОткрытии <> Комментарий ИЛИ
			НаличиеГарантийПриОткрытии <> НаличиеГарантий Тогда
		
			МенеджерЗаписи = РегистрыСведений.СведенияОЛицахСДополнительнымиГарантиями.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.Период   = Период;
			МенеджерЗаписи.ФизЛицо  = ФизЛицо;
			МенеджерЗаписи.НаличиеГарантий		    = НаличиеГарантий;
			МенеджерЗаписи.ВидГарантии			   	= ВидГарантии;
			МенеджерЗаписи.Комментарий 		 		= Комментарий;
			
			МенеджерЗаписи.Записать();
			
		КонецЕсли; 
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПослеЗаписи()
	
	Оповестить("ОбновитьФорму", Новый Структура("ИмяЭлемента","НаличиеГарантий"), ФизЛицо);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

Процедура КнопкаИсторияНажатие(Элемент)
	
	ФормаРегистра = РегистрыСведений.СведенияОЛицахСДополнительнымиГарантиями.ПолучитьФормуСписка();
	ФормаРегистра.РегистрСведенийСписок.Отбор.ФизЛицо.Значение = ФизЛицо;
	ФормаРегистра.РегистрСведенийСписок.Отбор.ФизЛицо.ВидСравнения = ВидСравнения.Равно;
	ФормаРегистра.РегистрСведенийСписок.Отбор.ФизЛицо.Использование = Истина;
	ФормаРегистра.ЭлементыФормы.РегистрСведенийСписок.НачальноеОтображениеСписка = НачальноеОтображениеСписка.Конец;
	
	ФормаРегистра.Открыть();
	
КонецПроцедуры

Процедура НаличиеГарантийПриИзменении(Элемент)
	
	Если НЕ НаличиеГарантий Тогда
		ВидГарантии = Справочники.ДополнительныеГарантииВСодействииТрудоустройству.ПустаяСсылка();
	КонецЕсли;
	
	УстановитьДоступность();

КонецПроцедуры
