Процедура ДействияФормыРедактироватьКод(Кнопка)
	МеханизмНумерацииОбъектов.ИзменениеВозможностиРедактированияНомера(Метаданные.Справочники.ПодразделенияОрганизаций, ЭлементыФормы.СправочникСписок, ЭлементыФормы.ДействияФормы.Кнопки.Подменю, ЭлементыФормы.СправочникСписок.Колонки.Код);
КонецПроцедуры

// Процедура обновляет заголовок формы по выбранному 
//  владельцу справочника
//
// Параметры: 
//  Нет.
//
// Возвращаемое значение:
//  Нет.
//
Процедура ОбновитьЗаголовок()

	Заголовок = НСтр("ru='Список подразделений организации ';uk='Список підрозділів організації '") + Организация.Наименование;

	
КонецПроцедуры // ОбновитьЗаголовок()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ ИЗМЕНЕНИЯ ЗНАЧЕНИЙ РЕКВИЗИТОВ ШАПКИ

// обновляем заголовок формы
Процедура ОрганизацияПриИзменении(Элемент)

	ОбновитьЗаголовок()

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ, ОБЩИХ ДЛЯ ВСЕЙ ФОРМЫ

Процедура ПриОткрытии()
	
	// проставляем организацию пользователя по умолчанию
    Если ПараметрВыборПоВладельцу <> Неопределено Тогда
        Организация = ПараметрВыборПоВладельцу
	КонецЕсли;
    Если ПараметрОтборПоВладельцу <> Неопределено Тогда
        Организация = ПараметрОтборПоВладельцу
	КонецЕсли;
	Если ПараметрТекущаяСтрока = Неопределено Тогда
	    Если Организация.Пустая() Тогда
			Организация = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнаяОрганизация");
		КонецЕсли;
	Иначе
		Организация = ПараметрТекущаяСтрока.Владелец;
		ЭлементыФормы.СправочникСписок.ТекущаяСтрока = ПараметрТекущаяСтрока;
	КонецЕсли;
	          
    ОбновитьЗаголовок();
	
	МеханизмНумерацииОбъектов.ДобавитьВМенюДействияКнопкуРедактированияКода(ЭлементыФормы.ДействияФормы.Кнопки.Подменю);
	МеханизмНумерацииОбъектов.УстановитьДоступностьПоляВводаНомера(Метаданные.Справочники.ПодразделенияОрганизаций, ЭлементыФормы.СправочникСписок, ЭлементыФормы.ДействияФормы.Кнопки.Подменю, ЭлементыФормы.СправочникСписок.Колонки.Код);
	
КонецПроцедуры

Процедура ПриПовторномОткрытии()

	Если ПараметрВыборПоВладельцу <> Неопределено Тогда
        Организация = ПараметрВыборПоВладельцу
	КонецЕсли;
    Если ПараметрОтборПоВладельцу <> Неопределено Тогда
        Организация = ПараметрОтборПоВладельцу
	КонецЕсли;

	ОбновитьЗаголовок()

КонецПроцедуры




