
// Процедура - действие кнопки ПодробнееОФормах командной панели ДействияФормы.
//
Процедура ДействияФормыПодробнееОФормах(Кнопка)
	
	Если ЭлементыФормы.СправочникСписок.ТекущиеДанные = Неопределено Тогда
		Предупреждение(НСтр("ru='Выберите отчет!';uk='Виберіть звіт!'"));
		Возврат;
	КонецЕсли;
		
	Если ЭлементыФормы.СправочникСписок.ТекущиеДанные.Ссылка.ЭтоГруппа = Истина Тогда
		Предупреждение(НСтр("ru='Функция недоступна для группы отчетов!';uk='Функція недоступна для групи звітів!'"));
		Возврат;
	КонецЕсли;
	
	ФормаПодробнееОФормах = Обработки.ОбщиеОбъектыРегламентированнойОтчетности.ПолучитьФорму("ПодробнееОбОтчете");
	ФормаПодробнееОФормах.НачальноеЗначениеВыбора = ЭлементыФормы.СправочникСписок.ТекущиеДанные.Ссылка;
	ФормаПодробнееОФормах.ОткрытьМодально();
	
КонецПроцедуры
