
Процедура СписокОСПриАктивизацииСтроки(Элемент)
	
	Если ЭлементыФормы.Список.ТекущиеДанные <> Неопределено Тогда
		
		ЭлементыФормы.Дерево.ТекущаяСтрока = ЭлементыФормы.Список.ТекущиеДанные.Родитель;
		
	КонецЕсли;

КонецПроцедуры

// Зададим возможные состояния окна.
СоединяемоеОкно                 = Истина;
РазрешитьСостояниеПрикрепленное = Истина;
РазрешитьСостояниеСвободное     = Истина;

// Положение окна по умолчанию.
СостояниеОкна                   = ВариантСостоянияОкна.Прикрепленное;
ПоложениеПрикрепленногоОкна     = ВариантПрикрепленияОкна.Право;
