////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ МОДУЛЯ

Перем НП;

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

// Формирует текст заголовка
//
// Параметры:
//	Нет.
//
Процедура СформироватьЗаголовокФормы()

	Заголовок = УправлениеОтчетами.СформироватьЗаголовокОсновнойФормы(ДатаНач, ДатаКон, НСтр("ru='Книга аналитического учета депонированной зарплаты';uk='Книга аналітичного обліку депонованої зарплати'"), 0);

КонецПроцедуры // СформироватьЗаголовокФормы()

///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

// Процедура - обработчик события перед открытием формы
//
Процедура ПередОткрытием(Отказ, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(ДатаНач) Тогда
		ДатаНач=НачалоГода(РабочаяДата);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ДатаКон) Тогда
		ДатаКон=КонецГода(РабочаяДата);
	КонецЕсли;
	
	СформироватьЗаголовокФормы();

КонецПроцедуры // ПередОткрытием()


// Процедура - обработчик события "При открытии" формы отчета.
//
Процедура ПриОткрытии()

	Если Не ЗначениеЗаполнено(Организация) Тогда
		Если ЗначениеЗаполнено(глЗначениеПеременной("глТекущийПользователь")) Тогда
			РаботаСДиалогами.ЗаполнитьРеквизитыФормы(ЭтаФорма, глЗначениеПеременной("глТекущийПользователь"))
		КонецЕсли;
	КонецЕсли;
		
	НП = Новый НастройкаПериода;

КонецПроцедуры // ПриОткрытии()

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ КОМАНДНЫХ ПАНЕЛЕЙ

// Процедура-обработчик события нажатия кнопки "Сформировать"
Процедура ДействияФормыСформировать(Кнопка)
	СформироватьОтчет(ЭлементыФормы.ДокументРезультат);
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ДИАЛОГА

Процедура КнопкаНастройкаПериодаНажатие(Элемент)
	
	Если НП.Редактировать() Тогда
		
		ДатаНач = НП.ПолучитьДатуНачала();
		ДатаКон = НП.ПолучитьДатуОкончания();
		
	КонецЕсли;
	
	СформироватьЗаголовокФормы();
	
КонецПроцедуры

// Процедура - обработчик изменения данных в поле ввода "ДатаНач"
//
Процедура ДатаНачПриИзменении(Элемент)
	
	СформироватьЗаголовокФормы();
	
КонецПроцедуры

// Процедура - обработчик изменения данных в поле ввода "ДатаКон"
//
Процедура ДатаКонПриИзменении(Элемент)
	
	СформироватьЗаголовокФормы();
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ

