////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ УПРАВЛЕНИЯ

Процедура ДействияФормыРедактироватьКод(Кнопка)
	МеханизмНумерацииОбъектов.ИзменениеВозможностиРедактированияНомера(ЭтотОбъект.Метаданные(), ЭтаФорма, ЭлементыФормы.ДействияФормы.Кнопки.Подменю, ЭлементыФормы.Код);
КонецПроцедуры
// Обработчик события ПриИзменении элемента НазначениеКатегории.
//
Процедура НазначениеКатегорииПриИзменении(Элемент)

	Если НЕ ЭтоНовый() 
	   И НазначениеКатегории <> Ссылка.НазначениеКатегории 
	   И ПолныеПрава.Категории_СуществуютСсылки(Ссылка) Тогда

		Предупреждение(НСтр("ru='Существуют объекты, которым назначена категория ""';uk='Існують об''єкти, яким призначена категорія ""'") + Наименование + НСтр("ru='""."
"Назначение категории не может быть изменено.';uk='""."
"Призначення категорії не може бути змінено.'"));

		НазначениеКатегории = Ссылка.НазначениеКатегории;
	КонецЕсли;

КонецПроцедуры

Процедура ПриОткрытии()
	
	МеханизмНумерацииОбъектов.ДобавитьВМенюДействияКнопкуРедактированияКода(ЭлементыФормы.ДействияФормы.Кнопки.Подменю);
	МеханизмНумерацииОбъектов.УстановитьДоступностьПоляВводаНомера(Метаданные(), ЭтаФорма, ЭлементыФормы.ДействияФормы.Кнопки.Подменю,ЭлементыФормы.Код);
КонецПроцедуры

Процедура ПослеЗаписи()
	МеханизмНумерацииОбъектов.ОбновитьПодсказкуКодНомерОбъекта(ЭтотОбъект.Метаданные(), ЭлементыФормы.ДействияФормы.Кнопки.Подменю, ЭлементыФормы.Код);
КонецПроцедуры

