
Процедура ПриОткрытии()
	
	ВидРасчета = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОкладПоДням;
	
	мСведенияОВидахРасчетаОснНачислений = Новый Соответствие;
	СведенияОВидеРасчета = РаботаСДиалогами.ПолучитьСведенияОВидеРасчетаСхемыМотивации(мСведенияОВидахРасчетаОснНачислений, ВидРасчета);

	Для СчПоказателей = 1 По Мин(СведенияОВидеРасчета["КоличествоПоказателей"],6) Цикл
		Если СведенияОВидеРасчета["Показатель" + СчПоказателей + "Видимость"] Тогда
			НС = Показатели.Добавить();
			НС.Номер = СчПоказателей;
			НС.Показатель = СведенияОВидеРасчета["Показатель"+счПоказателей+"Наименование"];
			НС.Действие = НСтр("ru='Установить значение';uk='Встановити значення'");
		КонецЕсли;	
	КонецЦикла;	
КонецПроцедуры

Процедура ОсновныеДействияФормыВыполнить(Кнопка)
	
	Если Действие = "Добавить" Тогда
		Для Каждого Сотрудник из Работники Цикл
			СтруктураПоиска = Новый Структура("Сотрудник,ВидРасчета", Сотрудник.Сотрудник,ВидРасчета);
			НайденныеСтроки = Документ.ОсновныеНачисления.НайтиСтроки(СтруктураПоиска);
			Если НайденныеСтроки.Количество() = 0 Тогда
				НС = Документ.ОсновныеНачисления.Добавить();
				НС.Сотрудник = Сотрудник.Сотрудник;
				НС.ВидРасчета = ВидРасчета;
				НС.Действие = Перечисления.ВидыДействияСНачислением.Начать;
				Для Каждого Показатель из Показатели Цикл
					НС["Показатель"+Показатель.Номер] = Показатель.Значение;
				КонецЦикла;
			КонецЕсли;	
		КонецЦикла;
		Документ.ОсновныеНачисления.Сортировать("Сотрудник");
	ИначеЕсли Действие = "Изменить" Тогда
		Для Каждого СтрокаТЧ из Документ.ОсновныеНачисления Цикл
			Если СтрокаТЧ.ВидРасчета <> ВидРасчета Тогда
				Продолжить;
			КонецЕсли;
			
			Для Каждого Показатель из Показатели Цикл
				Если Показатель.Действие = НСтр("ru='Установить значение';uk='Встановити значення'") Тогда
					СтрокаТЧ["Показатель"+Показатель.Номер] = Показатель.Значение;
				ИначеЕсли Показатель.Действие = НСтр("ru='Изменить (суммой)';uk='Змінити (сумою)'") Тогда
					СтрокаТЧ["Показатель"+Показатель.Номер] = СтрокаТЧ["Показатель"+Показатель.Номер]+Показатель.Значение;	
				ИначеЕсли Показатель.Действие = НСтр("ru='Изменить (процентом)';uk='Змінити (відсотком)'") Тогда
					СтрокаТЧ["Показатель"+Показатель.Номер] = СтрокаТЧ["Показатель"+Показатель.Номер]+СтрокаТЧ["Показатель"+Показатель.Номер]*Показатель.Значение/100;	
				КонецЕсли;	
			КонецЦикла;
			СтрокаТЧ.Действие = Перечисления.ВидыДействияСНачислением.Изменить;
		КонецЦикла;
		
	ИначеЕсли Действие = "Удалить" Тогда
		Для Каждого СтрокаТЧ из Документ.ОсновныеНачисления Цикл
			Если СтрокаТЧ.ВидРасчета <> ВидРасчета Тогда
				Продолжить;
			КонецЕсли;
			СтрокаТЧ.Действие = Перечисления.ВидыДействияСНачислением.Прекратить;
		КонецЦикла;
		
	КонецЕсли;	
	Закрыть();
	
КонецПроцедуры

Процедура ВидРасчетаПриИзменении(Элемент)
	
	Показатели.Очистить();
	
	Если Действие = "Удалить" Тогда
		Возврат;
	КонецЕсли;	
	
	мСведенияОВидахРасчетаОснНачислений = Новый Соответствие;
	СведенияОВидеРасчета = РаботаСДиалогами.ПолучитьСведенияОВидеРасчетаСхемыМотивации(мСведенияОВидахРасчетаОснНачислений, ВидРасчета);

	Для СчПоказателей = 1 По Мин(СведенияОВидеРасчета["КоличествоПоказателей"],6) Цикл
		Если СведенияОВидеРасчета["Показатель" + СчПоказателей + "Видимость"] Тогда
			НС = Показатели.Добавить();
			НС.Номер = СчПоказателей;
			НС.Показатель = СведенияОВидеРасчета["Показатель"+счПоказателей+"Наименование"];
			НС.Действие = НСтр("ru='Установить значение';uk='Встановити значення'");
		КонецЕсли;	
	КонецЦикла;	
	
	
	
КонецПроцедуры

Процедура ДействиеПриИзменении(Элемент)
	
	Если Действие = "Удалить" Тогда
		Показатели.Очистить();
	ИначеЕсли Действие = "Добавить" Тогда
		Элементыформы.Показатели.Колонки.Действие.Видимость = Ложь;
	Иначе
		Элементыформы.Показатели.Колонки.Действие.Видимость = Истина;
	КонецЕсли;	
	
КонецПроцедуры

Процедура ПоказателиДействиеПриИзменении(Элемент)
	
	Если Элементыформы.Показатели.ТекущиеДанные.Действие = НСтр("ru='Не изменять';uk='Не змінювати'") Тогда
		 Элементыформы.Показатели.ТекущиеДанные.Значение = 0;
	КонецЕсли;	 
	
КонецПроцедуры
