
Процедура СправочникСписокПриАктивизацииСтроки(Элемент)
	
	Если ЭлементыФормы.СправочникСписок.ТекущиеДанные <> Неопределено Тогда
		
		ЭлементыФормы.СправочникДерево.ТекущаяСтрока = ЭлементыФормы.СправочникСписок.ТекущиеДанные.Родитель;
		
	КонецЕсли;
	
КонецПроцедуры

// Обработчик события элемента КоманднаяПанельФормы.ДействиеКатегории.
//
Процедура ДействияФормыДействиеКатегории(Кнопка)

	Если НЕ ЗначениеЗаполнено(ЭлементыФормы.СправочникСписок.ТекущаяСтрока) Тогда
		Возврат;
	КонецЕсли;
	Форма = Обработки.КатегорииОбъекта.ПолучитьФорму("КатегорииОбъекта", ЭтаФорма, );
	Форма.НазначениеКатегорий   = ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_ОсновныеСредства;
	Форма.ОбъектОтбораКатегорий = ЭлементыФормы.СправочникСписок.ТекущаяСтрока;
	Форма.ПрочитатьЗаполнитьКатегорииОбъекта();
	Форма.Открыть();

КонецПроцедуры

// Обработчик события элемента КоманднаяПанельФормы.ДействиеСвойства.
//
Процедура ДействияФормыДействиеСвойства(Кнопка)

	Если НЕ ЗначениеЗаполнено(ЭлементыФормы.СправочникСписок.ТекущаяСтрока) Тогда
		Возврат;
	КонецЕсли;
	Форма = Обработки.ЗначенияСвойствОбъекта.ПолучитьФорму("ЗначенияСвойствОбъекта", ЭтаФорма, );
	Форма.НазначениеСвойств      = ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_ОсновныеСредства;
	Форма.ОбъектОтбораЗначений   = ЭлементыФормы.СправочникСписок.ТекущаяСтрока;
	Форма.ОбъектОтбораНазначений = ЭлементыФормы.СправочникСписок.ТекущаяСтрока;
	Форма.ПрочитатьЗаполнитьСвойстваИЗначения();
	Форма.Открыть();

КонецПроцедуры





