
Процедура КнопкаСоздатьНовыйНажатие(Элемент)
	
	Закрыть(КодВозвратаДиалога.Да);
	
КонецПроцедуры

Процедура КнопкаЗаписатьПоверхСтарогоНажатие(Элемент)
	
	Закрыть(КодВозвратаДиалога.Нет);
	
КонецПроцедуры

Процедура КнопкаОтменитьНажатие(Элемент)
	
	Закрыть(КодВозвратаДиалога.Отмена);
	
КонецПроцедуры

Процедура ПередОткрытием(Отказ, СтандартнаяОбработка)
	
	ТекстСообщения =	НСтр("ru='В редактируемом регламентированном отчете был изменен вид"
"документа (первичный/корректирующий) и(или) номер корректировки."
"Создать новый экземпляр отчета с указанными значениями вида"
"документа и номера корректировки, или переписать существующий"
"отчет?';uk='У регламентованому звіті, що редагується, був змінений вид"
"документа (первинний/коригуючий) і(або) номер коректування."
"Створити новий екземпляр звіту із зазначеними значеннями виду"
"документа й номера коректування, або переписати існуючий"
"звіт?'")
	
КонецПроцедуры
