Перем ИмяБазы;

Процедура ПриОткрытии()
	
	ИмяБазы=Метаданные.Имя;
	Если 	  Найти(ИмяБазы, "БухгалтерияДляУкраины")=1 Тогда ИмяБазы="БУ"
	ИначеЕсли Найти(ИмяБазы, "УправлениеПроизводственнымПредприятиемДляУкраины")=1 Тогда  ИмяБазы="УПП"
	ИначеЕсли Найти(ИмяБазы, "УправлениеТорговымПредприятиемДляУкраины")=1 Тогда ИмяБазы="УТП"
	ИначеЕсли Найти(ИмяБазы, "УправлениеТорговлейДляУкраины")=1 Тогда ИмяБазы="УТ"
	КонецЕсли;
	
	Если ИмяБазы = "УТП" Тогда 
		КонецЕсли;
		
		
	
КонецПроцедуры	
Функция КнопкаВыполнитьНажатие(Кнопка) Экспорт

	//Переменные записываются во внутренние переменные плаформы
	СохранитьЗначение("МаркаАвто", ЭлементыФормы.Марка.Значение);
	СохранитьЗначение("НомерАвто", ЭлементыФормы.НомерАвто.Значение);
	СохранитьЗначение("ТипАвто",ЭлементыФормы.ТипАвто.Значение);
	СохранитьЗначение("МаркаПриц", ЭлементыФормы.МаркаПриц.Значение);
	СохранитьЗначение("НомерПриц", ЭлементыФормы.НомерПриц.Значение);
	СохранитьЗначение("ТипПриц",ЭлементыФормы.ТипПриц.Значение);
	СохранитьЗначение("ЗакажчикАлко", ЭлементыФормы.Закажчик.Значение);
	СохранитьЗначение("ПеревожчикАлко", ЭлементыФормы.Перевожчик.Значение);
	СохранитьЗначение("ВодФИО", ЭлементыФормы.ВодФИО.Значение);
	СохранитьЗначение("УдостоверениеВод", ЭлементыФормы.удостоверение.Значение);
	//СохранитьЗначение("ПунктРазгрузкиАлкоН", ЭлементыФормы.ПунктРазгрузкиН.Значение);  //Название
	//СохранитьЗначение("ПунктРазгрузкиАлкоА", ЭлементыФормы.ПунктРазгрузкиА.Значение);//Адресс
	СохранитьЗначение("ПунктПогрузкиАлкоН", ЭлементыФормы.ПунктПогрузкиН.Значение); //Название
	СохранитьЗначение("ПунктПогрузкиАлкоА", ЭлементыФормы.ПунктПогрузкиА.Значение);//Адресс
	СохранитьЗначение("СопроводДокумент", ЭлементыФормы.СопроводДокумент.Значение);
	СохранитьЗначение("ГрузополучательДолжность", ЭлементыФормы.СопроводДокумент.Значение);
	СохранитьЗначение("ГрузополучательФИО", ЭлементыФормы.СопроводДокумент.Значение);
	СохранитьЗначение("АкцизныйПодаток", ЭлементыФормы.АкцизныйПодаток.Значение);
	  	
	Закрыть();
	
	
КонецФункции

