////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ УПРАВЛЕНИЯ

// Процедура прописывает заголовок формы 
//
// Параметры:
//  Элемент - элемент формы, который отображает организацию
//  
Процедура ОрганизацияПриИзменении(Элемент)

	Заголовок = "Дополнительные начисления работников организации " + Элемент.Значение.Наименование;
    Отбор.Организация.Использование = Не Элемент.Значение.Пустая();
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

// Если форма открывается из списка документов, процедура заполняет организацию 
// прописывает заголовок формы и выставляет отбор регистру
//
Процедура ПриОткрытии()
	
	Если ЗначениеЗаполнено(ПараметрОтборПоРегистратору) Тогда
		
		МетаданныеДокумента = ПараметрОтборПоРегистратору.Метаданные();
		
		Если МетаданныеДокумента.Реквизиты.Найти("СторнируемыйДокумент") <> Неопределено Тогда
			
			МетаданныеДокумента 		= ПараметрОтборПоРегистратору.СторнируемыйДокумент.Метаданные();
			ПараметрОтборПоРегистратору = ПараметрОтборПоРегистратору.СторнируемыйДокумент;
			
		КонецЕсли;
		
		Если МетаданныеДокумента.Реквизиты.Найти("Организация") <> Неопределено Тогда
			
			ГоловнаяОрганизация = ПроцедурыУправленияПерсоналом.ГоловнаяОрганизация(ПараметрОтборПоРегистратору.Организация);
			
			Отбор.Организация.Значение = ГоловнаяОрганизация;
			Заголовок				   = "Дополнительные начисления работников организации " + Отбор.Организация.Значение.Наименование;
			ЭлементыФормы.Организация.ТолькоПросмотр = Истина
			
		КонецЕсли;
		
		Отбор.Организация.Использование = Истина;
		
	Иначе
		
		Отбор.Организация.Значение = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"),"ОсновнаяОрганизация");
		Заголовок				   = "Дополнительные начисления работников организации " + Отбор.Организация.Значение.Наименование;
	    Отбор.Организация.Использование = Не Отбор.Организация.Значение.Пустая();
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриПовторномОткрытии(СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(ПараметрОтборПоРегистратору) Тогда
		
		МетаданныеДокумента = ПараметрОтборПоРегистратору.Метаданные();
		
		Если МетаданныеДокумента.Реквизиты.Найти("Организация") <> Неопределено Тогда
			
			ГоловнаяОрганизация = ПроцедурыУправленияПерсоналом.ГоловнаяОрганизация(ПараметрОтборПоРегистратору.Организация);
			
			Отбор.Организация.Значение = ГоловнаяОрганизация;
			Заголовок = "Дополнительные начисления работников организации " + Отбор.Организация.Значение.Наименование;
			ЭлементыФормы.Организация.ТолькоПросмотр = Истина;
			Возврат
			
		КонецЕсли;
		
		Отбор.Организация.Использование = Истина;

	Иначе
		
		Отбор.Организация.Значение		= УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"),"ОсновнаяОрганизация");
	    Отбор.Организация.Использование = Не Отбор.Организация.Значение.Пустая();
		
	КонецЕсли;
	
	Заголовок = "Дополнительные начисления работников организации";
	ЭлементыФормы.Организация.ТолькоПросмотр = Ложь;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

// Обработчик события вывода строки списка регистра
Процедура РегистрРасчетаСписокПриВыводеСтроки(Элемент, ОформлениеСтроки, ДанныеСтроки)
	
	// не показываем некоторые ячейки
	ОформлениеСтроки.Ячейки.КолонкаБазовыйПериод.Видимость = Ложь;
	ОформлениеСтроки.Ячейки.КолонкаПериодРасчетаСреднегоЗаработка.Видимость = Ложь;
	
КонецПроцедуры




