
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЧНЫХ ПОЛЕЙ

// Процедура обеспечивает отбор доступных кандидатов по пользователю в списке 
// записей регистра.
//
Процедура СписокПользователейПриАктивизацииСтроки(Элемент)
	
ТекущийПользователь = Элемент.ТекущаяСтрока.Ссылка;

Если  ТекущийПользователь = неопределено Тогда 
	Возврат
КонецЕсли;

    РегистрСведенийНаборЗаписей.Отбор.Пользователь.Значение	  = Элемент.ТекущаяСтрока;
	РегистрСведенийНаборЗаписей.Отбор.Пользователь.Использование = Истина;
    	

КонецПроцедуры  // СписокПользователейПриАктивизацииСтроки



////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ДЕЙСТВИЯ КОМАНДНЫХ ПАНЕЛЕЙ ФОРМЫ


Процедура ДействияФормыУдалить(Кнопка)
	
	ЗаписьОКандидате = ЭлементыФормы.РегистрСведенийНаборЗаписей.ТекущиеДанные;
	
КонецПроцедуры //  ДействияФормыУдалить




