////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

Процедура ПриОткрытии()
	
	// Установка доступности отбора и порядка.
	СохранениеНастроек.УстановитьДоступностьОтбора(ЭлементыФормы.СправочникСписокСохраненныеНастройки);
	СохранениеНастроек.УстановитьДоступностьПорядка(ЭлементыФормы.СправочникСписокСохраненныеНастройки);
	
	// Применение настройки по-умолчанию.
	Если СохраненнаяНастройка.Пустая() Тогда
		ПрименитьНастройку();
	КонецЕсли;
	
	// Настройка вида списка.
	СохранениеНастроек.НастроитьВидСписка(ЭлементыФормы.СправочникСписокСохраненныеНастройки, глЗначениеПеременной("глТекущийПользователь"));
	
КонецПроцедуры

Процедура ПриЗакрытии()
	
	// Сохранение настройки.
	Если СохраненнаяНастройка.СохранятьАвтоматически ИЛИ СохраненнаяНастройка.Пустая() Тогда
		СохранитьНастройку();
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ДЕЙСТВИЙ ПАНЕЛИ

Процедура ДействияФормыВыбратьНастройку(Кнопка)
	
	СохранениеНастроек.ВыбратьНастройкуФормы(СохраненнаяНастройка, ЭтаФорма, "СправочникОбъект.СохраненныеНастройки", Ложь);
	
КонецПроцедуры

Процедура ДействияФормыСохранитьНастройку(Кнопка)
	
	СохранениеНастроек.ВыбратьНастройкуФормы(СохраненнаяНастройка, ЭтаФорма, "СправочникОбъект.СохраненныеНастройки", Истина);
	
КонецПроцедуры

Процедура ДействияФормыОткрытьНастройку(Кнопка)
	
	СохранениеНастроек.ОткрытьНастройкуФормы(ЭлементыФормы.СправочникСписокСохраненныеНастройки.ТекущаяСтрока);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ СПИСКА

Процедура СправочникСписокСохраненныеНастройкиВыбор(Элемент, ВыбраннаяСтрока, Колонка, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если НЕ ЗначениеЗаполнено(ВыбраннаяСтрока) Тогда
		Возврат;
	КонецЕсли;
	
	СохранениеНастроек.ОткрытьНастройкуФормы(ЭлементыФормы.СправочникСписокСохраненныеНастройки.ТекущаяСтрока);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТИРУЕМЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ МОДУЛЯ

// Сохраняет режимы работы формы в настройку.
//
// Параметры:
//  Нет.
//
Процедура СохранитьНастройку() Экспорт
	
	СтруктураНастроек = Новый Структура();
	
	СтруктураНастроек.Вставить("СправочникСписокСохраненныеНастройки_Колонки", СохранениеНастроек.ПолучитьНастройкуКолонокСписка(ЭлементыФормы.СправочникСписокСохраненныеНастройки.Колонки));
	
	Если НЕ СохраненнаяНастройка.Пустая() Тогда
	СтруктураНастроек.Вставить("СправочникСписокСохраненныеНастройки_Отбор",   СохранениеНастроек.ПолучитьНастройкуОтбораСписка (СправочникСписокСохраненныеНастройки.Отбор));
	СтруктураНастроек.Вставить("СправочникСписокСохраненныеНастройки_Порядок", СохранениеНастроек.ПолучитьНастройкуПорядкаСписка(СправочникСписокСохраненныеНастройки.Порядок));
		
		Заголовок = "" + СохраненнаяНастройка.НастраиваемыйОбъект + ", настройка """ + СохраненнаяНастройка + """";
		
		СохранениеНастроек.СохранитьНастройкуОбъекта(СохраненнаяНастройка, СтруктураНастроек);
		
	Иначе
		Заголовок = "Список настроек форм";
		
		СохранитьЗначение("Справочник.СохраненныеНастройки.Форма.СписокНастроекФорм", СтруктураНастроек);
	КонецЕсли;
	
КонецПроцедуры

// Применяет режимы работы формы полученные из настройки.
//
// Параметры:
//  Нет.
//
Процедура ПрименитьНастройку() Экспорт
	
	СтруктураНастроек = СохраненнаяНастройка.ХранилищеНастроек.Получить();
	
	Если СохраненнаяНастройка.Пустая() Тогда
		Заголовок = "Список ""СохраненныеНастройки""";
		
		СтруктураНастроек = ВосстановитьЗначение("Справочник.СохраненныеНастройки.Форма.СписокНастроекФорм");
		
	Иначе
		Заголовок = "" + СохраненнаяНастройка.НастраиваемыйОбъект + ", настройка """ + СохраненнаяНастройка + """";
		
		СтруктураНастроек = СохраненнаяНастройка.ХранилищеНастроек.Получить();
		
		СохранениеНастроек.ПрименитьНастройкуОтбораСписка (СтруктураНастроек, "СправочникСписокСохраненныеНастройки_Отбор",   СправочникСписокСохраненныеНастройки.Отбор);
		СохранениеНастроек.ПрименитьНастройкуПорядкаСписка(СтруктураНастроек, "СправочникСписокСохраненныеНастройки_Порядок", СправочникСписокСохраненныеНастройки.Порядок, ЭлементыФормы.СправочникСписокСохраненныеНастройки.НастройкаПорядка);
	КонецЕсли;
	
	СохранениеНастроек.ПрименитьНастройкуКолонокСписка(СтруктураНастроек, "СправочникСписокСохраненныеНастройки_Колонки", ЭлементыФормы.СправочникСписокСохраненныеНастройки.Колонки);
	
КонецПроцедуры


Процедура СправочникСписокСохраненныеНастройкиНастраиваемыйОбъектПриИзменении(Элемент)
	
	УстановитьТолькоПросмотрФлажкуСохранять(ЭлементыФормы.СправочникСписокСохраненныеНастройки.ТекущиеДанные);
	ЭлементыФормы.СправочникСписокСохраненныеНастройки.ТекущиеДанные.СохранятьАвтоматически = Ложь;
	
КонецПроцедуры
 
Процедура СправочникСписокСохраненныеНастройкиПриАктивизацииСтроки(Элемент)
	
	УстановитьТолькоПросмотрФлажкуСохранять(Элемент.ТекущиеДанные);
	
КонецПроцедуры

Процедура УстановитьТолькоПросмотрФлажкуСохранять(ТекущиеДанные)
	
	//ЭлементыФормы.СправочникСписокСохраненныеНастройки.Колонки.СохранятьАвтоматически.ТолькоПросмотр = ТекущиеДанные = Неопределено или Не (ТипЗнч(ТекущиеДанные.НастраиваемыйОбъект) = Тип("ПеречислениеСсылка.НастраиваемыеФормы") или ТипЗнч(ТекущиеДанные.НастраиваемыйОбъект) = Тип("СправочникСсылка.НастраиваемыеОтчеты"));
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// РАЗДЕЛ ОСНОВНОЙ ПРОГРАММЫ
