Процедура ОбновитьСписокАктивныхСоединений()
	
	АктивныеСоединения.Очистить();
	
	МассивСоединений = ПолучитьСоединенияИнформационнойБазы();
	
	Для Каждого Соединение Из МассивСоединений Цикл
		
		// Текущее соединение не выводится в список.
		Если Соединение.НомерСоединения = НомерСоединенияИнформационнойБазы() Тогда 
			Продолжить;
		КонецЕсли;
		
		ИмяПриложения = Соединение.ИмяПриложения;
		Если ИмяПриложения = "1CV8" Тогда
			ИмяПриложения = НСтр("ru='1С:Предприятие';uk='1С:Підприємство'");
		ИначеЕсли ЭтоСоединениеКонфигуратором(Соединение) Тогда
			ИмяПриложения = НСтр("ru='Конфигуратор';uk='Конфігуратор'");
		ИначеЕсли ЭтоCOMСоединение(Соединение) Тогда
			ИмяПриложения = НСтр("ru='Внешнее соединение';uk=""Зовнішнє з'єднання""");
		КонецЕсли;
			
		НоваяСтрока = АктивныеСоединения.Добавить();
		НоваяСтрока.Пользователь  = ?(Соединение.Пользователь = Неопределено, НСтр("ru='<Не авторизован>';uk='<Не авторизований>'"), Соединение.Пользователь.Имя);
		НоваяСтрока.ИмяКомпьютера = Соединение.ИмяКомпьютера;
		НоваяСтрока.ИмяПриложения = ИмяПриложения;
		
	КонецЦикла;
	
КонецПроцедуры


Процедура КнопкаОКНажатие(Кнопка)
	
	Закрыть();
	
КонецПроцедуры // КнопкаОКНажатие()


Процедура ПриОткрытии()
	
	ОбновитьСписокАктивныхСоединений();
	
	ПодключитьОбработчикОжидания("ОжиданиеЗакрытияСоединений", 3);
	
КонецПроцедуры


Процедура ОжиданиеЗакрытияСоединений()
	
	ОбновитьСписокАктивныхСоединений();
	
КонецПроцедуры 
