
Процедура ПриОткрытии()
	
	Если ЭтоНовый() Тогда
		ВидОтпускаДляФормОтчетности = "додаткова";
		СостояниеСотрудника = Перечисления.СостоянияРаботникаОрганизации.ОтпускЕжегодный;
		ОтпускНеПереноситсяНаСледующийГод = Истина;
	    ОтпускНеКомпенсируется = Истина;
		УчетПоКалендарнымГодам = Истина;
		ВключатьПраздники = Истина;
		НеВключатьВРезервОтпусков = Истина;
	КонецЕсли;	
	
	ЭлементыФормы.УчетПоКалендарнымГодам.Доступность = ВедетсяУчетОстатков;
	ЭлементыФормы.ОтпускНеПереноситсяНаСледующийГод.Доступность = ВедетсяУчетОстатков;
	ЭлементыФормы.КомпенсироватьПриУвольнении.Доступность = ВедетсяУчетОстатков;
	ЭлементыФормы.НеВключатьВРезервОтпусков.Доступность = ВедетсяУчетОстатков;
	
	МеханизмНумерацииОбъектов.ДобавитьВМенюДействияКнопкуРедактированияКода(ЭлементыФормы.ДействияФормы.Кнопки.Подменю);
	МеханизмНумерацииОбъектов.УстановитьДоступностьПоляВводаНомера(Метаданные(), ЭтаФорма, ЭлементыФормы.ДействияФормы.Кнопки.Подменю,ЭлементыФормы.Код);

КонецПроцедуры

Процедура ПослеЗаписи()
	
	МеханизмНумерацииОбъектов.ОбновитьПодсказкуКодНомерОбъекта(ЭтотОбъект.Метаданные(), ЭлементыФормы.ДействияФормы.Кнопки.Подменю, ЭлементыФормы.Код);

КонецПроцедуры // ПослеЗаписи()

Процедура ДействияФормыРедактироватьКод(Кнопка)
	
	МеханизмНумерацииОбъектов.ИзменениеВозможностиРедактированияНомера(ЭтотОбъект.Метаданные(), ЭтаФорма, ЭлементыФормы.ДействияФормы.Кнопки.Подменю, ЭлементыФормы.Код);
	
КонецПроцедуры // ДействияФормыРедактироватьКод()

Процедура ВидОтпускаДляФормОтчетностиНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	
	СписокВыбора = Новый СписокЗначений;

	СписокВыбора.Добавить("щорічна основна");
    СписокВыбора.Добавить("додаткова");
	СписокВыбора.Добавить("навчальна");
	СписокВыбора.Добавить("без збереження заробітної плати");
	
	ЭлементыФормы.ВидОтпускаДляФормОтчетности.СписокВыбора = СписокВыбора;
	
КонецПроцедуры

Процедура ВедетсяУчетОстатковПриИзменении(Элемент)
	
	Если НЕ ВедетсяУчетОстатков Тогда
		ОтпускНеПереноситсяНаСледующийГод = Истина;
	    ОтпускНеКомпенсируется = Истина;
		УчетПоКалендарнымГодам = Истина;
		ВключатьПраздники = Истина;
		НеВключатьВРезервОтпусков = Истина;
	Конецесли;
	
	ЭлементыФормы.УчетПоКалендарнымГодам.Доступность = ВедетсяУчетОстатков;
	ЭлементыФормы.ОтпускНеПереноситсяНаСледующийГод.Доступность = ВедетсяУчетОстатков;
	ЭлементыФормы.КомпенсироватьПриУвольнении.Доступность = ВедетсяУчетОстатков;
	ЭлементыФормы.НеВключатьВРезервОтпусков.Доступность = ВедетсяУчетОстатков;
	
КонецПроцедуры

Процедура СостояниеСотрудникаНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	
	ЭлементыФормы.СостояниеСотрудника.СписокВыбора = ПолучитьСписокОтпусковОрганизации();	
	
КонецПроцедуры

Процедура СостояниеСотрудникаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Элемент.Значение = ВыбранноеЗначение;
	
КонецПроцедуры

Процедура ВидОтпускаДляФормОтчетностиОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Элемент.Значение = ВыбранноеЗначение;
	
КонецПроцедуры
