// Процедура - обработчик события "Начало выбора" с фильтром по балансовым 
// счетам
//
Процедура СчетаНачалоВыбораБалансовые(Элемент, СтандартнаяОбработка)

	РаботаСДиалогами.ВыборСчета(Элемент, СтандартнаяОбработка, Ложь);

КонецПроцедуры

// Процедура - обработчик события "ОбработкаВыбора" полей счетов
//
Процедура СчетУчетаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)

	СтандартнаяОбработка = БухгалтерскийУчет.СчетМожноИспользоватьВПроводках(ВыбранноеЗначение);

КонецПроцедуры

// Процедура управляет доступностью ЭУ в форме
//
// Параметры
//  нет
//
Процедура УправлениеДиалогом()
	
	Если ВидЗатрат = Перечисления.ВидыЗатрат.Материальные 
	   И ХарактерЗатрат = Перечисления.ХарактерЗатрат.ПроизводственныеРасходы Тогда
	Иначе
	КонецЕсли;
	
КонецПроцедуры // УправлениеДиалогом()

// Процедура обработчик события "ПриИзменении" реквизита "ВидЗатрат".
// 
Процедура ВидЗатратПриИзменении(Элемент)
	
	УправлениеДиалогом();
	
КонецПроцедуры // ВидЗатратПриИзменении()

// Процедура обработчик события "ПриИзменении" реквизита "ХарактерЗатрат".
// 
Процедура ХарактерЗатратПриИзменении(Элемент)
	
	УправлениеДиалогом();
	
КонецПроцедуры // ХарактерЗатратПриИзменении()

// Процедура обработчик события "ПриИзмененииДанных" формы
// 
Процедура ПриИзмененииДанных()
	
	УправлениеДиалогом();
	
КонецПроцедуры

Процедура ПриОткрытии()
	
	МеханизмНумерацииОбъектов.УстановитьДоступностьПоляВводаНомера(Метаданные(), ЭтаФорма, ЭлементыФормы.ДействияФормы.Кнопки.Подменю, ЭлементыФормы.Код);
	
КонецПроцедуры

Процедура ДействияФормыРедактироватьКод(Кнопка)
	МеханизмНумерацииОбъектов.ИзменениеВозможностиРедактированияНомера(Метаданные(), ЭтаФорма, ЭлементыФормы.ДействияФормы.Кнопки.Подменю, ЭлементыФормы.Код);
КонецПроцедуры

Процедура СтатьяДекларацииПоНалогуНаПрибыльНачалоВыбора(Элемент, СтандартнаяОбработка)
		
	НазваниеНалоговойДекларации 	= Перечисления.ВидыНалоговыхДеклараций.ДекларацияПоНалогуНаПрибыльНКУ;
	
	РаботаСДиалогами.НачалоВыбораСтатьяНалоговойДекларации(Элемент, СтандартнаяОбработка, НазваниеНалоговойДекларации);

КонецПроцедуры

Процедура СтатьяДекларацииПоНалогуНаПрибыльАвтоПодборТекста(Элемент, Текст, ТекстАвтоПодбора, СтандартнаяОбработка)
	
	НазваниеНалоговойДекларации 	= Перечисления.ВидыНалоговыхДеклараций.ДекларацияПоНалогуНаПрибыльНКУ;      

	РаботаСДиалогами.АвтоПодборТекстаСтатьяНалоговойДекларации(ЭтаФорма, Элемент, Текст, ТекстАвтоПодбора ,СтандартнаяОбработка, 
											  НазваниеНалоговойДекларации);

КонецПроцедуры

Процедура СтатьяДекларацииПоНалогуНаПрибыльОкончаниеВводаТекста(Элемент, Текст, Значение, СтандартнаяОбработка)
	
	НазваниеНалоговойДекларации 	= Перечисления.ВидыНалоговыхДеклараций.ДекларацияПоНалогуНаПрибыльНКУ;      
	
	РаботаСДиалогами.ОкончаниеВводаТекстаСтатьяНалоговойДекларации(Элемент, Текст, Значение, СтандартнаяОбработка, 
												  НазваниеНалоговойДекларации);
												  
КонецПроцедуры


