////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ МОДУЛЯ

// поле табличного документа
//каждая закладка отчета - это объект ПолеТабличногоДокумента
Перем мПереченьТаблиц;
Перем мТаблица1;
Перем мТаблица5;
Перем мТаблица6;
Перем мТаблица7;
Перем мТаблица8;
Перем мСлужебныеДанные;

// хранит дерево значений - список
// выводимых на печать страниц
Перем мДеревоВыбранныхСтраниц;

Перем мСоставПоказателей Экспорт;

//хранит нужные статьи налоговых деклараций
Перем МассивНужныхСтатей;

// переменный для хранения бухгалтерских итогов
Перем мБухИтоги, мБухИтогиРС, мБухИтогиКорРС;

// хранит форматную строку представления
// денежных показателей отчета
Перем мСтрокаФормата;

Перем мИдГруппы1А;
Перем мИдГруппы1Б;
Перем мИдГруппы5;
Перем мИдГруппы6;
Перем мИдГруппы7;
Перем мИдГруппы8;

// хранят структуру многострочных разделов
Перем мСтруктураМногострочныхРазделов Экспорт;
Перем мСтруктураИсхКолвоСтрокРазделов;

Перем  КолИсхСтрокИдГруппы1А, КолИсхСтрокИдГруппы1Б;
Перем  КолИсхСтрокИдГруппы5, КолИсхСтрокИдГруппы6, КолИсхСтрокИдГруппы7, КолИсхСтрокИдГруппы8; 

// хранит коллекцию цветов раскраски автоматически
// заполняемых ячеек табличного документа
Перем мСтруктураЦветовРаскраски;

// хранит значение делителя при представлении
// чисел в назначенной размерности
Перем мДелитель;

// хранит версию формы отчета
Перем мВерсияФормы;

Перем БольничныеПредприятие,БольничныеФСС;

Перем ОписаниеТиповЧисло;

Перем СтрокиДекларации;

Перем Счет65_1,Счет66,Счет66_1,Счет66_2,Счет66_3,Счет65_2,Счет65_6,Счет81_5,Счет91,Счет92,Счет93,Счет301;

Перем мПечатныеФормы Экспорт;
Перем ЕстьДуплекс;

Перем ВерсияВыгрузкиPFZ;


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

// Выполняет начальные настройки параметров отчета.
// По данным макета "СоствПоказателей" формирует:
//   - состав показателей отчета;
//   - варианты заполнения показателей отчета;
//   - дерево выводимых на печать листов отчета.
//
Процедура ЗаполнитьНачальныеНастройки() Экспорт

	МакетСоставаПоказателей = ЭтотОбъект.ПолучитьМакет("СоставПоказателей2010Янв");

	ОписаниеТиповСтрока15  = ОбщегоНазначения.ПолучитьОписаниеТиповСтроки(15);

	ОписаниеТиповСтрока100 = ОбщегоНазначения.ПолучитьОписаниеТиповСтроки(100);

	ОписаниеТиповЧисло1    = ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(1);

	ОписаниеТиповЧисло15   = ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15,2);

	Для Инд = 0 По МакетСоставаПоказателей.Области.Количество() - 1 Цикл

		ТекОбласть    = МакетСоставаПоказателей.Области[Инд];
		ИмяСтраницы   = ТекОбласть.Имя;

		// Таблица значений содержит информацию о вариантах заполнения показателя отчета.
		// В колонках таблицы значений отображается следуящая информация:
		//   - имя ячейки (код показателя);
		//   - вариант заполнения ячейки;
		//   - вычисленное по данным ИБ значение ячейки;
		//   - величина автокорректировки значения ячейки;
		//   - примечание к ячейке.
		//
		ТаблицаВариантыЗаполнения = Новый ТаблицаЗначений;
		ТаблицаВариантыЗаполнения.Колонки.Добавить( "КодПоказателя",     ОписаниеТиповСтрока100 );
		ТаблицаВариантыЗаполнения.Колонки.Добавить( "ВариантЗаполнения", ОписаниеТиповЧисло1    );
		ТаблицаВариантыЗаполнения.Колонки.Добавить( "ЗначениеАвто",      ОписаниеТиповЧисло15   );
		ТаблицаВариантыЗаполнения.Колонки.Добавить( "Дельта",            ОписаниеТиповЧисло15   );
		ТаблицаВариантыЗаполнения.Колонки.Добавить( "Комментарий",       ОписаниеТиповСтрока100 );

		Для Ном = ТекОбласть.Верх По ТекОбласть.Низ Цикл
			// перебираем строки макета

			// Код показателя (по составу показателей) определяется по первой колонке макета
			КодПоказателя = СокрП(МакетСоставаПоказателей.Область(Ном, 1).Текст);
			ИмяПоказателя = КодПоказателя;

			Если КодПоказателя = "===" Тогда         // признак конечной строки
				Прервать;
			КонецЕсли;

			Если Лев(КодПоказателя, 2) = "//" Тогда  // пропускаем комментарии
				Продолжить;
			КонецЕсли;

			// код показателя по форме отчете (имя ячейки в полях табличного документа формы)
			КодПоказателяПоФорме = СокрЛП(МакетСоставаПоказателей.Область(Ном, 2).Текст);
			// признак многострочности определяется по третьей колонке макета
			ПризнМногострочность = СокрЛП(МакетСоставаПоказателей.Область(Ном, 3).Текст);
			// по четвертой колонке определяется тип данных реквизита
			ТипДанныхРеквизита   = СокрЛП(МакетСоставаПоказателей.Область(Ном, 4).Текст);
			// по колонке 5 определяется исходное количество строк многострочного раздела
			стрКолСтрокИсходный  = СокрЛП(МакетСоставаПоказателей.Область(Ном, 5).Текст);
			// вариант заполнения ячейки определяется по колонке 6 макета
			стрВариантЗаполнения = СокрЛП(МакетСоставаПоказателей.Область(Ном, 6).Текст);

			чКолСтрокИсходный    = ? (ПустаяСтрока(стрКолСтрокИсходный),  0, Число(стрКолСтрокИсходный));
			чВариантЗаполнения   = ? (ПустаяСтрока(стрВариантЗаполнения), 0, Число(стрВариантЗаполнения));

			// формируем таблицу значений, содержащей состав показателей отчета
			НоваяСтрока = мТаблицаСоставПоказателей.Добавить();
			НоваяСтрока.ИмяПоляТаблДокумента   = ИмяСтраницы;
			НоваяСтрока.КодПоказателяПоСоставу = КодПоказателя;
			НоваяСтрока.КодПоказателяПоФорме   = КодПоказателяПоФорме;
			НоваяСтрока.ПризнМногострочности   = ПризнМногострочность;
			НоваяСтрока.ТипДанныхПоказателя    = ТипДанныхРеквизита;

			Если чВариантЗаполнения <> 0 Тогда
				// Если в колонке 6 задан варианет заполнения показателя, 
				// то его значение может определяться по данным ИБ.
				// Дополняем таблицу значений вариантов заполнения
				НоваяСтрока = ТаблицаВариантыЗаполнения.Добавить();
				НоваяСтрока.КодПоказателя      = ? (Не ПустаяСтрока(КодПоказателяПоФорме), КодПоказателяПоФорме, КодПоказателя);
				НоваяСтрока.ВариантЗаполнения  = чВариантЗаполнения;
			КонецЕсли;

		КонецЦикла;

		Если ТаблицаВариантыЗаполнения.Количество() > 0 Тогда
			// имеются автоматически заполняемые ячейки

			// Для обеспечения возможности назначения разных вариантов заполнения одного и того же показателя
			// на разных страницах, создаем массив, хранящий информацию о вариантах заполнения ячеек по каждой
			// странице многостраничного раздела.
			МассивВариантовЗаполненияСтраниц = Новый Массив;
			МассивВариантовЗаполненияСтраниц.Добавить(ТаблицаВариантыЗаполнения);

			// Создаем структуру, содержащей варианты заполнения показателей отчета.
			//
			// В качестве ключа используется имя страницы основной панели формы, содержащей
			//   табличный документ с автоматически заполняемыми показателями.
			// В качестве значения принимаем Массив из таблицы значений - вариантов заполнения
			//   показателей по каждой странице многостраничного раздела.
			//
			мСтруктураВариантыЗаполнения.Вставить(ИмяСтраницы, МассивВариантовЗаполненияСтраниц);
		Конецесли;

	КонецЦикла;

	ФормироватьСтруктуруСтраницОтчета();
	
	УстановитьСистемуюОбластьПечатиОтчета();

КонецПроцедуры // ЗаполнитьНачальныеНастройки()

// Формирует дерево значений - структуру страниц отчета,
// содержащей настройки показа страниц, вывода на печать и выгрузки в ИМНС.
//  требуется редакция по наименованиям ПолейТабличныхДокументов
Процедура ФормироватьСтруктуруСтраницОтчета() Экспорт

	МассивТипов = Новый Массив; 
	МассивТипов.Добавить(Тип("Строка"));
	ОписаниеТиповСтрока100 = Новый ОписаниеТипов(МассивТипов, , Новый КвалификаторыСтроки(100, ДопустимаяДлина.Переменная));

	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("Число"));
	ОписаниеТиповЧисло1    = Новый ОписаниеТипов(МассивТипов, Новый КвалификаторыЧисла(1));

	// Дерево содержит коллекцию страниц отчета.
	// В колонках дерева хранятся следующие данные:
	//    - представление листа;
	//    - имя страницы основной панели формы, содержащей выводимый на печать лист;
	//    - имя поля табличного документа;
	//    - имя области ячеек табличного документа (используется в случае вывода
	//      на печать отдельных страниц титульного листа);
	//    - ориентация страницы при печати;
	//    - число, метка вывода страницы на печать;
	//    - число, метка показа страницы на основной панели формы;
	//    - число, метка выгрузки данных страницы в ИМНС.
	//
	мДеревоСтраницОтчета               = Новый ДеревоЗначений;
	мДеревоСтраницОтчета.Колонки.Добавить("Представление",            ОписаниеТиповСтрока100);
	мДеревоСтраницОтчета.Колонки.Добавить("ИмяСтраницы",              ОписаниеТиповСтрока100);
	мДеревоСтраницОтчета.Колонки.Добавить("ИмяПоляТабличногоДокум",   ОписаниеТиповСтрока100);
	мДеревоСтраницОтчета.Колонки.Добавить("ИмяОбластиТабличногоПоля", ОписаниеТиповСтрока100);
	мДеревоСтраницОтчета.Колонки.Добавить("ОриентацияСтраницы");
	мДеревоСтраницОтчета.Колонки.Добавить("ВыводНаПечать",            ОписаниеТиповЧисло1);
	мДеревоСтраницОтчета.Колонки.Добавить("ПоказатьСтраницу",         ОписаниеТиповЧисло1);
	мДеревоСтраницОтчета.Колонки.Добавить("ВыгрузитьСтраницу",        ОписаниеТиповЧисло1);

	мДеревоСтраницОтчета.Строки.Очистить();

	СтрокаУровня1 = мДеревоСтраницОтчета.Строки.Добавить();
	СтрокаУровня1.ИмяСтраницы              = "ПереченьТаблиц";
	СтрокаУровня1.Представление            = НСтр("ru='Перечень таблиц отчета';uk='Перелік таблиць звіту'");
	СтрокаУровня1.ИмяПоляТабличногоДокум   = "ПолеТабличногоДокументаПереченьТаблиц";
	СтрокаУровня1.ИмяОбластиТабличногоПоля = "ОбластьПечатиПоВысоте|ОбластьПечатиПоШирине";
	СтрокаУровня1.ОриентацияСтраницы       = ОриентацияСтраницы.Портрет;
	СтрокаУровня1.ВыводНаПечать            = 1;
	СтрокаУровня1.ПоказатьСтраницу         = 1;
	СтрокаУровня1.ВыгрузитьСтраницу        = 1;
	
	СтрокаУровня1 = мДеревоСтраницОтчета.Строки.Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Таблица1";
	СтрокаУровня1.Представление            = НСтр("ru='Таблица 1';uk='Таблиця 1'");
	СтрокаУровня1.ИмяПоляТабличногоДокум   = "ПолеТабличногоДокументаТаблица1";
	СтрокаУровня1.ИмяОбластиТабличногоПоля = "ОбластьПечати";
	СтрокаУровня1.ОриентацияСтраницы       = ОриентацияСтраницы.Портрет;
	СтрокаУровня1.ВыводНаПечать            = 1;
	СтрокаУровня1.ПоказатьСтраницу         = 1;
	СтрокаУровня1.ВыгрузитьСтраницу        = 1;
	
	СтрокаУровня1 = мДеревоСтраницОтчета.Строки.Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Таблица5";
	СтрокаУровня1.Представление            = НСтр("ru='Таблица 5';uk='Додаток 5'");
	СтрокаУровня1.ИмяПоляТабличногоДокум   = "ПолеТабличногоДокументаТаблица5";
	СтрокаУровня1.ИмяОбластиТабличногоПоля = "ОбластьПечатиПоВысоте";
	СтрокаУровня1.ОриентацияСтраницы       = ОриентацияСтраницы.Ландшафт;
	СтрокаУровня1.ВыводНаПечать            = 1;
	СтрокаУровня1.ПоказатьСтраницу         = 1;
	СтрокаУровня1.ВыгрузитьСтраницу        = 1;
 
	СтрокаУровня1 = мДеревоСтраницОтчета.Строки.Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Таблица6";
	СтрокаУровня1.Представление            = НСтр("ru='Таблица 6';uk='Таблиця 6'");
	СтрокаУровня1.ИмяПоляТабличногоДокум   = "ПолеТабличногоДокументаТаблица6";
	СтрокаУровня1.ИмяОбластиТабличногоПоля = "ОбластьПечати";
	СтрокаУровня1.ОриентацияСтраницы       = ОриентацияСтраницы.Портрет;
	СтрокаУровня1.ВыводНаПечать            = 1;
	СтрокаУровня1.ПоказатьСтраницу         = 1;
	СтрокаУровня1.ВыгрузитьСтраницу        = 1;
	
	СтрокаУровня1 = мДеревоСтраницОтчета.Строки.Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Таблица7";
	СтрокаУровня1.Представление            = НСтр("ru='Таблица 7';uk='Таблиця 7'");
	СтрокаУровня1.ИмяПоляТабличногоДокум   = "ПолеТабличногоДокументаТаблица7";
	СтрокаУровня1.ИмяОбластиТабличногоПоля = "ОбластьПечати";
	СтрокаУровня1.ОриентацияСтраницы       = ОриентацияСтраницы.Портрет;
	СтрокаУровня1.ВыводНаПечать            = 1;
	СтрокаУровня1.ПоказатьСтраницу         = 1;
	СтрокаУровня1.ВыгрузитьСтраницу        = 1;
	
	СтрокаУровня1 = мДеревоСтраницОтчета.Строки.Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Таблица8";
	СтрокаУровня1.Представление            = НСтр("ru='Таблица 8';uk='Таблиця 8'");
	СтрокаУровня1.ИмяПоляТабличногоДокум   = "ПолеТабличногоДокументаТаблица8";
	СтрокаУровня1.ИмяОбластиТабличногоПоля = "ОбластьПечати";
	СтрокаУровня1.ОриентацияСтраницы       = ОриентацияСтраницы.Портрет;
	СтрокаУровня1.ВыводНаПечать            = 1;
	СтрокаУровня1.ПоказатьСтраницу         = 1;
	СтрокаУровня1.ВыгрузитьСтраницу        = 1;
	
КонецПроцедуры // ФормироватьСтруктуруСтраницОтчета()

// Функция вычисляет начальный остаток по дебету счета, указанного в качестве 
// параметра функции. Бухгалтерские итоги должны быть предварительно рассчитаны
// процедурой РассчитатьИтоги() обработки БухгалтерскиеИтоги.
//
// Параметры:
//  Счет         - значение типа ПланСчетов - счет, для которого требуется
//                 получить итог.
//
// Возвращаемое значение:
//  Число        - начальный остаток по дебету счета, указанного в параметре.
//
Функция СНД(Счет)

	Перем Итог;

	Итог = мБухИтоги.ПолучитьИтог("СуммаНачальныйОстатокДт", "Счет", Счет);

	Возврат Итог;

КонецФункции // СНД()

// Функция вычисляет начальный остаток по дебету счета, указанного в качестве 
// параметра функции. Бухгалтерские итоги должны быть предварительно рассчитаны
// процедурой РассчитатьИтоги() обработки БухгалтерскиеИтоги.
//
// Параметры:
//  Счет         - значение типа ПланСчетов - счет, для которого требуется
//                 получить итог.
//
// Возвращаемое значение:
//  Число        - конечный остаток по дебету счета, указанного в параметре.
//
Функция СКД(Счет)

	Перем Итог;

	Итог = мБухИтоги.ПолучитьИтог("СуммаКонечныйОстатокДт", "Счет", Счет);

	Возврат Итог;

КонецФункции // СНД()


// Функция вычисляет начальный остаток по кредиту счета, указанного в качестве 
// параметра функции. Бухгалтерские итоги должны быть предварительно рассчитаны
// процедурой РассчитатьИтоги() обработки БухгалтерскиеИтоги.
//
// Параметры:
//  Счет         - значение типа ПланСчетов - счет, для которого требуется
//                 получить итог.
//
// Возвращаемое значение:
//  Число        - начальный остаток по кредиту счета, указанного в параметре.
//
Функция СНК(Счет)

	Перем Итог;

	Возврат мБухИтоги.ПолучитьИтог("СуммаНачальныйОстатокКт", "Счет", Счет);

	Возврат Итог;

КонецФункции // СНК()

// Функция вычисляет начальный остаток по кредиту счета, указанного в качестве 
// параметра функции. Бухгалтерские итоги должны быть предварительно рассчитаны
// процедурой РассчитатьИтоги() обработки БухгалтерскиеИтоги.
//
// Параметры:
//  Счет         - значение типа ПланСчетов - счет, для которого требуется
//                 получить итог.
//
// Возвращаемое значение:
//  Число        - начальный остаток по кредиту счета, указанного в параметре.
//
Функция СКК(Счет)

	Перем Итог;

	Возврат мБухИтоги.ПолучитьИтог("СуммаКонечныйОстатокКт", "Счет", Счет);

	Возврат Итог;

КонецФункции // СКК()

//// Функция вычисляет кредитовый оборот счета, указанного в качестве параметра 
//Функция КО(Счет)
//                                         
//	Перем Итог;
//
//	Итог = мБухИтоги.ПолучитьИтог("СуммаОборотКт", "Счет", Счет);
//
//	Возврат Итог;
//
//КонецФункции // КО()

//// Функция вычисляет перекрестный оборот в дебет счета, указанного в качестве 
//// первого параметра функции, с кредита счета, указанного в качестве второго 
//// параметра. Бухгалтерские итоги должны быть предварительно рассчитаны
//// процедурой РассчитатьИтоги() обработки БухгалтерскиеИтоги.
////
//// Параметры:
////  СчетД        - значение типа ПланСчетов - счет, для будет вычисляться 
////                 оборот в дебет счета;
////  СчетК        - значение типа ПланСчетов - счет, для будет вычисляться 
////                 оборот с кредита счета.
////
//// Возвращаемое значение:
////  Число        - сумма перекрестного оборота.
////
//Функция ОБ(СчетД, СчетК)
//
//	Перем Итог;
//
//	Итог = мБухИтоги.ПолучитьИтог("СуммаКорОборотДт", "Счет, КорСчет", СчетД, СчетК);
//
//	Возврат Итог;
//
//КонецФункции // ОБ()

// Функция округляет число согласно установленной размерности чисел.
//
// Параметры:
//  ИсходноеЧисло - заданное число;
//
// Возвращаемое значение:
//  число, округленное с заданной точностью с учетом установленной единицы измерения.
//
Функция ОкруглитьЧислоПоФормату(ИсходноеЧисло)

	ОкругленноеЧисло = Окр(ИсходноеЧисло / мДелитель, ТочностьЕдиницыИзмерения) * мДелитель; 

	Возврат ОкругленноеЧисло;

КонецФункции // ОкруглитьЧислоПоФормату()

// Функция собирает значения редактирукемых ячеек табличного документа
// в коллекцию значений типа "структура".
//
// Параметры:
//  ТабличноеПоле - поле табличного документа текущей формы.
//
// Возвращаемое значение:
//  Структура.
//
Функция СобратьДанныеТекущегоТаблПоля(ТабличноеПоле)

	СтруктураПоказателейВнутрСвязи = Новый Структура;

	СтруктураДанныхПоля = Новый Структура;

	Для Инд = 0 По ТабличноеПоле.Области.Количество() - 1 Цикл
		ТекущаяОбласть = ТабличноеПоле.Области[Инд];

		Если Не ТекущаяОбласть.ТипОбласти = ТипОбластиЯчеекТабличногоДокумента.Прямоугольник Тогда
			Продолжить;
		КонецЕсли;

		Если НЕ(ТекущаяОбласть.СодержитЗначение) Тогда
			Продолжить;
		КонецЕсли;

		//Если ТекущаяОбласть.Защита Тогда
		//	Если Не СтруктураПоказателейВнутрСвязи.Свойство(ТекущаяОбласть.Имя) Тогда
		//		Продолжить;
		//	КонецЕсли;
		//КонецЕсли;

		ИмяПоказателя      = ТекущаяОбласть.Имя;
		ЗначениеПоказателя = ТекущаяОбласть.Значение;

		СтруктураДанныхПоля.Вставить(ИмяПоказателя, ЗначениеПоказателя);

	КонецЦикла;

	Возврат СтруктураДанныхПоля;

КонецФункции // СобратьДанныеТекущегоТаблПоля()

// Функция определяет варианты заполнения ячеек табличного документа
// по имени страницы основной панели формы.
//
// Параметры:
//   ИмяСтраницыПанели - строка, имя страницы основной панели формы.
//   ПолучитьЭталонную - булево, если истина, получаем эталонную
//                               (исходную) таблицу вариантов заполнения.
//
// Возвращаемое значение:
//   таблица значений, содержащая информацию о вариантах автозаполнения ячеек.
//
Функция ПолучитьТаблицуВариантовЗаполнения(ИмяСтраницыПанели, ПолучитьЭталонную = Ложь)
	Перем МассивВариантовЗаполненияСтраниц;
	Перем ТаблицаВариантыЗаполнения;
	Перем ТаблицаСтраницРаздела;

	Если мСтруктураВариантыЗаполнения.Свойство(ИмяСтраницыПанели, МассивВариантовЗаполненияСтраниц) Тогда

		Если НЕ ПолучитьЭталонную Тогда
			// получим варианты заполнения ячеек, заданные для активной страницы
			НомерТекущейСтраницы = 1;

			ТаблицаВариантыЗаполнения = МассивВариантовЗаполненияСтраниц[НомерТекущейСтраницы - 1];
		Иначе
			// Получим предустановленные (эталонные) варианты заполнения ячеек поля табличного
			// документа на заданной странице

			ОписаниеТиповСтрока15  = ОбщегоНазначения.ПолучитьОписаниеТиповСтроки(15);

			ОписаниеТиповСтрока100 = ОбщегоНазначения.ПолучитьОписаниеТиповСтроки(100);

			ОписаниеТиповЧисло1    = ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(1);

			ОписаниеТиповЧисло15   = ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15,2);

			ТаблВариантыЗаполнения = Новый ТаблицаЗначений;
			ТаблВариантыЗаполнения.Колонки.Добавить( "КодПоказателя",     ОписаниеТиповСтрока15  );
			ТаблВариантыЗаполнения.Колонки.Добавить( "ВариантЗаполнения", ОписаниеТиповЧисло1    );
			ТаблВариантыЗаполнения.Колонки.Добавить( "ЗначениеАвто",      ОписаниеТиповЧисло15   );
			ТаблВариантыЗаполнения.Колонки.Добавить( "Дельта",            ОписаниеТиповЧисло15   );
			ТаблВариантыЗаполнения.Колонки.Добавить( "Комментарий",       ОписаниеТиповСтрока100 );

			// варианты заполнения определяем по макету СоставПоказателей
			МакетСоставаПоказателей = ЭтотОбъект.ПолучитьМакет("СоставПоказателей2010Янв");

			ТекОбласть = МакетСоставаПоказателей.Области.Найти(ИмяСтраницыПанели);
			Если ТекОбласть <> Неопределено Тогда
			
				Для Ном = ТекОбласть.Верх По ТекОбласть.Низ Цикл
					// Перебираем строки макета.
					// Код показателя (по составу показателей) определяется по первой колонке макета
					КодПоказателя = СокрП(МакетСоставаПоказателей.Область(Ном, 1).Текст);
					ИмяПоказателя = КодПоказателя;

					Если КодПоказателя = "===" Тогда         // признак конечной строки
						Прервать;
					КонецЕсли;

					Если Лев(КодПоказателя, 2) = "//" Тогда  // пропускаем комментарии
						Продолжить;
					КонецЕсли;

					// код показателя по форме отчете (имя ячейки в полях табличного документа формы)
					КодПоказателяПоФорме = СокрЛП(МакетСоставаПоказателей.Область(Ном, 2).Текст);
					// вариант заполнения ячейки определяется по колонке 6 макета
					стрВариантЗаполнения = СокрЛП(МакетСоставаПоказателей.Область(Ном, 6).Текст);

					чВариантЗаполнения   = ? (ПустаяСтрока(стрВариантЗаполнения), 0, Число(стрВариантЗаполнения));
					Если чВариантЗаполнения <> 0 Тогда
						// Если в колонке 6 задан варианет заполнения показателя, 
						// то его значение может определяться по данным ИБ.
						// Дополняем таблицу значений вариантов заполнения
						НоваяСтрока = ТаблВариантыЗаполнения.Добавить();
						НоваяСтрока.КодПоказателя      = ? (Не ПустаяСтрока(КодПоказателяПоФорме), КодПоказателяПоФорме, КодПоказателя);
						НоваяСтрока.ВариантЗаполнения  = чВариантЗаполнения;
					КонецЕсли;
				КонецЦикла;
			
			КонецЕсли;

			Если ТаблВариантыЗаполнения.Количество() > 0 Тогда
				ТаблицаВариантыЗаполнения = ТаблВариантыЗаполнения.Скопировать();
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

	Возврат ТаблицаВариантыЗаполнения;

КонецФункции // ПолучитьТаблицуВариантовЗаполнения()

// Обновляет пользовательские настройки по вариантам заполнения
// показателей отчета в случае изменения версии формы отчета.
//
// Возвращаемое значение:
//   Булево - признак модифицированность пользовательских настроек.
//
Функция ОбновитьВариантыЗаполнения()
	Перем МассивВариантовЗаполненияСтраниц;

	ЕстьИзменения = Ложь;

	// Подлежат обновлению следующие структуры:
	// 1.Пользовательские настройки вариантов заполнения таблиц

	// Сначала создадим эталонные модели вариантов автозаполнения таблиц.
	// Их определяем по макету СоставПоказателей
	МакетСоставаПоказателей = ЭтотОбъект.ПолучитьМакет("СоставПоказателей2010Янв");

	ОписаниеТиповСтрока15  = ОбщегоНазначения.ПолучитьОписаниеТиповСтроки(15);

	ОписаниеТиповСтрока100 = ОбщегоНазначения.ПолучитьОписаниеТиповСтроки(100);

	ОписаниеТиповЧисло1    = ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(1);

	ОписаниеТиповЧисло15   = ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15,2);

	ЕстьИзменения = Ложь;

	Для Инд = 0 По МакетСоставаПоказателей.Области.Количество() - 1 Цикл
		// организован цикл по именованным областям макета,
		// содержащим состав показателей и варианты автозаполнения
		// таблиц на каждой странице основной панели формы.

		ТекОбласть  = МакетСоставаПоказателей.Области[Инд];
		ИмяСтраницы = ТекОбласть.Имя;

		// Таблица значений содержит информацию о вариантах заполнения показателя отчета.
		// В колонках таблицы значений отображается следуящая информация:
		//   - имя ячейки (код показателя);
		//   - вариант заполнения ячейки;
		//   - вычисленное по данным ИБ значение ячейки;
		//   - величина автокорректировки значения ячейки;
		//   - примечание к ячейке.
		//
		ТаблицаВариантыЗаполнения = Новый ТаблицаЗначений;
		ТаблицаВариантыЗаполнения.Колонки.Добавить( "КодПоказателя",     ОписаниеТиповСтрока15  );
		ТаблицаВариантыЗаполнения.Колонки.Добавить( "ВариантЗаполнения", ОписаниеТиповЧисло1    );
		ТаблицаВариантыЗаполнения.Колонки.Добавить( "ЗначениеАвто",      ОписаниеТиповЧисло15   );
		ТаблицаВариантыЗаполнения.Колонки.Добавить( "Дельта",            ОписаниеТиповЧисло15   );
		ТаблицаВариантыЗаполнения.Колонки.Добавить( "Комментарий",       ОписаниеТиповСтрока100 );

		Для Ном = ТекОбласть.Верх По ТекОбласть.Низ Цикл
			// перебираем строки макета

			// Код показателя (по составу показателей) определяется по первой колонке макета
			КодПоказателя = СокрП(МакетСоставаПоказателей.Область(Ном, 1).Текст);
			ИмяПоказателя = КодПоказателя;

			Если КодПоказателя = "===" Тогда         // признак конечной строки
				Прервать;
			КонецЕсли;

			Если Лев(КодПоказателя, 2) = "//" Тогда  // пропускаем комментарии
				Продолжить;
			КонецЕсли;

			// код показателя по форме отчете (имя ячейки в полях табличного документа формы)
			КодПоказателяПоФорме = СокрЛП(МакетСоставаПоказателей.Область(Ном, 2).Текст);
			// вариант заполнения ячейки определяется по колонке 6 макета
			стрВариантЗаполнения = СокрЛП(МакетСоставаПоказателей.Область(Ном, 6).Текст);

			чВариантЗаполнения   = ? (ПустаяСтрока(стрВариантЗаполнения), 0, Число(стрВариантЗаполнения));
			Если чВариантЗаполнения <> 0 Тогда
				// Если в колонке 6 задан варианет заполнения показателя, 
				// то его значение может определяться по данным ИБ.
				// Дополняем таблицу значений вариантов заполнения
				НоваяСтрока = ТаблицаВариантыЗаполнения.Добавить();
				НоваяСтрока.КодПоказателя      = ? (Не ПустаяСтрока(КодПоказателяПоФорме), КодПоказателяПоФорме, КодПоказателя);
				НоваяСтрока.ВариантЗаполнения  = чВариантЗаполнения;
			КонецЕсли;

		КонецЦикла;

		Если Не мСтруктураВариантыЗаполнения.Свойство(ИмяСтраницы, МассивВариантовЗаполненияСтраниц) Тогда
			Если ТаблицаВариантыЗаполнения.Количество() > 0 Тогда
				// Рассмотрим вариант, когда в предыдущей версии формы по данной странице
				// не было предусмотрено автозаполнение по данным ИБ.
				// Добавим такую возможность в пользовательскую настройку

				// Для обеспечения назначения разных вариантов заполнения одного и того же показателя
				// на разных страницах, создаем массив, хранящий информацию о вариантах заполнения
				// таблиц по каждой странице многостраничного раздела.
				МассивВариантовЗаполненияСтраниц = Новый Массив;
				// Первым элементом массива является "эталонная" таблица значений вариантов заполнения
				МассивВариантовЗаполненияСтраниц.Добавить(ТаблицаВариантыЗаполнения);

				// сохраняем варианты заполнения таблиц на данной странице
				мСтруктураВариантыЗаполнения.Вставить(ИмяСтраницы, МассивВариантовЗаполненияСтраниц);

				ЕстьИзменения = Истина;
			КонецЕсли;
		Иначе
			Если ТаблицаВариантыЗаполнения.Количество() = 0 Тогда
				// Рассмотрим вариант, когда в предыдущей версии формы по данной странице
				// было предусмотрено автозаполнение таблицы, а в текущей версии - отключено.
				// Соответственно, из структуры вариантов автозаполнения удаляем элемент,
				// хранящий параметры автозаполнения ячеек текущей станицы.
				мСтруктураВариантыЗаполнения.Удалить(ИмяСтраницы);

				ЕстьИзменения = Истина;
			Иначе
				// Рассмотрим вариант, когда и в предыдущей, и в текущей версии формы было предусмотрено
				// автозаполнение текущей страницы. В данном случае обновляем таблицу значений, содержащей
				// пользовательские настройки параметров автозаполнения текущей страницы.

				Для каждого ЭлементМассива Из МассивВариантовЗаполненияСтраниц Цикл
					Для каждого СтрокаТаблицы Из ТаблицаВариантыЗаполнения Цикл
						КодПоказателя     = СтрокаТаблицы.КодПоказателя;
						ВариантЗаполнения = СтрокаТаблицы.ВариантЗаполнения;

						Если ЭлементМассива.Найти(КодПоказателя, "КодПоказателя") = Неопределено Тогда
							// Рассмотри вариант, когда в новой версии формы список реквизитов,
							// заполняемых автоматически по данным ИБ, дополнен новым реквизитом.
							НоваяСтрока = ЭлементМассива.Добавить();
							НоваяСтрока.КодПоказателя     = КодПоказателя;
							НоваяСтрока.ВариантЗаполнения = ВариантЗаполнения;

							ЕстьИзменения = Истина;
						КонецЕсли;
					КонецЦикла;

					Для каждого СтрокаТаблицы Из ЭлементМассива Цикл
						КодПоказателя = СтрокаТаблицы.КодПоказателя;

						Если ТаблицаВариантыЗаполнения.Найти(КодПоказателя, "КодПоказателя") = Неопределено Тогда
							// Рассмотрим вариант, когда в предыдущей версии формы для данной страницы
							// было предусмотрено автозаполнение ячейки по коду КодПоказателя, а в текущей - отключено.
							// В этом случае удаляем ячейку из таблицы пользовательских настроек вариантов автозаполнения.
							ЭлементМассива.Удалить(СтрокаТаблицы);

							ЕстьИзменения = Истина;
						КонецЕсли;
					КонецЦикла;
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;

	КонецЦикла;

	Возврат ЕстьИзменения;

КонецФункции // ОбновитьВариантыЗаполнения()

// Обновляет пользовательские настройки страниц отчета
// в случае изменения версии формы отчета.
//
// Возвращаемое значение:
//   Булево - признак модифицированность пользовательских настроек.
//
Функция ОбновитьНастройкиСтраниц()

	ЕстьИзменения = Ложь;

	// формируем дерево значений - пользовательских настройки страниц отчета
	мПользовательскиеНастройкиСтраниц = мДеревоСтраницОтчета.Скопировать();

	// формируем дерево значений - настройки страниц отчета обновленной формы
	ФормироватьСтруктуруСтраницОтчета();

	// Сначала проверяем, не изменилась ли структура настроек страниц (колонки дерева)
	Для каждого ИсхКолонка Из мДеревоСтраницОтчета.Колонки Цикл

		Если мПользовательскиеНастройкиСтраниц.Колонки.Найти(ИсхКолонка.Имя) = Неопределено Тогда
			// добавиляем новую колонку
			мПользовательскиеНастройкиСтраниц.Колонки.Добавить(ИсхКолонка.Имя, ИсхКолонка.ТипЗначения, ИсхКолонка.Заголовок, ИсхКолонка.Ширина);
			мПользовательскиеНастройкиСтраниц.ЗагрузитьКолонку(мДеревоСтраницОтчета.ВыгрузитьКолонку(ИсхКолонка.Имя), ИсхКолонка.Имя);

			ЕстьИзменения = Истина;
		КонецЕсли;

	КонецЦикла;

	// Выполняем обратную задачу:
	// удаляем отсутствующие колонки
	Для каждого ТекКолонка Из мПользовательскиеНастройкиСтраниц.Колонки Цикл

		Если мДеревоСтраницОтчета.Колонки.Найти(ТекКолонка.Имя) = Неопределено Тогда
			// удаляем отсутствующую колонку
			мПользовательскиеНастройкиСтраниц.Колонки.Удалить(мПользовательскиеНастройкиСтраниц.Колонки.Индекс(ТекКолонка));

			ЕстьИзменения = Истина;
		КонецЕсли;

	КонецЦикла;

	// Обновляем строки дерева значений - пользовательских настроек:
	//
	// добавляем новые строки и удаляем лишние:
	Если мДеревоСтраницОтчета.Строки.Количество() <> мПользовательскиеНастройкиСтраниц.Строки.Количество() Тогда

		КолвоКолонок     = мДеревоСтраницОтчета.Колонки.Количество();

		// добавляем новые строки
		Для каждого Строка Из мДеревоСтраницОтчета.Строки Цикл

			Если мПользовательскиеНастройкиСтраниц.Строки.Найти(Строка.ИмяСтраницы, "ИмяСтраницы") = Неопределено Тогда

				НоваяСтрока = мПользовательскиеНастройкиСтраниц.Строки.Добавить();
				Для НомКолонки = 0 По (КолвоКолонок - 1) Цикл
				
					НоваяСтрока[НомКолонки] = Строка[НомКолонки];
				
				КонецЦикла;

			КонецЕсли;

			// обновляем строки второго уровня
			Если Строка.Строки.Количество() > 0 Тогда

				Для каждого Строка2 Из Строка.Строки Цикл

					Если мПользовательскиеНастройкиСтраниц.Найти(Строка2.ИмяСтраницы, "ИмяСтраницы") = Неопределено Тогда

						НоваяСтрока2 = НоваяСтрока.Строки.Добавить();
						Для НомКолонки = 0 По (КолвоКолонок - 1) Цикл

							НоваяСтрока2[НомКолонки] = Строка2[НомКолонки];

						КонецЦикла;

					КонецЕсли;

				КонецЦикла; 

			КонецЕсли; 

		КонецЦикла;

		// удаляем лишние строки
		Для каждого Строка Из мПользовательскиеНастройкиСтраниц.Строки Цикл

			Если мДеревоСтраницОтчета.Строки.Найти(Строка.ИмяСтраницы, "ИмяСтраницы") = Неопределено Тогда

				мПользовательскиеНастройкиСтраниц.Строки.Удалить(мПользовательскиеНастройкиСтраниц.Строки.Индекс(Строка));

			КонецЕсли;

		КонецЦикла;

		ЕстьИзменения = Истина;
	КонецЕсли;

	// устанавливаем признаки предопределенных установок выгружаемых страниц (значение флажка = 2);
	Для каждого ТекСтрока Из мДеревоСтраницОтчета.Строки Цикл
	
		Если ТекСтрока.ВыгрузитьСтраницу = 2 Тогда
			НомСтр = мДеревоСтраницОтчета.Строки.Индекс(ТекСтрока);

			Если мПользовательскиеНастройкиСтраниц.Строки[НомСтр].ВыгрузитьСтраницу <> 2 Тогда
				мПользовательскиеНастройкиСтраниц.Строки[НомСтр].ВыгрузитьСтраницу = 2;
				ЕстьИзменения = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла; 

	мДеревоСтраницОтчета =  мПользовательскиеНастройкиСтраниц.Скопировать();

	Возврат ЕстьИзменения;

КонецФункции // ОбновитьНастройкиСтраниц()

// Обрабатывает полученный из формы ФормаНастройкиСтраниц дерево значений,
// определяет состав помеченных для вывода на печать листов.
//
// Параметры:
//  ВидПечати - строка, задающая способ печати:
//              "ПоказатьБланк" - непосредственный вывод на печать;
//              "ПечататьСразу" - с предварительным просмотром.
//  унифицирована для всех отчетов
Процедура УстановитьСистемуюОбластьПечатиОтчета()

	Если ТипЗнч(мДеревоСтраницОтчета) <> Тип("ДеревоЗначений") Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураПараметров = Новый Структура;
	
	Для Каждого СтрокаУровня1 Из мДеревоСтраницОтчета.Строки Цикл
		
		ИмяТабличногоПоля  = СтрокаУровня1.ИмяПоляТабличногоДокум;
		ИмяОбластиТаблПоля = СтрокаУровня1.ИмяОбластиТабличногоПоля;

		Если СтрокаУровня1.Строки.Количество() > 0 Тогда

			
			Для Каждого СтрокаУровня2 Из СтрокаУровня1.Строки Цикл
				
				ИмяТабличногоПоля  = СтрокаУровня2.ИмяПоляТабличногоДокум;
				ИмяОбластиТаблПоля = СтрокаУровня2.ИмяОбластиТабличногоПоля;

				Если СтрокаУровня2.Строки.Количество() > 0 Тогда
					
					Для Каждого СтрокаУровня3 Из СтрокаУровня2.Строки Цикл

						ИмяТабличногоПоля  = СтрокаУровня3.ИмяПоляТабличногоДокум;
						ИмяОбластиТаблПоля = СтрокаУровня3.ИмяОбластиТабличногоПоля;

						СтруктураПараметров.Очистить();
						СтруктураПараметров.Вставить("ИмяТабличногоПоля",  ИмяТабличногоПоля);
						Структурапараметров.Вставить("ИмяОбластиТаблПоля", ИмяОбластиТаблПоля);
						
						УстановитьСистемуюОбластьПечатиСтраницыОтчета(СтруктураПараметров);
						
					КонецЦикла;

					Продолжить;

				КонецЕсли;
				
				СтруктураПараметров.Очистить();
				СтруктураПараметров.Вставить("ИмяТабличногоПоля",  ИмяТабличногоПоля);
				Структурапараметров.Вставить("ИмяОбластиТаблПоля", ИмяОбластиТаблПоля);
				
				УстановитьСистемуюОбластьПечатиСтраницыОтчета(СтруктураПараметров);
				
			КонецЦикла;

			Продолжить;

		КонецЕсли;
		
		СтруктураПараметров.Очистить();
		СтруктураПараметров.Вставить("ИмяТабличногоПоля",  ИмяТабличногоПоля);
		Структурапараметров.Вставить("ИмяОбластиТаблПоля", ИмяОбластиТаблПоля);

		УстановитьСистемуюОбластьПечатиСтраницыОтчета(СтруктураПараметров);
		
	КонецЦикла;

КонецПроцедуры // 

// Процедура управляет системным выводом отдельных страниц отчета на печать.
//
// Параметры:
//   СтруктураПараметровЛиста - структура, содержащая параметры печаты страницы:
//      - имя табличного поля, который выводится на печать;
//      - имя области дабличного документа, выводимой на печать;
//  процедура унифицирована
Процедура УстановитьСистемуюОбластьПечатиСтраницыОтчета(СтруктураПараметровЛиста)
	Перем ИмяТабличногоПоля;  // имя табличного поля, который выводится на печать;
	Перем ИмяОбластиТаблПоля; // имя области дабличного документа, выводимой на печать;
  
	СтруктураПараметровЛиста.Свойство("ИмяТабличногоПоля",  ИмяТабличногоПоля);
	СтруктураПараметровЛиста.Свойство("ИмяОбластиТаблПоля", ИмяОбластиТаблПоля);
	
	ТабличноеПоле = ЭлементыФормы[ИмяТабличногоПоля];
	
	Если НЕ ТабличноеПоле.Области.Найти("ПредупреждениеОПечати") = Неопределено Тогда
	    ИмяОбластиПечати = "ПредупреждениеОПечати";
	ИначеЕсли ПустаяСтрока(ИмяОбластиТаблПоля) Тогда
		ИмяОбластиПечати = "";
	Иначе
		ИмяОбластиПечати = ИмяОбластиТаблПоля;
	КонецЕсли;
	
	ТабличноеПоле.ОбластьПечати = ТабличноеПоле.Области.Найти(ИмяОбластиПечати);
	
КонецПроцедуры // ВывестиНаПечатьЛист()

// Управляет видимостью страниц основной панели формы.
//
Процедура ПоказатьСтраницыОтчета()

	Если ТипЗнч(мДеревоВыбранныхСтраниц) <> Тип("ДеревоЗначений") Тогда
		Возврат;
	КонецЕсли;

	ИмеютсяСкрытые      = Ложь;
	СтруктураПараметров = Новый Структура;

	Для Каждого СтрокаУровня1 Из мДеревоВыбранныхСтраниц.Строки Цикл

		ИмяСтраницыПанели  = СтрокаУровня1.ИмяСтраницы;
		ПоказатьСтраницу   = СтрокаУровня1.ПоказатьСтраницу;

		Если ПоказатьСтраницу = 0 Тогда
			ЭлементыФормы.ОсновнаяПанель.Страницы[ИмяСтраницыПанели].Видимость = Ложь;
			ИмеютсяСкрытые = Истина;
		Иначе
			ЭлементыФормы.ОсновнаяПанель.Страницы[ИмяСтраницыПанели].Видимость = Истина;

		КонецЕсли; 

	КонецЦикла;

	// обновляем исходное дерево значений 
	мДеревоСтраницОтчета = мДеревоВыбранныхСтраниц.Скопировать();

	КнопкиНастройки = ЭлементыФормы.КоманднаяПанельФормы.Кнопки.КнопкаНастройкаСтраниц;
	ИсходныйТекст   = НСтр("ru='Настройка страниц';uk='Настройка сторінок'");

	КнопкиНастройки.Текст = ИсходныйТекст;

	Если ИмеютсяСкрытые Тогда
		// Выводим в названии кнопки "Настройка страниц" доп. сммвол '*'.
		КнопкиНастройки.Текст = ИсходныйТекст + " (*)";
	КонецЕсли;

КонецПроцедуры // ПоказатьСтраницыОтчета()

// Процедура управляет показом в форме периода построения отчета,
Процедура ПоказатьПериод()

	ПериодОтчета = Формат(мДатаКонцаПериодаОтчета, "ДФ = 'ММММ гггг'");
	
	// Период в заголовке отчета
	// Для показа периода в заголовке берется текст из заголовка основной формы
	ЭтаФорма.Заголовок = ЭтотОбъект.Метаданные().Формы.ОсновнаяФорма.Представление() + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru=' (за %1 г.)';uk=' (за %1 р.)'"), Формат(мДатаКонцаПериодаОтчета, "ДФ = 'ММММ гггг'")); 
	
КонецПроцедуры // ПоказатьПериод()

// Процедура управляет выводом сведений о выбранной организации
// в соответствующие ячейки табличного документа.
Процедура ЗаполнитьСведенияОбОрганизации()

	ОргНазв = Организация.НаименованиеПолное;
	СписокПоказателей = Новый СписокЗначений;
	//СписокПоказателей.Добавить("","ФИОРук");
	//СписокПоказателей.Добавить("","ФИОБух");
	СписокПоказателей.Добавить("","ИННРук");
	СписокПоказателей.Добавить("","ИННБух");
	СписокПоказателей.Добавить("","КодПоЕДРПОУ");
	СписокПоказателей.Добавить("","ФормаСобственности");
    СписокПоказателей.Добавить("","НомерРегистрацииПФ");
	СписокПоказателей.Добавить("","КодОрганаПФУ");
	
	СведенияОбОрганизации = РегламентированнаяОтчетность.ПолучитьСведенияОбОрганизации(Организация, ДатаПодписи, СписокПоказателей);
	
	мПереченьТаблиц.Области.ЕДРПОУ.Значение              = СведенияОбОрганизации.КодПоЕДРПОУ;
	мПереченьТаблиц.Области.НазваниеОрганизации.Значение = ОргНазв;
	
	//мПереченьТаблиц.Области.РуководительФИО.Значение       = СведенияОбОрганизации.ФИОРук;
	//мПереченьТаблиц.Области.БухгалтерФИО.Значение          = СведенияОбОрганизации.ФИОБух;
	мПереченьТаблиц.Области.РуководительИНН.Значение       = СведенияОбОрганизации.ИННРук;
	мПереченьТаблиц.Области.БухгалтерИНН.Значение          = СведенияОбОрганизации.ИННБух;
	
	Данные = Новый Структура("СтруктурнаяЕдиница",Организация, "ОтветственноеЛицо", Перечисления.ОтветственныеЛицаОрганизаций.Руководитель);
	ОтвЛица = РегистрыСведений.ОтветственныеЛицаОрганизаций.СрезПоследних(ДатаПодписи, Данные);
	Результат = ОтвЛица.Найти(Перечисления.ОтветственныеЛицаОрганизаций.Руководитель);
	Если Результат <> Неопределено Тогда
		ДанныеФИО = Новый Структура("ФизЛицо",Результат.ФизическоеЛицо);
		ФИОСрез = РегистрыСведений.ФИОФизЛиц.ПолучитьПоследнее(ДатаПодписи, ДанныеФИО);
		мПереченьТаблиц.Области.РуководительФИО.Значение = СокрЛП(ФИОСрез.Фамилия) + " " + ФИОСрез.Имя + " " + ФИОСрез.Отчество;
	КонецЕсли;

	Данные = Новый Структура("СтруктурнаяЕдиница",Организация, "ОтветственноеЛицо", Перечисления.ОтветственныеЛицаОрганизаций.ГлавныйБухгалтер);
	ОтвЛица = РегистрыСведений.ОтветственныеЛицаОрганизаций.СрезПоследних(ДатаПодписи, Данные);
	Результат = ОтвЛица.Найти(Перечисления.ОтветственныеЛицаОрганизаций.ГлавныйБухгалтер);
	Если Результат <> Неопределено Тогда
		ДанныеФИО = Новый Структура("ФизЛицо",Результат.ФизическоеЛицо);
		ФИОСрез = РегистрыСведений.ФИОФизЛиц.ПолучитьПоследнее(ДатаПодписи, ДанныеФИО);
		мПереченьТаблиц.Области.БухгалтерФИО.Значение = СокрЛП(ФИОСрез.Фамилия) + " " + ФИОСрез.Имя + " " + ФИОСрез.Отчество;
	КонецЕсли;
	
	ФормаСобственности = СведенияОбОрганизации.ФормаСобственности;
	НомерРегистрацииПФ = СведенияОбОрганизации.НомерРегистрацииПФ;
	
	мТаблица1.Области.ОргФормаСобственности.Значение = ФормаСобственности;
	мТаблица1.Области.НомерРегистрацииПФ.Значение = НомерРегистрацииПФ;
	мПереченьТаблиц.Области.КодОрганаПФУ.Значение = СведенияОбОрганизации.КодОрганаПФУ;

	мТаблица1.Области.Адрес.Значение   = УправлениеКонтактнойИнформацией.ПолучитьАдресИзКонтактнойИнформации(Организация,"Юридический");
	мТаблица1.Области.Телефон.Значение = УправлениеКонтактнойИнформацией.ПолучитьТелефонИзКонтактнойИнформации(Организация);
	
	ДопСведенияОбОрганизации        = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Организация, мДатаНачалаПериодаОтчета, "uk");
	мТаблица1.Области.РС.Значение    = ДопСведенияОбОрганизации.НомерСчета;
	мТаблица1.Области.Банк.Значение  = ДопСведенияОбОрганизации.Банк;
	мТаблица1.Области.МФО.Значение   = ДопСведенияОбОрганизации.МФО;
	
	Если Не РегламентированнаяОтчетность.ИДКонфигурации() = "ЗУП" Тогда
		СхемаНалогообл = Справочники.СхемыНалогообложения.НеПлательщик;
		УчетнаяПолитикаНеЗадана = Ложь;
		УчетнаяПолитика = ОбщегоНазначения.ПолучитьПараметрыУчетнойПолитики(мДатаНачалаПериодаОтчета, УчетнаяПолитикаНеЗадана, Организация, "Нал");
		Если НЕ УчетнаяПолитикаНеЗадана Тогда 
			СхемаНалогообл = УчетнаяПолитика.СхемаНалогообложения;
			СистНалОблож = ?(СхемаНалогообл.НалогНаПрибыль, "Платник збору на загальних підставах", "Платник єдиного податку");
			мТаблица1.Области.СистНалОблож.Значение = СистНалОблож;
		КонецЕсли;
	Иначе
	  //Пользователь сам должен заполнить  поле СистемуНалогообложения
	КонецЕсли;
	
	ПоказатьПериод();
	
	мТаблица5.Области.Начальная.Значение = "Х";
	мТаблица6.Области.Начальная.Значение = "Х";
	мТаблица7.Области.Начальная.Значение = "Х";
	мТаблица8.Области.Начальная.Значение = "Х";
	
	мТаблица5.Области.Корректирующая.Значение = "";
	
	мТаблица5.Области.Отменяющая.Значение = "";
	мТаблица6.Области.Отменяющая.Значение = "";
	мТаблица7.Области.Отменяющая.Значение = "";
	мТаблица8.Области.Отменяющая.Значение = "";
	
	мСлужебныеДанные.Области.КодЦентраКлючей.Значение = "0";
	
	мПереченьТаблиц.Области.ИсхДата.Значение = ДатаПодписи;
		
	ЗаполнитьОтображениеДанныхВТаблицах();

КонецПроцедуры // ЗаполнитьСведенияОбОрганизации()

// Процедура контролирует корректность установленной точности указания
// суммовых (денежных) показателей при выборе единицы измерения.
//
Процедура ПроверитьТочность()
	
	Если ЕдиницаИзмерения = Перечисления.ПорядкиОкругленияОтчетности.Окр1 Тогда

		Если ТочностьЕдиницыИзмерения > 2 Тогда
			Сообщить(НСтр("ru='Отчет в ПФ: при выводе сумм в гривнях точность не может превышать 2 знака';uk='Звіт у ПФ: при виведенні сум у гривнях точність не може перевищувати 2 знаки'"), СтатусСообщения.Внимание);
			ТочностьЕдиницыИзмерения = 2;
		КонецЕсли;

	ИначеЕсли ЕдиницаИзмерения = Перечисления.ПорядкиОкругленияОтчетности.Окр1000 Тогда

		Если ТочностьЕдиницыИзмерения > 3 Тогда
			Сообщить(НСтр("ru='Отчет в ПФ: при выводе сумм в тысячах гривень точность не может превышать 3 знака';uk='Звіт у ПФ: при виведенні сум у тисячах гривень точність не може перевищувати 3 знаки'"), СтатусСообщения.Внимание);
			ТочностьЕдиницыИзмерения = 3;
		КонецЕсли;

	ИначеЕсли ЕдиницаИзмерения = Перечисления.ПорядкиОкругленияОтчетности.Окр1000000 Тогда

		Если ТочностьЕдиницыИзмерения > 6 Тогда
			Сообщить(НСтр("ru='Отчет в ПФ: при выводе сумм в миллионах гривень точность не может превышать 6 знаков';uk='Звіт у ПФ: при виведенні сум у мільйонах гривень точність не може перевищувати 6 знаків'"), СтатусСообщения.Внимание);
			ТочностьЕдиницыИзмерения = 6;
		КонецЕсли;

	КонецЕсли;

	Сообщить(НСтр("ru='После изменения формата вывода значений, для корректного расчета итогов необходимо перезаполнить отчет!';uk='Після зміни формату виводу значень, для корректного розрахунку підсумків треба перезаполвнити звіт!'"), СтатусСообщения.Внимание);	
	
КонецПроцедуры // ПроверитьТочность()

// Процедура управляет представлением суммовых (денежных) показателей
// табличного документа при изменении размерности.
//
Процедура УстановитьФорматВывода()
	Перем СтруктураГруппы;

	Если ЕдиницаИзмерения = Перечисления.ПорядкиОкругленияОтчетности.Окр1 Тогда
		мДелитель = 1;
		мСтрокаФормата = "ЧЦ = 15; ЧДЦ = " + ТочностьЕдиницыИзмерения + "; ЧРД=,; ЧН=-; ЧО=2; ЧС = 0";

	ИначеЕсли ЕдиницаИзмерения = Перечисления.ПорядкиОкругленияОтчетности.Окр1000 Тогда
		мДелитель = 1000;
		мСтрокаФормата = "ЧЦ = 15; ЧДЦ = " + ТочностьЕдиницыИзмерения + "; ЧРД=,; ЧН=-; ЧО=2; ЧС = 3";

	ИначеЕсли ЕдиницаИзмерения = Перечисления.ПорядкиОкругленияОтчетности.Окр1000000 Тогда
		мДелитель = 1000000;
		мСтрокаФормата = "ЧЦ = 15; ЧДЦ = " + ТочностьЕдиницыИзмерения + "; ЧРД=,; ЧН=-; ЧО=2; ЧС = 6";

	КонецЕсли;

	Для Каждого СтрПоказатели Из мТаблицаСоставПоказателей Цикл

		ИмяПоляТаблДокумента = СокрП(СтрПоказатели.ИмяПоляТаблДокумента);
		КодПоказателя        = СокрП(СтрПоказатели.КодПоказателяПоСоставу);
		ПризнМногострочность = СокрП(СтрПоказатели.ПризнМногострочности);

		Если КодПоказателя = "===" Тогда
			Прервать;
		КонецЕсли;

		Если (Лев(КодПоказателя, 2) = "//") ИЛИ (КодПоказателя = "###") Тогда
			Продолжить;
		КонецЕсли;

		КодПоказателяВФорме = СокрП(СтрПоказатели.КодПоказателяПоФорме);

		ИмяПоказателя = КодПоказателя;
		Если Не ПустаяСтрока(КодПоказателяВФорме) Тогда
			ИмяПоказателя = КодПоказателяВФорме;
		КонецЕсли;

		ТипДанныхПоказателя = СокрП(СтрПоказатели.ТипДанныхПоказателя);

		Если ТипДанныхПоказателя = "Е" Тогда

			ТекТабличноеПоле = ЭлементыФормы["ПолеТабличногоДокумента" + ИмяПоляТаблДокумента];

			Если ПризнМногострочность <> "/" Тогда
				ФорматируемаяОбласть = ТекТабличноеПоле.Области[ИмяПоказателя];
				ФорматируемаяОбласть.Формат = мСтрокаФормата;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры // УстановитьФорматВывода()

// Процедура управляет цветом фона автозаполняемых ячеек при:
//  а) автозаполнении;
//  б) ручном выборе другого варианта заполнения;
//  в) добавлении/удалении и листании дополнительных страниц.
//
// Цвет фона устанавливается в зависимости от варианта заполнения ячейки.
//
// Параметры:
//  ИмяЯчейки                - строка, имя ячейки, для которой устанавливаем цвет фона;
//  ВариантЗаполнения        - число,  вариант заполнения ячейки;
//  ИмяТекущейСтраницыПанели - строка, имя страницы основной панели, на которой для всех автозаполняемых
//                             ячеек табличного документа следует установить цвет фона.
//
Процедура УстановитьЦветФонаЯчейки(ИмяЯчейки = Неопределено, ВариантЗаполнения = Неопределено, ИмяТекущейСтраницыПанели = "")
	Перем ЦветФона;

	Если Не ИмяЯчейки = Неопределено Тогда
		// устанавливаем цвет фона конкретной ячейки
		ИмяСтраницыПанели = "Таблица1";
		Если ИмяСтраницыПанели = Неопределено Тогда
			Возврат;
		КонецЕсли;

		ИмяПоляТаблДокумента = "ПолеТабличногоДокумента" + ИмяСтраницыПанели;

		Ключ = "_" + ВариантЗаполнения;
		мСтруктураЦветовРаскраски.Свойство(Ключ, ЦветФона);

		ЭлементыФормы[ИмяПоляТаблДокумента].Области[ИмяЯчейки].ЦветФона = ЦветФона;

	Иначе
		// устанавливаем цвет фона всех автозаполняемых ячеек активной страницы

		ТаблицаВариантыЗаполнения = ПолучитьТаблицуВариантовЗаполнения(ИмяТекущейСтраницыПанели);
		Если ТаблицаВариантыЗаполнения = Неопределено Тогда
			Возврат;
		КонецЕсли;

		Для Каждого Строка Из ТаблицаВариантыЗаполнения Цикл
			ИмяПоказателя     = Строка.КодПоказателя;
			ВариантЗаполнения = Строка.ВариантЗаполнения;
			Коммент           = Строка.Комментарий;

			ТекОбластьЯчеек = ЭлементыФормы["ПолеТабличногоДокумента" + ИмяТекущейСтраницыПанели].Области[ИмяПоказателя];
			Если (Не ПустаяСтрока(Коммент)) ИЛИ (Не ПустаяСтрока(ТекОбластьЯчеек.Примечание.Текст)) Тогда
				ТекОбластьЯчеек.Примечание.Текст = Коммент;
			КонецЕсли;

			Ключ = "_" + ВариантЗаполнения;
			мСтруктураЦветовРаскраски.Свойство(Ключ, ЦветФона);

			ЭлементыФормы["ПолеТабличногоДокумента" + ИмяТекущейСтраницыПанели].Области[ИмяПоказателя].ЦветФона = ЦветФона;
		КонецЦикла;

	КонецЕсли;

КонецПроцедуры // УстановитьЦветФонаЯчейки()

// Обновляет пользовательские настройки при изменении версии формы.
// унифицирована, однако использование пока ... вопрос
Процедура ОбновитьПользовательскиеНастройки(СписокСохранения)
   Перем ДанныеМногострочныхРазделов;
   Перем ИсходноеКоличествоСтрокГруппы;
	
	Сообщить(НСтр("ru='Измененилась версия формы отчета."
					"Выполняется обновление пользовательских настроек.';uk='Змінилася версія форми звіту."
					"Виконується відновлення користувльницьких настройок.'"), СтатусСообщения.Информация);
	
	// Обновляем варианты заполнения показателей отчета
	ЕстьИзмененияВариантыЗаполнения = ОбновитьВариантыЗаполнения();
	
	// Обновляем настройки страниц отчета (содержание отчета)
	ЕстьИзмененияНастройкаСтраниц   = ОбновитьНастройкиСтраниц();
	
	ВерсияФормы = СписокСохранения.ВерсияФормы;
	Если ВерсияФормы = "01/01/2010" Тогда
		
		Если СписокСохранения.Свойство( "ДанныеМногострочныхРазделов", ДанныеМногострочныхРазделов) Тогда
			Для Каждого ЭлементСтруктуры Из ДанныеМногострочныхРазделов Цикл
				ИмяГруппы       = ЭлементСтруктуры.Ключ;
				СтруктураГруппы = ЭлементСтруктуры.Значение;
					
				Если  ИмяГруппы = мИдГруппы6 Тогда
					Попытка
					СтруктураГруппы.Колонки.Добавить(мИдГруппы6 + "Имя");
					СтруктураГруппы.Колонки.Добавить(мИдГруппы6 + "Отчество");
					Исключение КонецПопытки;
				КонецЕсли;
				
				Если  ИмяГруппы = мИдГруппы7 Тогда
					Попытка
					СтруктураГруппы.Колонки.Добавить(мИдГруппы7 + "Имя");
					СтруктураГруппы.Колонки.Добавить(мИдГруппы7 + "Отчество");
					Исключение КонецПопытки;
				КонецЕсли;
				
				Если  ИмяГруппы = мИдГруппы8 Тогда
					Попытка
					СтруктураГруппы.Колонки.Добавить(мИдГруппы8 + "Имя");
					СтруктураГруппы.Колонки.Добавить(мИдГруппы8 + "Отчество");
					Исключение КонецПопытки;
				КонецЕсли;
					
			КонецЦикла;
			СписокСохранения.ДанныеМногострочныхРазделов =  ДанныеМногострочныхРазделов;
		КонецЕсли;
		
		СписокСохранения.ВерсияФормы = "01/02/2010";
		Модифицированность = Истина;

	КонецЕсли;	
		
	Если Модифицированность ИЛИ ЕстьИзмененияВариантыЗаполнения ИЛИ ЕстьИзмененияНастройкаСтраниц Тогда
		
		// Если были изменения в пользовательских настройках,
		// то устанавливаем флаг модифицированности формы.
		Модифицированность = Истина;

		Сообщить(НСтр("ru='Обновление пользовательских настроек успешно завершено!';uk='Оновлення користувальницьких настройок успішно завершене!'"));

	Иначе

		Сообщить(НСтр("ru='Изменения в структуре пользовательских настроек не обнаружены!';uk='Зміни в структурі користувальницьких настройок не виявлені!'"));

	КонецЕсли;

КонецПроцедуры // ОбновитьПользовательскиеНастройки()

// Обновляет параметры автозаполнения текущей ячейки табличного
// документа при их изменении. Вычисляет дельту - разницу между
// введенным вручную и автоматически рассчитанным  значениями.
//
Процедура ОбновитьПараметрыАвтозаполненияЯчейки()

	ИмяТекущейСтраницыПанели  = "Таблица1";

	ТаблицаВариантыЗаполнения = ПолучитьТаблицуВариантовЗаполнения(ИмяТекущейСтраницыПанели);
	Если ТаблицаВариантыЗаполнения = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ИмяТекТабличногоПоля = "ПолеТабличногоДокумента" + ИмяТекущейСтраницыПанели;
	ТекТабличноеПоле     = ЭлементыФормы[ИмяТекТабличногоПоля];
	ТекущаяОбласть       = ТекТабличноеПоле.ТекущаяОбласть;
	ИмяПоказателя        = ТекущаяОбласть.Имя;

	НайденнаяСтрока = ТаблицаВариантыЗаполнения.Найти(ИмяПоказателя, "КодПоказателя");

	Если Не НайденнаяСтрока = Неопределено Тогда
		ВариантЗаполнения = НайденнаяСтрока.ВариантЗаполнения;

		Если ВариантЗаполнения = 2 Тогда
			Дельта = ТекущаяОбласть.Значение - НайденнаяСтрока.ЗначениеАвто;

			НайденнаяСтрока.Дельта = Дельта;
			ЭлементыФормы["ПолеВводаЗначениеКорректировки" + ИмяТекущейСтраницыПанели].Значение = Дельта;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры // ОбновитьПараметрыАвтозаполненияЯчейки()

// Процедура отображает параметры автозаполнения ячейки в соответствующих элементах
// текущей страницы формы и, в зависимости от параметров, управляет доступностью 
// элементов .формы.
//
// Параметры:
//  Текущая ячейка - область ячеек табличного документа, по которой необходимо
//                   отобразить параметры автозаполнения.
//
Процедура ВывестиЭлементыВариантаЗаполнения(ТекущаяЯчейка)

	ИмяПоказателя = ТекущаяЯчейка.Имя;

	Если Найти(ИмяПоказателя, ":") > 0 Тогда
		// Неименованная область ячеек таблицы
		ДоступностьЭлементовВариантаЗаполнения(, ТекущаяЯчейка);
		Возврат;
	КонецЕсли;

	Если Не ТекущаяЯчейка.ТипОбласти = ТипОбластиЯчеекТабличногоДокумента.Прямоугольник Тогда
		ДоступностьЭлементовВариантаЗаполнения(, ТекущаяЯчейка);
		Возврат;
	КонецЕсли;

	Если НЕ ТекущаяЯчейка.СодержитЗначение Тогда
		ДоступностьЭлементовВариантаЗаполнения(, ТекущаяЯчейка);
		Возврат;
	КонецЕсли;

	Если ТекущаяЯчейка.Защита Тогда
		ДоступностьЭлементовВариантаЗаполнения(, ТекущаяЯчейка);
		Возврат;
	КонецЕсли;

	//ТекущаяСтраницаПанели    = ЭлементыФормы.ОсновнаяПанель.ТекущаяСтраница;
	ИмяТекущейСтраницыПанели = "Таблица1";

	ТаблицаВариантыЗаполнения = ПолучитьТаблицуВариантовЗаполнения(ИмяТекущейСтраницыПанели);
	Если ТаблицаВариантыЗаполнения = Неопределено Тогда
		Возврат;
	КонецЕсли;

	НайденнаяСтрока = ТаблицаВариантыЗаполнения.Найти(ИмяПоказателя, "КодПоказателя");
	Если НайденнаяСтрока = Неопределено Тогда
		ДоступностьЭлементовВариантаЗаполнения(, ТекущаяЯчейка);
		Возврат;
	КонецЕсли;

	ВариантЗаполнения = НайденнаяСтрока.ВариантЗаполнения;
	Дельта            = НайденнаяСтрока.Дельта;
	Коммент           = НайденнаяСтрока.Комментарий;

	ЭлементыФормы["ПолеВыбораВариантЗаполнения"    + ИмяТекущейСтраницыПанели].Значение = ВариантЗаполнения;
	ЭлементыФормы["ПолеВводаЗначениеКорректировки" + ИмяТекущейСтраницыПанели].Значение = Дельта;
	ЭлементыФормы["ПолеВводаКомментарий"           + ИмяТекущейСтраницыПанели].Значение = Коммент;

	ДоступностьЭлементовВариантаЗаполнения(ВариантЗаполнения);

КонецПроцедуры // ВывестиЭлементыВариантаЗаполнения()

// Процедура устанавливает новый вариант заполнения активной ячейки,
// выполняет реорганизацию структуры вариантов заполнения ячеек
// и управляет видимостью элементов формы, отображающих параметры
// автозаполнения активной ячейки.
//
// Параметры:
//    НовыйВариант - число, соттветствует варианту заполнения ячейки.
//                   Может принимать значение:
//                       1 - не заполнять автоматически;
//                       2 - заполнять автоматически с корректировкой;
//                       3 - заполнять автоматически без корректировки.
//
Процедура ИзменитьВариантЗаполненияЯчейки(НовыйВариант)

	//ТекущаяСтраницаПанели     = ЭлементыФормы.ОсновнаяПанель.ТекущаяСтраница;
	ИмяТекущейСтраницыПанели  = "Таблица1";

	ТаблицаВариантыЗаполнения = ПолучитьТаблицуВариантовЗаполнения(ИмяТекущейСтраницыПанели);
	Если ТаблицаВариантыЗаполнения = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ТекущаяОбласть  = ЭлементыФормы["ПолеТабличногоДокумента" + ИмяТекущейСтраницыПанели].ТекущаяОбласть;
	ИмяПоказателя   = ТекущаяОбласть.Имя;

	НайденнаяСтрока = ТаблицаВариантыЗаполнения.Найти(ИмяПоказателя, "КодПоказателя");
	Если НайденнаяСтрока <> Неопределено Тогда
		НайденнаяСтрока.ВариантЗаполнения = НовыйВариант;
	КонецЕсли;

	Если НовыйВариант = 1 Тогда

		НайденнаяСтрока.Дельта = 0;
		ЭлементыФормы["ПолеВводаЗначениеКорректировки" + ИмяТекущейСтраницыПанели].Значение = 0;

	ИначеЕсли НовыйВариант = 2 Тогда

		Если (ТекущаяОбласть.Значение = 0) И (НайденнаяСтрока.Дельта = 0) Тогда
			ТекущаяОбласть.Значение = НайденнаяСтрока.ЗначениеАвто;
			Расчет();
		КонецЕсли;

		Дельта = ТекущаяОбласть.Значение - НайденнаяСтрока.ЗначениеАвто;

		НайденнаяСтрока.Дельта = Дельта;
		ЭлементыФормы["ПолеВводаЗначениеКорректировки" + ИмяТекущейСтраницыПанели].Значение = Дельта;

	ИначеЕсли НовыйВариант = 3 Тогда

		Если (ТекущаяОбласть.Значение = 0) И (НайденнаяСтрока.Дельта = 0) Тогда
			ТекущаяОбласть.Значение = НайденнаяСтрока.ЗначениеАвто;
		КонецЕсли;

		НайденнаяСтрока.Дельта = 0;
		НайденнаяСтрока.Комментарий = "";

		ЭлементыФормы["ПолеВводаЗначениеКорректировки" + ИмяТекущейСтраницыПанели].Значение = 0;
		ЭлементыФормы["ПолеВводаКомментарий"           + ИмяТекущейСтраницыПанели].Значение = "";
		
		// Очищаем комментарий редактируемой ячейки
		ТекущаяОбласть.Примечание.Текст = "";

	КонецЕсли;

	УстановитьЦветФонаЯчейки(ИмяПоказателя, НовыйВариант);
	ДоступностьЭлементовВариантаЗаполнения(НовыйВариант);

КонецПроцедуры // ИзменитьВариантЗаполненияЯчейки()

// Процедура устанавливает новое значение автокорректировки активной ячейки,
// участвующей в автозаполнении, выполняет реорганизацию структуры вариантов
// заполнения ячеек и пересчитывает значение активной ячейки с учетом назначенной
// автокорректировки.
//
// Параметры:
//   Дельта - число, новое значение автокорректировки активной ячейки.
//
Процедура ИзменитьЗначениеАвтокорректировки(Дельта)

	//ТекущаяСтраницаПанели     = ЭлементыФормы.ОсновнаяПанель.ТекущаяСтраница;
	ИмяТекущейСтраницыПанели  = "Таблица1";

	ТаблицаВариантыЗаполнения = ПолучитьТаблицуВариантовЗаполнения(ИмяТекущейСтраницыПанели);
	Если ТаблицаВариантыЗаполнения = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ТекущаяОбласть    = ЭлементыФормы["ПолеТабличногоДокумента" + ИмяТекущейСтраницыПанели].ТекущаяОбласть;
	ИмяПоказателя     = ТекущаяОбласть.Имя;

	НайденнаяСтрока   = ТаблицаВариантыЗаполнения.Найти(ИмяПоказателя, "КодПоказателя");
	Если НайденнаяСтрока <> Неопределено Тогда
		НайденнаяСтрока.Дельта = Дельта;
		ТекущаяОбласть.Значение = НайденнаяСтрока.ЗначениеАвто + Дельта;

		Расчет();
	КонецЕсли;
	
КонецПроцедуры // ИзменитьЗначениеАвтокорректировки()

// Процедура устанавливает комментарий по активной ячейки, участвующей в автозаполнении,
// выполняет реорганизацию структуры вариантов заполнения ячеек и устанавливает примечание
// по активной ячейке табличного документа.
//
// Параметры:
//   Комментарий - строка, содержащая примечание по активной ячейке.
//
Процедура ИзменитьКомментарийПоЯчейке(Коммент)

	//ТекущаяСтраницаПанели     = ЭлементыФормы.ОсновнаяПанель.ТекущаяСтраница;
	ИмяТекущейСтраницыПанели  = "Таблица1";

	ТаблицаВариантыЗаполнения = ПолучитьТаблицуВариантовЗаполнения(ИмяТекущейСтраницыПанели);
	Если ТаблицаВариантыЗаполнения = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ТекущаяОбласть  = ЭлементыФормы["ПолеТабличногоДокумента" + ИмяТекущейСтраницыПанели].ТекущаяОбласть;
	ИмяПоказателя   = ТекущаяОбласть.Имя;

	НайденнаяСтрока = ТаблицаВариантыЗаполнения.Найти(ИмяПоказателя, "КодПоказателя");
	Если НайденнаяСтрока <> Неопределено Тогда
		НайденнаяСтрока.Комментарий = Коммент;
	КонецЕсли;

	ТекущаяОбласть.Примечание.Текст = Коммент;

КонецПроцедуры // ИзменитьКомментарийПоЯчейке()

// Процедура определяет алгоритм автозаполнения редактируемой ячейки по переданному коду
// показателя. Если у ячейки имеется признак автозаполнения, то ее значение формируется
// в соответствии с установленным алгоритмом.
//
// Параметры:
//   ИмяПоказателя      - строка, код показателя (имя ячейки);
//   ЗначениеПоказателя - устанавливаемое значение ячейки.
//
Процедура УстановитьЗначениеПоказателя(ИмяПоказателя, ЗначениеПоказателя)

	ТаблицаВариантыЗаполнения = ПолучитьТаблицуВариантовЗаполнения("Таблица1");
	Если НЕ ТаблицаВариантыЗаполнения = Неопределено Тогда

		НайденнаяСтрока = ТаблицаВариантыЗаполнения.Найти(ИмяПоказателя, "КодПоказателя");
		Если НайденнаяСтрока <> Неопределено Тогда

			НайденнаяСтрока.ЗначениеАвто = ЗначениеПоказателя;

			ВариантЗаполнения = НайденнаяСтрока.ВариантЗаполнения;
			Если ВариантЗаполнения = 1 Тогда
				// заполняется только вручную
				Возврат;
			ИначеЕсли ВариантЗаполнения = 2 Тогда
				// автоматически, с возможностью ручной корректировки
				Дельта             = НайденнаяСтрока.Дельта;
				ЗначениеПоказателя = ЗначениеПоказателя + Дельта;
			КонецЕсли;

		КонецЕсли;
	КонецЕсли;

	мТаблица1.Области[ИмяПоказателя].Значение = ЗначениеПоказателя;

КонецПроцедуры // УстановитьЗначениеПоказателя()

// Процедура очищает содержимое редактируемыхи и вычисляемых ячеек
// поля табличного документа, переданного параметром ВыбТабличноеПоле.
//
// Параметры:
//  ВыбТабличноеПоле - поле табличного документа.
//
Процедура ОчиститьТабличноеПоле(ВыбТабличноеПоле)

	Для Инд = 0 По ВыбТабличноеПоле.Области.Количество() - 1 Цикл
		ТекущаяОбласть = ВыбТабличноеПоле.Области[Инд];

		Если Не ТекущаяОбласть.ТипОбласти = ТипОбластиЯчеекТабличногоДокумента.Прямоугольник Тогда
			Продолжить;
		КонецЕсли;

		Если Не ТекущаяОбласть.СодержитЗначение Тогда
			Продолжить;
		КонецЕсли;

		Если ТекущаяОбласть.Защита Тогда
			Продолжить;
		КонецЕсли;
		
		Если Найти(Врег(ТекущаяОбласть.Имя), ВРег("Штампик")) > 0  Тогда
			Продолжить;
		КонецЕсли;
		
		ТекущаяОбласть.Очистить();
	КонецЦикла;

КонецПроцедуры // ОчиститьТабличноеПоле()

// Процедура очищает содержимое редактируемых и вычисляемых
// ячеек табличного документа.
//
Процедура Очистить()
   Перем ИсходноеКоличествоСтрокГруппы;
   
   ТекИсхНомер     = мПереченьТаблиц.Области.ИсхНомер.Значение;
   ТекКодОрганаПФУ = мПереченьТаблиц.Области.КодОрганаПФУ.Значение;
    // Очищаем содержимое ячеек поля табличного документа
	Для Каждого СтраницаПанели из ЭлементыФормы.ОсновнаяПанель.Страницы Цикл

		Если СтраницаПанели.Имя = "ВидыРасчетов" Тогда
			Продолжить;
		КонецЕсли;
		
		ИмяТекТабличногоПоля = "ПолеТабличногоДокумента" + СтраницаПанели.Имя;
		ТекТабличноеПоле = ЭлементыФормы[ИмяТекТабличногоПоля];

		ОчиститьТабличноеПоле(ТекТабличноеПоле);

	КонецЦикла;

	мПереченьТаблиц.Области.ИсхНомер.Значение = ТекИсхНомер;
	мПереченьТаблиц.Области.КодОрганаПФУ.Значение = ТекКодОрганаПФУ;
	мПереченьТаблиц.Области.СтраницТаб1.Значение = 3;
	
	// Далее выясним, есть ли добавленные в многострочный раздел дополнительные строки.
	// При наличии таких строк удаляем их.
	Для Каждого ЭлементСтруктуры Из мСтруктураМногострочныхРазделов Цикл

		ИмяГруппы        = ЭлементСтруктуры.Ключ;
		СтруктураГруппы  = ЭлементСтруктуры.Значение;
		ТекТабличноеПоле = ОпределитьТабличноеПолеПоИдМногострочногоРаздела(ИмяГруппы);

		мСтруктураИсхКолвоСтрокРазделов.Свойство(ИмяГруппы, ИсходноеКоличествоСтрокГруппы);

		ТекущееКоличествоСтрок = СтруктураГруппы.Количество();

		Если ТекущееКоличествоСтрок > ИсходноеКоличествоСтрокГруппы Тогда
			// Имеются дополнительные строки.
			// Удаляем их

			НомерВерхЯчейкиОбласти = 999999999;
			НомерНижнЯчейкиОбласти = 0;
			Для Нстр =  ИсходноеКоличествоСтрокГруппы + 1 ПО ТекущееКоличествоСтрок Цикл

				ТекСтрокаТаблицы = СтруктураГруппы[НСтр - 1];
				
				Для каждого Колонка Из СтруктураГруппы.Колонки Цикл
				
					ИмяКолонки = Колонка.Имя;
					ИмяЯчейкиУдаляемойСтроки = Сред(ИмяКолонки,1,3) + Формат(НСтр,"ЧЦ=4;ЧВН=0;ЧГ=;") + Сред(ИмяКолонки,4);

					// область первой ячейки удаляемой строки многострочного раздела
					ОбластьЯчейки = ТекТабличноеПоле.Области[ИмяЯчейкиУдаляемойСтроки];

					// номера строк удаляемой области
					Если НомерВерхЯчейкиОбласти > ОбластьЯчейки.Верх Тогда
					
						НомерВерхЯчейкиОбласти = ОбластьЯчейки.Верх;	
					
					КонецЕсли;
					Если НомерНижнЯчейкиОбласти < ОбластьЯчейки.Низ Тогда
					
						НомерНижнЯчейкиОбласти = ОбластьЯчейки.Низ;	
					
					КонецЕсли;
					
				КонецЦикла;

			КонецЦикла;
			
			// Определим область удаляемой строки
			УдаляемаяОбласть = ТекТабличноеПоле.Область(НомерВерхЯчейкиОбласти, , НомерНижнЯчейкиОбласти, );

			// непосредственно удаляем область строки табличного документа
			ТекТабличноеПоле.УдалитьОбласть( УдаляемаяОбласть,ТипСмещенияТабличногоДокумента.ПоВертикали );
			
		КонецЕсли;

		СтруктураГруппы.Очистить();
		Для Сч = 1 По ИсходноеКоличествоСтрокГруппы Цикл
			СтруктураГруппы.Добавить();	
		КонецЦикла;
		
	КонецЦикла;

	// обновляем структуру многострочных разделов
	ОбновитьСтруктуруМногострочныхРазделов();
	
	ЗаполнитьСведенияОбОрганизации();

	// Выполняем расчет вычисляемых показателей отчета
	// чтобы очистить соответствующие ячейки
	Расчет();

	// Устанавливаем флаг модифицированности формы
	Модифицированность = Истина;

КонецПроцедуры // Очистить()

Процедура ОбновитьСтруктуруМногострочныхРазделов()
	// Заполняет таблицу значений многострочного раздела
	// указанными в соответствующих ячейках значениями

	// Заполнение выполняется синхронно для обоих многострочных разделов
	Для Каждого ЭлементСтруктуры Из мСтруктураМногострочныхРазделов Цикл
		ИмяГруппы = ЭлементСтруктуры.Ключ;
		СтруктураГруппы = ЭлементСтруктуры.Значение;

		ТекТабличноеПоле = ОпределитьТабличноеПолеПоИдМногострочногоРаздела(ИмяГруппы);

		Для НСтр = 1 По СтруктураГруппы.Количество() Цикл

			ТекСтрокаТаблицы = СтруктураГруппы[НСтр - 1];
		    НСтрНов = НСтр + 1;
			Для Каждого Колонка Из СтруктураГруппы.Колонки Цикл
				ИмяКолонки    = Колонка.Имя;
				ИмяЯчейки    = Сред(ИмяКолонки,1,3) + Формат(НСтр,"ЧЦ=4;ЧВН=0;ЧГ=;") + Сред(ИмяКолонки,4);
				ИмяНовОбластиЯчейки = Сред(ИмяКолонки,1,3) + Формат(НСтрНов,"ЧЦ=4;ЧВН=0;ЧГ=;") + Сред(ИмяКолонки,4);
						
				ОбластьЯчейки = ТекТабличноеПоле.Области[ИмяЯчейки];

				Если ОбластьЯчейки.СодержитЗначение Тогда
					ЗначениеЯчейки = ОбластьЯчейки.Значение;
				Иначе
					ЗначениеЯчейки = ОбластьЯчейки.Текст;
				КонецЕсли;

				ТекСтрокаТаблицы[ИмяКолонки] = ЗначениеЯчейки;

			КонецЦикла;
		КонецЦикла;

	КонецЦикла;

КонецПроцедуры // ОбновитьСтруктуруМногострочныхРазделов()

// Открывает форму документа ФормаСпискаДопСтраниц для выбора из списка и
// последующего отображения дополнительной страницы многостраничного раздела.
// унифицирована, но актуально только для отчетов с наличием таких многостраничных разделов
// Процедура управляет выводом отдельных страниц отчета на печать.
//
// Параметры:
//   СтруктураПараметровЛиста - структура, содержащая параметры печаты страницы:
//      - Имя выводимого на печать листа;
//      - ориентация страницы;
//      - имя табличного поля, который выводится на печать;
//      - имя области дабличного документа, выводимой на печать;
//      - строка, задающая способ печати.Принимает значения:
//           "ПечататьСразу" - непосредственный вывод на печать;
//           "ПечататьБланк" - с предварительным просмотром.
//  процедура унифицирована
Процедура ВывестиНаПечатьЛист(СтруктураПараметровЛиста)
	Перем ИмяЛиста;           // имя выводимого на печать листа;
	Перем Ориентация;         // ориентация страницы;
	Перем ИмяТабличногоПоля;  // имя табличного поля, который выводится на печать;
	Перем ИмяОбластиТаблПоля; // имя области дабличного документа, выводимой на печать;
	Перем ВидПечати;          // строка, задающая способ печати
  
	СтруктураПараметровЛиста.Свойство("НаименованиеЛиста",  ИмяЛиста);
	СтруктураПараметровЛиста.Свойство("ОриентацияЛиста",    Ориентация);
	СтруктураПараметровЛиста.Свойство("ИмяТабличногоПоля",  ИмяТабличногоПоля);
	СтруктураПараметровЛиста.Свойство("ИмяОбластиТаблПоля", ИмяОбластиТаблПоля);
	СтруктураПараметровЛиста.Свойство("ВидПечати",          ВидПечати);
	
	ОбновитьСтруктуруМногострочныхРазделов();
	
	Если ИмяТабличногоПоля = "ПолеТабличногоДокументаПереченьТаблиц" Тогда
		
		ТабДокумент  = Новый ТабличныйДокумент;
		ТабДокумент.ОриентацияСтраницы = Ориентация;
		ОбластьПечати = мПереченьТаблиц.ПолучитьОбласть(ИмяОбластиТаблПоля);
		
		ТабДокумент.Вывести(ОбластьПечати);
		
		РазбитьПечатнуюФорму(ТабДокумент, ИмяЛиста);
		//РегламентированнаяОтчетность.ПроставитьНомераЛистов(ЭтаФорма, ВидПечати, Ложь);
		
	ИначеЕсли ИмяТабличногоПоля = "ПолеТабличногоДокументаТаблица1" Тогда
		
		ТабДокумент  = Новый ТабличныйДокумент;
		ТабДокумент.ОриентацияСтраницы = Ориентация;
		ОбластьПечати = мТаблица1.ПолучитьОбласть(ИмяОбластиТаблПоля);
		
		ТабДокумент.Вывести(ОбластьПечати);
		
		РазбитьПечатнуюФорму(ТабДокумент, ИмяЛиста);
		//РегламентированнаяОтчетность.ПроставитьНомераЛистов(ЭтаФорма, ВидПечати, Ложь);
		
	ИначеЕсли ИмяТабличногоПоля = "ПолеТабличногоДокументаТаблица5" Тогда
		
		СтруктураГруппы = Неопределено;
		
		мСтруктураМногострочныхРазделов.Свойство(мИдГруппы5, СтруктураГруппы);
	
		Если ТаблицаМногострочнойЧастиПуста(СтруктураГруппы, мИдГруппы5) Тогда		
			Возврат;
		КонецЕсли;
		
		НомерЛиста =  мПереченьТаблиц.Области.СтраницТаб1.Значение
				   + мПереченьТаблиц.Области.СтраницТаб2.Значение
				   + мПереченьТаблиц.Области.СтраницТаб3.Значение
				   + мПереченьТаблиц.Области.СтраницТаб4.Значение;
		
		ТабДокумент  = Новый ТабличныйДокумент;
		ТабДокумент.ОриентацияСтраницы = Ориентация;
		
		Макет = ПолучитьМакет("Таблица5");
		
		Шапка  = Макет.ПолучитьОбласть("Шапка");
		ЗначениеВКлетку(мПереченьТаблиц.Области.ЕДРПОУ.Значение + "          ", Ложь, 10, "ЕДРПОУ", Шапка, Истина);
		ЗначениеВКлетку(мПереченьТаблиц.Области.Филиал.Значение + "     ", Ложь, 5, "Филиал", Шапка, Истина);
		ЗначениеВКлетку(Месяц(мДатаНачалаПериодаОтчета), Истина, 2, "Мес", Шапка, Истина);
		ЗначениеВКлетку(Год(мДатаНачалаПериодаОтчета), Истина, 4, "Год", Шапка, Истина);
		Шапка.Параметры.НазваниеОрганизации = мПереченьТаблиц.Области.НазваниеОрганизации.Значение;
		Шапка.Параметры.Начальная 		= мТаблица5.Области.Начальная.Значение;
		Шапка.Параметры.Корректирующая 	= мТаблица5.Области.Корректирующая.Значение;
		Шапка.Параметры.Отменяющая 		= мТаблица5.Области.Отменяющая.Значение;
		Шапка.Параметры.ИсхНомер 		= мПереченьТаблиц.Области.ИсхНомер.Значение;
		                                     
		Строка = Макет.ПолучитьОбласть("Строка");
		
		Подвал = Макет.ПолучитьОбласть("Подвал");		
		ЗначениеВКлетку(День(ДатаПодписи),  Истина,    2, "деньПодписи",   Подвал, Истина);
		ЗначениеВКлетку(Месяц(ДатаПодписи), Истина,    2, "месПодписи",    Подвал, Истина);
		ЗначениеВКлетку(Год(ДатаПодписи),   Истина,    4, "годПодписи",    Подвал, Истина);
		ЗначениеВКлетку(мПереченьТаблиц.Области.РуководительИНН.Значение + "          ", Ложь, 10, "РуководительИНН", Подвал, Истина);
		ЗначениеВКлетку(мПереченьТаблиц.Области.БухгалтерИНН.Значение + "          ", Ложь, 10, "БухгалтерИНН", Подвал, Истина);
		Подвал.Параметры.РуководительФИО = мПереченьТаблиц.Области.РуководительФИО.Значение;
		Подвал.Параметры.БухгалтерФИО 	 = мПереченьТаблиц.Области.БухгалтерФИО.Значение;
		
		НоваяСтраница = Истина;
		КоличествоСтрок = 1;
		Для каждого СтрокаГруппы Из СтруктураГруппы Цикл
			
			Если НоваяСтраница Тогда
				НомерЛиста = НомерЛиста + 1;
				Шапка.Параметры.НомерЛиста = НомерЛиста;
				
				ТабДокумент.Вывести(Шапка);
				
				КоличествоСтрок = 1;
				НоваяСтраница = Ложь;
			КонецЕсли;
			
			
			Строка.Параметры.НомерСтроки  = КоличествоСтрок;
			
			ЗначениеВКлетку(СтрокаГруппы.Т5_ДРФО + "          ", Ложь,    10, "ДРФО",    Строка, Истина);
			Строка.Параметры.Фамилия  = СтрокаГруппы.Т5_Фамилия;
			Строка.Параметры.Имя 	  = СтрокаГруппы.Т5_Имя;
			Строка.Параметры.Отчество = СтрокаГруппы.Т5_Отчество;
			
			Если ЗначениеЗаполнено(СтрокаГруппы.Т5_ДатаНач) Тогда
				ЗначениеВКлетку(День(СтрокаГруппы.Т5_ДатаНач), Истина,    2, "ДатаНачала",    Строка, Истина);
			Иначе			
			    ЗначениеВКлетку("", Ложь,    2, "ДатаНачала",    Строка, Истина);
			КонецЕсли;
			
			Если ЗначениеЗаполнено(СтрокаГруппы.Т5_ДатаКон) Тогда
			    ЗначениеВКлетку(День(СтрокаГруппы.Т5_ДатаКон), Истина,    2, "ДатаОкончания", Строка, Истина);
			Иначе	
				ЗначениеВКлетку("", Ложь,    2, "ДатаОкончания", Строка, Истина);
			КонецЕсли;
			
			ТабДокумент.Вывести(Строка);
			
			Если КоличествоСтрок = 15 Тогда
				ЗначениеВКлетку(КоличествоСтрок, Истина, 2, "КоличествоСтрок", Подвал, Истина);
				ТабДокумент.Вывести(Подвал);
				НоваяСтраница = Истина;
			Иначе
				КоличествоСтрок = КоличествоСтрок + 1;
			КонецЕсли;
		
		КонецЦикла;
		
		Если НЕ НоваяСтраница Тогда
			
			// последняя не полная страница
			
			// дополним пустыми строками
			Строка = Макет.ПолучитьОбласть("Строка");
			Для НомПараметра = 0 По Строка.Параметры.Количество() - 1 Цикл
				Строка.Параметры[НомПараметра] = "";
			КонецЦикла;
			
			Для НомерСтркиПустышки = КоличествоСтрок По 15 Цикл
				Строка.Параметры.НомерСтроки = НомерСтркиПустышки;
				ТабДокумент.Вывести(Строка);
			КонецЦикла;
			
			ЗначениеВКлетку(КоличествоСтрок - 1, Истина, 2, "КоличествоСтрок", Подвал, Истина);
			ТабДокумент.Вывести(Подвал);
		КонецЕсли;
		
		РазбитьПечатнуюФорму(ТабДокумент, ИмяЛиста);
		//РегламентированнаяОтчетность.ПроставитьНомераЛистов(ЭтаФорма, ВидПечати, Ложь);
		
	ИначеЕсли ИмяТабличногоПоля = "ПолеТабличногоДокументаТаблица6" Тогда
		
		СтруктураГруппы = Неопределено;
		
		мСтруктураМногострочныхРазделов.Свойство(мИдГруппы6, СтруктураГруппы);
	
		Если ТаблицаМногострочнойЧастиПуста(СтруктураГруппы, мИдГруппы6) Тогда		
			Возврат;
		КонецЕсли;
		
		НомерЛиста =  мПереченьТаблиц.Области.СтраницТаб1.Значение
				   + мПереченьТаблиц.Области.СтраницТаб2.Значение
				   + мПереченьТаблиц.Области.СтраницТаб3.Значение
				   + мПереченьТаблиц.Области.СтраницТаб4.Значение
				   + мПереченьТаблиц.Области.СтраницТаб5.Значение;
		
		ТабДокумент  = Новый ТабличныйДокумент;
		ТабДокумент.ОриентацияСтраницы = Ориентация;
		
		Макет = ПолучитьМакет("Таблица6");
		
		Шапка  = Макет.ПолучитьОбласть("Шапка");
		ЗначениеВКлетку(мПереченьТаблиц.Области.ЕДРПОУ.Значение + "          ", Ложь, 10, "ЕДРПОУ", Шапка, Истина);
		ЗначениеВКлетку(мПереченьТаблиц.Области.Филиал.Значение + "     ", Ложь, 5, "Филиал", Шапка, Истина);
		ЗначениеВКлетку(Месяц(мДатаНачалаПериодаОтчета), Истина, 2, "Мес", Шапка, Истина);
		ЗначениеВКлетку(Год(мДатаНачалаПериодаОтчета), Истина, 4, "Год", Шапка, Истина);
		Шапка.Параметры.НазваниеОрганизации = мПереченьТаблиц.Области.НазваниеОрганизации.Значение;
		Шапка.Параметры.Начальная 		= мТаблица5.Области.Начальная.Значение;
		Шапка.Параметры.Отменяющая 		= мТаблица5.Области.Отменяющая.Значение;
		Шапка.Параметры.ИсхНомер 		= мПереченьТаблиц.Области.ИсхНомер.Значение;
		                                     
		Строка = Макет.ПолучитьОбласть("Строка");
		
		Подвал = Макет.ПолучитьОбласть("Подвал");		
		ЗначениеВКлетку(День(ДатаПодписи),  Истина,    2, "деньПодписи",   Подвал, Истина);
		ЗначениеВКлетку(Месяц(ДатаПодписи), Истина,    2, "месПодписи",    Подвал, Истина);
		ЗначениеВКлетку(Год(ДатаПодписи),   Истина,    4, "годПодписи",    Подвал, Истина);
		ЗначениеВКлетку(мПереченьТаблиц.Области.РуководительИНН.Значение + "          ", Ложь, 10, "РуководительИНН", Подвал, Истина);
		ЗначениеВКлетку(мПереченьТаблиц.Области.БухгалтерИНН.Значение + "          ", Ложь, 10, "БухгалтерИНН", Подвал, Истина);
		Подвал.Параметры.РуководительФИО = мПереченьТаблиц.Области.РуководительФИО.Значение;
		Подвал.Параметры.БухгалтерФИО 	 = мПереченьТаблиц.Области.БухгалтерФИО.Значение;
		
		НоваяСтраница = Истина;
		КоличествоСтрок = 1;
		ИтогоНачислено = 0;
		ИтогоНачисленоМаксБаза = 0;
		ИтогоВзносы = 0;
		Для каждого СтрокаГруппы Из СтруктураГруппы Цикл
			
			Если НоваяСтраница Тогда
				НомерЛиста = НомерЛиста + 1;
				Шапка.Параметры.НомерЛиста = НомерЛиста;
				
				ТабДокумент.Вывести(Шапка);
				
				КоличествоСтрок = 1;
				НоваяСтраница = Ложь;
			КонецЕсли;
			
			Строка.Параметры.НомерСтроки  = КоличествоСтрок;
			
			ЗначениеВКлетку(СтрокаГруппы.Т6_ДРФО + "          ", Ложь,    10, "ДРФО",    Строка, Истина);
			//Строка.Параметры.ФИО  = СтрокаГруппы.Т6_ФИО;
			Строка.Параметры.ФИО    =  СтрокаГруппы.Т6_ФИО 
									//+ ?(ЗначениеЗаполнено(СтрокаГруппы.Т6_Имя),       " " + Лев(СтрокаГруппы.Т6_Имя,1)+ ".", "")
									//+ ?(ЗначениеЗаполнено(СтрокаГруппы.Т6_Отчество),  " " + Лев(СтрокаГруппы.Т6_Отчество,1)+ ".", "");
									//+ " " + Лев(СтрокаГруппы.Т6_Имя,1)
									//+ " " + Лев(СтрокаГруппы.Т6_Отчество,1);
									+ " " + СтрокаГруппы.Т6_Имя
									+ " " + СтрокаГруппы.Т6_Отчество;
			
			ЗначениеВКлетку(СтрокаГруппы.Т6_Категория, Ложь,    2, "Категория",    Строка, Истина);
			ЗначениеВКлетку(СтрокаГруппы.Т6_ТипСтавки, Ложь,    2, "ТипСтавки",    Строка, Истина);
			
			ЗначениеВКлетку(ПолучитьГривны(СтрокаГруппы.Т6_СуммаНачислено), Ложь,    9, "СуммаНачисленоГрн",    Строка, Истина);			
			ЗначениеВКлетку(ПолучитьКопейки(СтрокаГруппы.Т6_СуммаНачислено), Истина,   2, "СуммаНачисленоКоп",    Строка, Истина);			
			
			ЗначениеВКлетку(ПолучитьГривны(СтрокаГруппы.Т6_СуммаНачисленоМаксБаза), Ложь,    9, "СуммаНачисленоМаксБазаГрн",    Строка, Истина);			
			ЗначениеВКлетку(ПолучитьКопейки(СтрокаГруппы.Т6_СуммаНачисленоМаксБаза), Истина,   2, "СуммаНачисленоМаксБазаКоп",    Строка, Истина);			
			
			ЗначениеВКлетку(ПолучитьГривны(СтрокаГруппы.Т6_СуммаВзносов), Ложь,    6, "СуммаВзносовГрн",    Строка, Истина);			
			ЗначениеВКлетку(ПолучитьКопейки(СтрокаГруппы.Т6_СуммаВзносов), Истина,   2, "СуммаВзносовКоп",    Строка, Истина);			
			
			ИтогоНачислено 			= ИтогоНачислено 		 + СтрокаГруппы.Т6_СуммаНачислено;
			ИтогоНачисленоМаксБаза  = ИтогоНачисленоМаксБаза + СтрокаГруппы.Т6_СуммаНачисленоМаксБаза;
			ИтогоВзносы 			= ИтогоВзносы 			 + СтрокаГруппы.Т6_СуммаВзносов;
			
			Строка.Параметры.ТрудКнижка  = Формат(СтрокаГруппы.Т6_ТрудКнижка,"ЧЦ=1; ЧН=");
			Строка.Параметры.СпецСтаж    = Формат(СтрокаГруппы.Т6_СпецСтаж,"ЧЦ=1; ЧН=");
			
			ТабДокумент.Вывести(Строка);
			
			Если КоличествоСтрок = 10 Тогда
				
				ЗначениеВКлетку(ПолучитьГривны(ИтогоНачислено), Ложь,    9, "СуммаНачисленоГрн",    Подвал, Истина);			
				ЗначениеВКлетку(ПолучитьКопейки(ИтогоНачислено), Истина,   2, "СуммаНачисленоКоп",    Подвал, Истина);			
				
				ЗначениеВКлетку(ПолучитьГривны(ИтогоНачисленоМаксБаза), Ложь,    9, "СуммаНачисленоМаксБазаГрн",    Подвал, Истина);			
				ЗначениеВКлетку(ПолучитьКопейки(ИтогоНачисленоМаксБаза), Истина,   2, "СуммаНачисленоМаксБазаКоп",    Подвал, Истина);			
				
				ЗначениеВКлетку(ПолучитьГривны(ИтогоВзносы), Ложь,    6, "СуммаВзносовГрн",    Подвал, Истина);			
				ЗначениеВКлетку(ПолучитьКопейки(ИтогоВзносы), Истина,   2, "СуммаВзносовКоп",    Подвал, Истина);			
				
				ЗначениеВКлетку(КоличествоСтрок, Истина, 2, "КоличествоСтрок", Подвал, Истина);
				
				ТабДокумент.Вывести(Подвал);
				
				НоваяСтраница = Истина;
				ИтогоНачислено = 0;
				ИтогоНачисленоМаксБаза = 0;
				ИтогоВзносы = 0;
				
			Иначе
				КоличествоСтрок = КоличествоСтрок + 1;
			КонецЕсли;
		
		КонецЦикла;
		
		Если НЕ НоваяСтраница Тогда
			
			// последняя не полная страница
			
			// дополним пустыми строками
			Строка = Макет.ПолучитьОбласть("Строка");
			Для НомПараметра = 0 По Строка.Параметры.Количество() - 1 Цикл
				Строка.Параметры[НомПараметра] = "";
			КонецЦикла;
			
			Для НомерСтркиПустышки = КоличествоСтрок По 10 Цикл
				Строка.Параметры.НомерСтроки = НомерСтркиПустышки;
				ТабДокумент.Вывести(Строка);
			КонецЦикла;
			
			ЗначениеВКлетку(ПолучитьГривны(ИтогоНачислено), Ложь,    9, "СуммаНачисленоГрн",    Подвал, Истина);			
			ЗначениеВКлетку(ПолучитьКопейки(ИтогоНачислено), Истина,   2, "СуммаНачисленоКоп",    Подвал, Истина);			
			
			ЗначениеВКлетку(ПолучитьГривны(ИтогоНачисленоМаксБаза), Ложь,    9, "СуммаНачисленоМаксБазаГрн",    Подвал, Истина);			
			ЗначениеВКлетку(ПолучитьКопейки(ИтогоНачисленоМаксБаза), Истина,   2, "СуммаНачисленоМаксБазаКоп",    Подвал, Истина);			
			
			ЗначениеВКлетку(ПолучитьГривны(ИтогоВзносы), Ложь,    6, "СуммаВзносовГрн",    Подвал, Истина);			
			ЗначениеВКлетку(ПолучитьКопейки(ИтогоВзносы), Истина,   2, "СуммаВзносовКоп",    Подвал, Истина);			
			
			ЗначениеВКлетку(КоличествоСтрок - 1, Истина, 2, "КоличествоСтрок", Подвал, Истина);
			ТабДокумент.Вывести(Подвал);
			
		КонецЕсли;
		
		РазбитьПечатнуюФорму(ТабДокумент, ИмяЛиста);
		//РегламентированнаяОтчетность.ПроставитьНомераЛистов(ЭтаФорма, ВидПечати, Ложь);
		
	ИначеЕсли ИмяТабличногоПоля = "ПолеТабличногоДокументаТаблица7" Тогда
		
		СтруктураГруппы = Неопределено;
		
		мСтруктураМногострочныхРазделов.Свойство(мИдГруппы7, СтруктураГруппы);
	
		Если ТаблицаМногострочнойЧастиПуста(СтруктураГруппы, мИдГруппы7) Тогда		
			Возврат;
		КонецЕсли;
		
		НомерЛиста =  мПереченьТаблиц.Области.СтраницТаб1.Значение
				   + мПереченьТаблиц.Области.СтраницТаб2.Значение
				   + мПереченьТаблиц.Области.СтраницТаб3.Значение
				   + мПереченьТаблиц.Области.СтраницТаб4.Значение
				   + мПереченьТаблиц.Области.СтраницТаб5.Значение
				   + мПереченьТаблиц.Области.СтраницТаб6.Значение;
		
		ТабДокумент  = Новый ТабличныйДокумент;
		ТабДокумент.ОриентацияСтраницы = Ориентация;
		
		Макет = ПолучитьМакет("Таблица7");
		
		Шапка  = Макет.ПолучитьОбласть("Шапка");
		ЗначениеВКлетку(мПереченьТаблиц.Области.ЕДРПОУ.Значение + "          ", Ложь, 10, "ЕДРПОУ", Шапка, Истина);
		ЗначениеВКлетку(мПереченьТаблиц.Области.Филиал.Значение + "     ", Ложь, 5, "Филиал", Шапка, Истина);
		ЗначениеВКлетку(Месяц(мДатаНачалаПериодаОтчета), Истина, 2, "Мес", Шапка, Истина);
		ЗначениеВКлетку(Год(мДатаНачалаПериодаОтчета), Истина, 4, "Год", Шапка, Истина);
		Шапка.Параметры.НазваниеОрганизации = мПереченьТаблиц.Области.НазваниеОрганизации.Значение;
		Шапка.Параметры.Начальная 		= мТаблица5.Области.Начальная.Значение;
		Шапка.Параметры.Отменяющая 		= мТаблица5.Области.Отменяющая.Значение;
		Шапка.Параметры.ИсхНомер 		= мПереченьТаблиц.Области.ИсхНомер.Значение;
		                                     
		Строка = Макет.ПолучитьОбласть("Строка");
		
		Подвал = Макет.ПолучитьОбласть("Подвал");		
		ЗначениеВКлетку(День(ДатаПодписи),  Истина,    2, "деньПодписи",   Подвал, Истина);
		ЗначениеВКлетку(Месяц(ДатаПодписи), Истина,    2, "месПодписи",    Подвал, Истина);
		ЗначениеВКлетку(Год(ДатаПодписи),   Истина,    4, "годПодписи",    Подвал, Истина);
		ЗначениеВКлетку(мПереченьТаблиц.Области.РуководительИНН.Значение + "          ", Ложь, 10, "РуководительИНН", Подвал, Истина);
		ЗначениеВКлетку(мПереченьТаблиц.Области.БухгалтерИНН.Значение + "          ", Ложь, 10, "БухгалтерИНН", Подвал, Истина);
		Подвал.Параметры.РуководительФИО = мПереченьТаблиц.Области.РуководительФИО.Значение;
		Подвал.Параметры.БухгалтерФИО 	 = мПереченьТаблиц.Области.БухгалтерФИО.Значение;
		
		НоваяСтраница = Истина;
		КоличествоСтрок = 1;
		ИтогоНачислено = 0;
		ИтогоНачисленоМаксБаза = 0;
		ИтогоВзносы = 0;
		Для каждого СтрокаГруппы Из СтруктураГруппы Цикл
			
			Если НоваяСтраница Тогда
				НомерЛиста = НомерЛиста + 1;
				Шапка.Параметры.НомерЛиста = НомерЛиста;
				
				ТабДокумент.Вывести(Шапка);
				
				КоличествоСтрок = 1;
				НоваяСтраница = Ложь;
			КонецЕсли;
			
			Строка.Параметры.НомерСтроки  = КоличествоСтрок;
			
			ЗначениеВКлетку(СтрокаГруппы.Т7_ДРФО + "          ", Ложь,    10, "ДРФО",    Строка, Истина);
			//Строка.Параметры.ФИО  = СтрокаГруппы.Т7_ФИО;
			Строка.Параметры.ФИО    =  СтрокаГруппы.Т7_ФИО 
									//+ ?(ЗначениеЗаполнено(СтрокаГруппы.Т7_Имя),       " " + Лев(СтрокаГруппы.Т7_Имя,1)+ ".", "")
									//+ ?(ЗначениеЗаполнено(СтрокаГруппы.Т7_Отчество),  " " + Лев(СтрокаГруппы.Т7_Отчество,1)+ ".", "");
									//+ " " + Лев(СтрокаГруппы.Т7_Имя,1)
									//+ " " + Лев(СтрокаГруппы.Т7_Отчество,1);
									+ " " + СтрокаГруппы.Т7_Имя
									+ " " + СтрокаГруппы.Т7_Отчество;
			
			ЗначениеВКлетку(СтрокаГруппы.Т7_Категория, Ложь,    2, "Категория",    Строка, Истина);
			ЗначениеВКлетку(СтрокаГруппы.Т7_ТипСтавки, Ложь,    2, "ТипСтавки",    Строка, Истина);
			
			Если ЗначениеЗаполнено(СтрокаГруппы.Т7_МесяцНачисления) Тогда
				ЗначениеВКлетку(Месяц(СтрокаГруппы.Т7_МесяцНачисления), Истина,    2, "МесяцНачисленияМес",    Строка, Истина);
				ЗначениеВКлетку(Год(СтрокаГруппы.Т7_МесяцНачисления), Истина,    4, "МесяцНачисленияГод",    Строка, Истина);
			Иначе	
				ЗначениеВКлетку("", Ложь,    2, "МесяцНачисленияМес",    Строка, Истина);
				ЗначениеВКлетку("", Ложь,    4, "МесяцНачисленияГод",    Строка, Истина);
			КонецЕсли;
			
			Строка.Параметры.ТипНачисления = Формат(СтрокаГруппы.Т7_ТипНачисления,"ЧЦ=1");
			
			ЗначениеВКлетку(ПолучитьГривны(СтрокаГруппы.Т7_СуммаНачислено), Ложь,    6, "СуммаНачисленоГрн",    Строка, Истина);			
			ЗначениеВКлетку(ПолучитьКопейки(СтрокаГруппы.Т7_СуммаНачислено), Истина,   2, "СуммаНачисленоКоп",    Строка, Истина);			
			
			ЗначениеВКлетку(ПолучитьГривны(СтрокаГруппы.Т7_СуммаНачисленоМаксБаза), Ложь,    6, "СуммаНачисленоМаксБазаГрн",    Строка, Истина);			
			ЗначениеВКлетку(ПолучитьКопейки(СтрокаГруппы.Т7_СуммаНачисленоМаксБаза), Истина,   2, "СуммаНачисленоМаксБазаКоп",    Строка, Истина);			
			
			ЗначениеВКлетку(ПолучитьГривны(СтрокаГруппы.Т7_СуммаВзносов), Ложь,    4, "СуммаВзносовГрн",    Строка, Истина);			
			ЗначениеВКлетку(ПолучитьКопейки(СтрокаГруппы.Т7_СуммаВзносов), Истина,   2, "СуммаВзносовКоп",    Строка, Истина);			
			
			ИтогоНачислено 			= ИтогоНачислено 		 + СтрокаГруппы.Т7_СуммаНачислено;
			ИтогоНачисленоМаксБаза  = ИтогоНачисленоМаксБаза + СтрокаГруппы.Т7_СуммаНачисленоМаксБаза;
			ИтогоВзносы 			= ИтогоВзносы 			 + СтрокаГруппы.Т7_СуммаВзносов;
			
			Строка.Параметры.ТрудКнижка  = Формат(СтрокаГруппы.Т7_ТрудКнижка,"ЧЦ=1; ЧН=");
			Строка.Параметры.СпецСтаж    = Формат(СтрокаГруппы.Т7_СпецСтаж,"ЧЦ=1; ЧН=");
			
			ТабДокумент.Вывести(Строка);
			
			Если КоличествоСтрок = 10 Тогда
				
				ЗначениеВКлетку(ПолучитьГривны(ИтогоНачислено), Ложь,    6, "СуммаНачисленоГрн",    Подвал, Истина);			
				ЗначениеВКлетку(ПолучитьКопейки(ИтогоНачислено), Истина,   2, "СуммаНачисленоКоп",    Подвал, Истина);			
				
				ЗначениеВКлетку(ПолучитьГривны(ИтогоНачисленоМаксБаза), Ложь,    6, "СуммаНачисленоМаксБазаГрн",    Подвал, Истина);			
				ЗначениеВКлетку(ПолучитьКопейки(ИтогоНачисленоМаксБаза), Истина,   2, "СуммаНачисленоМаксБазаКоп",    Подвал, Истина);			
				
				ЗначениеВКлетку(ПолучитьГривны(ИтогоВзносы), Ложь,    4, "СуммаВзносовГрн",    Подвал, Истина);			
				ЗначениеВКлетку(ПолучитьКопейки(ИтогоВзносы), Истина,   2, "СуммаВзносовКоп",    Подвал, Истина);			
				
				ЗначениеВКлетку(КоличествоСтрок, Истина, 2, "КоличествоСтрок", Подвал, Истина);
				
				ТабДокумент.Вывести(Подвал);
				
				НоваяСтраница = Истина;
				ИтогоНачислено = 0;
				ИтогоНачисленоМаксБаза = 0;
				ИтогоВзносы = 0;
				
			Иначе
				КоличествоСтрок = КоличествоСтрок + 1;
			КонецЕсли;
		
		КонецЦикла;
		
		Если НЕ НоваяСтраница Тогда
			
			// последняя не полная страница
			
			// дополним пустыми строками
			Строка = Макет.ПолучитьОбласть("Строка");
			Для НомПараметра = 0 По Строка.Параметры.Количество() - 1 Цикл
				Строка.Параметры[НомПараметра] = "";
			КонецЦикла;
			
			Для НомерСтркиПустышки = КоличествоСтрок По 10 Цикл
				Строка.Параметры.НомерСтроки = НомерСтркиПустышки;
				ТабДокумент.Вывести(Строка);
			КонецЦикла;
			
			ЗначениеВКлетку(ПолучитьГривны(ИтогоНачислено), Ложь,    6, "СуммаНачисленоГрн",    Подвал, Истина);			
			ЗначениеВКлетку(ПолучитьКопейки(ИтогоНачислено), Истина,   2, "СуммаНачисленоКоп",    Подвал, Истина);			
			
			ЗначениеВКлетку(ПолучитьГривны(ИтогоНачисленоМаксБаза), Ложь,    6, "СуммаНачисленоМаксБазаГрн",    Подвал, Истина);			
			ЗначениеВКлетку(ПолучитьКопейки(ИтогоНачисленоМаксБаза), Истина,   2, "СуммаНачисленоМаксБазаКоп",    Подвал, Истина);			
			
			ЗначениеВКлетку(ПолучитьГривны(ИтогоВзносы), Ложь,    4, "СуммаВзносовГрн",    Подвал, Истина);			
			ЗначениеВКлетку(ПолучитьКопейки(ИтогоВзносы), Истина,   2, "СуммаВзносовКоп",    Подвал, Истина);			
			
			ЗначениеВКлетку(КоличествоСтрок - 1, Истина, 2, "КоличествоСтрок", Подвал, Истина);
			ТабДокумент.Вывести(Подвал);
			
		КонецЕсли;
		
		РазбитьПечатнуюФорму(ТабДокумент, ИмяЛиста);
		//РегламентированнаяОтчетность.ПроставитьНомераЛистов(ЭтаФорма, ВидПечати, Ложь);
		
	ИначеЕсли ИмяТабличногоПоля = "ПолеТабличногоДокументаТаблица8" Тогда
		
		СтруктураГруппы = Неопределено;
		
		мСтруктураМногострочныхРазделов.Свойство(мИдГруппы8, СтруктураГруппы);
	
		Если ТаблицаМногострочнойЧастиПуста(СтруктураГруппы, мИдГруппы8) Тогда		
			Возврат;
		КонецЕсли;
		
		НомерЛиста =  мПереченьТаблиц.Области.СтраницТаб1.Значение
				   + мПереченьТаблиц.Области.СтраницТаб2.Значение
				   + мПереченьТаблиц.Области.СтраницТаб3.Значение
				   + мПереченьТаблиц.Области.СтраницТаб4.Значение
				   + мПереченьТаблиц.Области.СтраницТаб5.Значение
				   + мПереченьТаблиц.Области.СтраницТаб6.Значение
				   + мПереченьТаблиц.Области.СтраницТаб7.Значение;
		
		ТабДокумент  = Новый ТабличныйДокумент;
		ТабДокумент.ОриентацияСтраницы = Ориентация;
		
		Макет = ПолучитьМакет("Таблица8");
		
		Шапка  = Макет.ПолучитьОбласть("Шапка");
		ЗначениеВКлетку(мПереченьТаблиц.Области.ЕДРПОУ.Значение + "          ", Ложь, 10, "ЕДРПОУ", Шапка, Истина);
		ЗначениеВКлетку(мПереченьТаблиц.Области.Филиал.Значение + "     ", Ложь, 5, "Филиал", Шапка, Истина);
		ЗначениеВКлетку(Месяц(мДатаНачалаПериодаОтчета), Истина, 2, "Мес", Шапка, Истина);
		ЗначениеВКлетку(Год(мДатаНачалаПериодаОтчета), Истина, 4, "Год", Шапка, Истина);
		Шапка.Параметры.НазваниеОрганизации = мПереченьТаблиц.Области.НазваниеОрганизации.Значение;
		Шапка.Параметры.Начальная 		= мТаблица5.Области.Начальная.Значение;
		Шапка.Параметры.Отменяющая 		= мТаблица5.Области.Отменяющая.Значение;
		Шапка.Параметры.ИсхНомер 		= мПереченьТаблиц.Области.ИсхНомер.Значение;
		                                     
		Строка = Макет.ПолучитьОбласть("Строка");
		
		Подвал = Макет.ПолучитьОбласть("Подвал");		
		ЗначениеВКлетку(День(ДатаПодписи),  Истина,    2, "деньПодписи",   Подвал, Истина);
		ЗначениеВКлетку(Месяц(ДатаПодписи), Истина,    2, "месПодписи",    Подвал, Истина);
		ЗначениеВКлетку(Год(ДатаПодписи),   Истина,    4, "годПодписи",    Подвал, Истина);
		ЗначениеВКлетку(мПереченьТаблиц.Области.РуководительИНН.Значение + "          ", Ложь, 10, "РуководительИНН", Подвал, Истина);
		ЗначениеВКлетку(мПереченьТаблиц.Области.БухгалтерИНН.Значение + "          ", Ложь, 10, "БухгалтерИНН", Подвал, Истина);
		Подвал.Параметры.РуководительФИО = мПереченьТаблиц.Области.РуководительФИО.Значение;
		Подвал.Параметры.БухгалтерФИО 	 = мПереченьТаблиц.Области.БухгалтерФИО.Значение;
		
		НоваяСтраница = Истина;
		КоличествоСтрок = 1;
		Для каждого СтрокаГруппы Из СтруктураГруппы Цикл
			
			Если НоваяСтраница Тогда
				НомерЛиста = НомерЛиста + 1;
				Шапка.Параметры.НомерЛиста = НомерЛиста;
				
				ТабДокумент.Вывести(Шапка);
				
				КоличествоСтрок = 1;
				НоваяСтраница = Ложь;
			КонецЕсли;
			
			Строка.Параметры.НомерСтроки  = КоличествоСтрок;
			
			ЗначениеВКлетку(СтрокаГруппы.Т8_ДРФО + "          ", Ложь,    10, "ДРФО",    Строка, Истина);
			//Строка.Параметры.ФИО  = СтрокаГруппы.Т8_ФИО;
			Строка.Параметры.ФИО    =  СтрокаГруппы.Т8_ФИО 
									//+ ?(ЗначениеЗаполнено(СтрокаГруппы.Т8_Имя),       " " + Лев(СтрокаГруппы.Т8_Имя,1) + ".",      "")
									//+ ?(ЗначениеЗаполнено(СтрокаГруппы.Т8_Отчество),  " " + Лев(СтрокаГруппы.Т8_Отчество,1)+ ".", "");
									//+ " " + Лев(СтрокаГруппы.Т8_Имя,1)
									//+ " " + Лев(СтрокаГруппы.Т8_Отчество,1);
									+ " " + СтрокаГруппы.Т8_Имя
									+ " " + СтрокаГруппы.Т8_Отчество;
			
			ЗначениеВКлетку(СтрокаГруппы.Т8_КодОснования, Ложь,    8, "КодОснования",    Строка, Истина);
			
			Если ЗначениеЗаполнено(СтрокаГруппы.Т8_ДатаНач) Тогда
				ЗначениеВКлетку(День(СтрокаГруппы.Т8_ДатаНач), Истина,    2, "ДатаНач",    Строка, Истина);
			Иначе
				ЗначениеВКлетку("", Ложь,    2, "ДатаНач",    Строка, Истина);
			КонецЕсли;
			
			Если ЗначениеЗаполнено(СтрокаГруппы.Т8_ДатаКон) Тогда
				ЗначениеВКлетку(День(СтрокаГруппы.Т8_ДатаКон), Истина,    2, "ДатаКон",    Строка, Истина);
			Иначе				
			    ЗначениеВКлетку("", Ложь,    2, "ДатаКон",    Строка, Истина);
			КонецЕсли;
			
			ЗначениеВКлетку(СтрокаГруппы.Т8_Дней,      Ложь,    2, "Дней",         Строка, Истина);
			ЗначениеВКлетку(СтрокаГруппы.Т8_НормоСмен, Ложь,    3, "НормоСмен",    Строка, Истина);
			
			Если ЗначениеЗаполнено(СтрокаГруппы.Т8_Часов) ИЛИ ЗначениеЗаполнено(СтрокаГруппы.Т8_Минут) Тогда
				ЧасовМинут = Формат(СтрокаГруппы.Т8_Часов, "ЧЦ=3; ЧН=; ЧГ=0") + "|" + Формат(СтрокаГруппы.Т8_Минут, "ЧЦ=2; ЧН=; ЧВН=; ЧГ=0");
			Иначе	
			    ЧасовМинут = "";
			КонецЕсли;
			
			ЗначениеВКлетку(ЧасовМинут,            Ложь,    6, "ЧасовМинут", Строка, Истина);
			ЗначениеВКлетку(СтрокаГруппы.Т8_Норма, Ложь,    6, "Норма",      Строка, Истина);
			
			Строка.Параметры.Сезон  = СтрокаГруппы.Т8_Сезон;
			
			ТабДокумент.Вывести(Строка);
			
			Если КоличествоСтрок = 10 Тогда
				
				ЗначениеВКлетку(КоличествоСтрок, Истина, 2, "КоличествоСтрок", Подвал, Истина);
				
				ТабДокумент.Вывести(Подвал);
				
				НоваяСтраница = Истина;
				
			Иначе
				КоличествоСтрок = КоличествоСтрок + 1;
			КонецЕсли;
		
		КонецЦикла;
		
		Если НЕ НоваяСтраница Тогда
			
			// последняя не полная страница
			
			// дополним пустыми строками
			Строка = Макет.ПолучитьОбласть("Строка");
			Для НомПараметра = 0 По Строка.Параметры.Количество() - 1 Цикл
				Строка.Параметры[НомПараметра] = "";
			КонецЦикла;
			
			Для НомерСтркиПустышки = КоличествоСтрок По 10 Цикл
				Строка.Параметры.НомерСтроки = НомерСтркиПустышки;
				ТабДокумент.Вывести(Строка);
			КонецЦикла;
			
			ЗначениеВКлетку(КоличествоСтрок - 1, Истина, 2, "КоличествоСтрок", Подвал, Истина);
			ТабДокумент.Вывести(Подвал);
			
		КонецЕсли;
		
		РазбитьПечатнуюФорму(ТабДокумент, ИмяЛиста);
		//РегламентированнаяОтчетность.ПроставитьНомераЛистов(ЭтаФорма, ВидПечати, Ложь);
		
	КонецЕсли;	

КонецПроцедуры // ВывестиНаПечатьЛист()

Процедура РазбитьПечатнуюФорму(ПечФорма, ИмяФормы = "")
	
	УчитыватьАвтомасштаб = Ложь;

	ПустойТаблДок = Новый ТабличныйДокумент;
	ПустойТаблДок.АвтоМасштаб = УчитыватьАвтомасштаб;
	ПустойТаблДок.ОриентацияСтраницы = ПечФорма.ОриентацияСтраницы;
	ПустойТаблДок.ЧерноБелаяПечать = Истина;
	ПустойТаблДок.ЧерноБелыйПросмотр = Истина;
	ПослВерх = 1;
	Если ЕстьДуплекс Тогда
		НовТаблДок = Новый ТабличныйДокумент();
	КонецЕсли;
	
	Сч = 0;
	Пока Сч < ПечФорма.ВысотаТаблицы Цикл
		 Сч = Сч + 1;
		 
		Если НЕ ПустойТаблДок.ПроверитьВывод(ПечФорма.ПолучитьОбласть(ПослВерх, 0, Сч, 0)) Тогда
			
			// проверим, не должна ли предпоследняя строка печататься вместе со текущей ("не влезшей") строкой.
			// если так, то "откатимся" вверх
			Пока ПослВерх < Сч-1 И ПечФорма.ПолучитьОбласть(Сч-1, , Сч-1, ).Область().ВместеСоСледующим Цикл
			  Сч = Сч - 1;
			КонецЦикла; 
			
			Если НЕ ЕстьДуплекс Тогда
				НовТаблДок = Новый ТабличныйДокумент();
			КонецЕсли;
			НовТаблДок.Вывести(ПечФорма.ПолучитьОбласть(ПослВерх, 0, Сч - 1, 0));
			НовТаблДок.АвтоМасштаб = УчитыватьАвтомасштаб;
			НовТаблДок.ОриентацияСтраницы = ПечФорма.ОриентацияСтраницы;
			НовТаблДок.ЧерноБелаяПечать = Истина;
			НовТаблДок.ЧерноБелыйПросмотр = Истина;
			НовТаблДок.ОтображатьСетку = Ложь;
			НовТаблДок.ОтображатьЗаголовки = Ложь;
			Если НЕ ЕстьДуплекс Тогда
				мПечатныеФормы.Добавить(НовТаблДок, ИмяФормы);
			КонецЕсли;
			ПослВерх = Сч;
		КонецЕсли;
		
		Если ПечФорма.Область(Сч, 0, Сч, 0).КонецСтраницы Тогда
			Если НЕ ЕстьДуплекс Тогда
				НовТаблДок = Новый ТабличныйДокумент();
			КонецЕсли;
			НовТаблДок.Вывести(ПечФорма.ПолучитьОбласть(ПослВерх, 0, Сч, 0));
			НовТаблДок.АвтоМасштаб = УчитыватьАвтомасштаб;
			НовТаблДок.ОриентацияСтраницы = ПечФорма.ОриентацияСтраницы;
			НовТаблДок.ЧерноБелаяПечать = Истина;
			НовТаблДок.ЧерноБелыйПросмотр = Истина;
			НовТаблДок.ОтображатьСетку = Ложь;
			НовТаблДок.ОтображатьЗаголовки = Ложь;
			Если НЕ ЕстьДуплекс Тогда
				мПечатныеФормы.Добавить(НовТаблДок, ИмяФормы);
			КонецЕсли;
			ПослВерх = Сч + 1;
		КонецЕсли;
		
	КонецЦикла;
	
	Если ПослВерх <= ПечФорма.ВысотаТаблицы Тогда
		Если НЕ ЕстьДуплекс Тогда
			НовТаблДок = Новый ТабличныйДокумент();
		КонецЕсли;
		НовТаблДок.Вывести(ПечФорма.ПолучитьОбласть(ПослВерх, 0, ПечФорма.ВысотаТаблицы, 0));
		НовТаблДок.АвтоМасштаб = УчитыватьАвтомасштаб;
		НовТаблДок.ОриентацияСтраницы = ПечФорма.ОриентацияСтраницы;
		НовТаблДок.ЧерноБелаяПечать = Истина;
		НовТаблДок.ЧерноБелыйПросмотр = Истина;
		НовТаблДок.ОтображатьСетку = Ложь;
		НовТаблДок.ОтображатьЗаголовки = Ложь;
		Если НЕ ЕстьДуплекс Тогда
			мПечатныеФормы.Добавить(НовТаблДок, ИмяФормы);
		КонецЕсли;
	КонецЕсли;
	Если ЕстьДуплекс Тогда
		мПечатныеФормы.Добавить(НовТаблДок, ИмяФормы);
	КонецЕсли;
	
КонецПроцедуры

// Открывает форму документа ФормаНастройкиСтраниц с целью выбора 
// выводимых на печать листов отчета.
//
// Параметры:
//   ВариантВыбора - строка, назначение выбора страниц.
//  унифицирована и актуальна только при наличии таких разделов
Процедура ОткрытьФормуВыбораСтраниц(ВариантВыбора)

	ФормаНастройкиСтраниц = ПолучитьФорму("ФормаНастройкиСтраниц", ЭтаФорма, "дляВыбораСтраницОтчета");

	Если ФормаНастройкиСтраниц.Открыта() Тогда
		ФормаНастройкиСтраниц.Активизировать();
		Если Вопрос(НСтр("ru='Предыдущая операция выбора листов не завершена."
"Завершить?';uk='Попередня операція вибору аркушів не завершена."
"Завершити?'"),РежимДиалогаВопрос.ДаНет,30,КодВозвратаДиалога.Да)=КодВозвратаДиалога.Да Тогда
			ФормаНастройкиСтраниц.Закрыть();
		КонецЕсли;
	КонецЕсли;

	мДеревоВыбранныхСтраниц = "";

	ДеревоСтраницОтчета = мДеревоСтраницОтчета.Скопировать();

	ФормаНастройкиСтраниц.НачальноеЗначениеВыбора = ДеревоСтраницОтчета;
	ФормаНастройкиСтраниц.мВариантВыбора          = ВариантВыбора;

	ВыбранноеЗначение = ФормаНастройкиСтраниц.ОткрытьМодально();

	Если ВыбранноеЗначение <> Неопределено Тогда
		мДеревоВыбранныхСтраниц = ВыбранноеЗначение;
		Модифицированность = Истина;
	Иначе
		мДеревоВыбранныхСтраниц = ДеревоСтраницОтчета;
	КонецЕсли;

КонецПроцедуры // ОткрытьФормуВыбораСтраниц()

// Процедура управляет выводом отчета на печать.
//
// Параметры:
//  ВидПечати - строка, задающая способ печати:
//              "ПоказатьБланк" - непосредственный вывод на печать;
//              "ПечататьСразу" - с предварительным просмотром.
//
Процедура Печать(ВидПечати)
	
	Если ТипЗнч(мДеревоВыбранныхСтраниц) <> Тип("ДеревоЗначений") Тогда
		Возврат;
	КонецЕсли;
	
	Если ОтказПриПроверкеРеквизитовДляВыгрузкиPFZ() Тогда
		Если НЕ Вопрос(Нстр("ru = 'При проверке заполнения отчета обнаружены ошибки!
                             |Продолжить печать отчета?'; uk = 'При перевірці заповнення звіту виявлені помилки!
                             |Продовжити друг звіту?'"), РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
			Возврат;	
		КонецЕсли;
	КонецЕсли;
	
    мПечатныеФормы.Очистить();
	
	СтруктураПараметров = Новый Структура;

	Для Каждого СтрокаУровня1 Из мДеревоВыбранныхСтраниц.Строки Цикл
		Пометка = СтрокаУровня1.ВыводНаПечать;

		ИмяСтраницыПанели  = СтрокаУровня1.ИмяСтраницы;
		НаименованиеЛиста  = СтрокаУровня1.Представление;
		ОриентацияЛиста    = СтрокаУровня1.ОриентацияСтраницы;
		ИмяТабличногоПоля  = СтрокаУровня1.ИмяПоляТабличногоДокум;
		ИмяОбластиТаблПоля = СтрокаУровня1.ИмяОбластиТабличногоПоля;

		Если СтрокаУровня1.Строки.Количество() > 0 Тогда

			Для Каждого СтрокаУровня2 Из СтрокаУровня1.Строки Цикл
				Пометка = СтрокаУровня2.ВыводНаПечать;

				ИмяСтраницыПанели  = СтрокаУровня2.ИмяСтраницы;
				НаименованиеЛиста  = СтрокаУровня2.Представление;
				ОриентацияЛиста    = СтрокаУровня2.ОриентацияСтраницы;
				ИмяТабличногоПоля  = СтрокаУровня2.ИмяПоляТабличногоДокум;
				ИмяОбластиТаблПоля = СтрокаУровня2.ИмяОбластиТабличногоПоля;

				Если СтрокаУровня2.Строки.Количество() > 0 Тогда
					Для Каждого СтрокаУровня3 Из СтрокаУровня2.Строки Цикл

						Пометка = СтрокаУровня3.ВыводНаПечать;
						Если Пометка = 0 Тогда
							Продолжить;
						КонецЕсли;

						ИмяСтраницыПанели  = СтрокаУровня3.ИмяСтраницы;
						НаименованиеЛиста  = СтрокаУровня3.Представление;
						ОриентацияЛиста    = СтрокаУровня3.ОриентацияСтраницы;
						ИмяТабличногоПоля  = СтрокаУровня3.ИмяПоляТабличногоДокум;
						ИмяОбластиТаблПоля = СтрокаУровня3.ИмяОбластиТабличногоПоля;

						СтруктураПараметров.Очистить();
						СтруктураПараметров.Вставить("НаименованиеЛиста",  НаименованиеЛиста);
						СтруктураПараметров.Вставить("ОриентацияЛиста",    ОриентацияЛиста);
						СтруктураПараметров.Вставить("ИмяТабличногоПоля",  ИмяТабличногоПоля);
						Структурапараметров.Вставить("ИмяОбластиТаблПоля", ИмяОбластиТаблПоля);
						СтруктураПараметров.Вставить("ВидПечати",          ВидПечати);

						ВывестиНаПечатьЛист(СтруктураПараметров);
						
					КонецЦикла;

					Продолжить;

				КонецЕсли;

				Если Пометка = 0 Тогда
					Продолжить;
				КонецЕсли;

				СтруктураПараметров.Очистить();
				СтруктураПараметров.Вставить("НаименованиеЛиста",  НаименованиеЛиста);
				СтруктураПараметров.Вставить("ОриентацияЛиста",    ОриентацияЛиста);
				СтруктураПараметров.Вставить("ИмяТабличногоПоля",  ИмяТабличногоПоля);
				Структурапараметров.Вставить("ИмяОбластиТаблПоля", ИмяОбластиТаблПоля);
				СтруктураПараметров.Вставить("ВидПечати",          ВидПечати);

				ВывестиНаПечатьЛист(СтруктураПараметров);
			КонецЦикла;

			Продолжить;

		КонецЕсли;

		Если Пометка = 0 Тогда
			Продолжить;
		КонецЕсли;

		СтруктураПараметров.Очистить();
		СтруктураПараметров.Вставить("НаименованиеЛиста",  НаименованиеЛиста);
		СтруктураПараметров.Вставить("ОриентацияЛиста",    ОриентацияЛиста);
		СтруктураПараметров.Вставить("ИмяТабличногоПоля",  ИмяТабличногоПоля);
		Структурапараметров.Вставить("ИмяОбластиТаблПоля", ИмяОбластиТаблПоля);
		СтруктураПараметров.Вставить("ВидПечати",          ВидПечати);

		ВывестиНаПечатьЛист(СтруктураПараметров);
		
	КонецЦикла;

	// обновляем исходное дерево значений 
	мДеревоСтраницОтчета = мДеревоВыбранныхСтраниц.Скопировать();
	РегламентированнаяОтчетность.ПроставитьНомераЛистов(ЭтаФорма, ВидПечати, Ложь);

КонецПроцедуры // Печать()

// Функция определяет поле табличного документа формы, содержащее 
// многострочный раздел.по имени ИдГруппы.
//
// Параметры:
//  ИдГруппы - строка, имя многострочного раздела.
//
// Возвращаемое значение:
//  Поле табличного документа.
//  актуально только для отчетов, содержащих многострочные разделы
//  похоже а ее унифицированность
//вернуться с многострочніми разделами - приложения К1/2
Функция ОпределитьТабличноеПолеПоИдМногострочногоРаздела(ИдГруппы)
	
	Перем ТекТабличноеПоле;

	Если (ИдГруппы = мИдГруппы1А) Или (ИдГруппы = мИдГруппы1Б)  Тогда
		ТекТабличноеПоле = мТаблица1;
	ИначеЕсли (ИдГруппы =мИдГруппы5) Тогда 
		ТекТабличноеПоле = мТаблица5;
	ИначеЕсли (ИдГруппы =мИдГруппы6) Тогда 
		ТекТабличноеПоле = мТаблица6;
	ИначеЕсли (ИдГруппы =мИдГруппы7) Тогда 
		ТекТабличноеПоле = мТаблица7;
	ИначеЕсли (ИдГруппы =мИдГруппы8) Тогда 
		ТекТабличноеПоле = мТаблица8;
	КонецЕсли;

	Возврат ТекТабличноеПоле;
	
КонецФункции // ОпределитьТабличноеПолеПоИдМногострочногоРаздела()

// Функция определяет многострочный раздел табличного документа
// на активной странице основной панели формы.
//
// Параметры:
//  Нет;
//
// Возвращаемое значение:
//  строка, имя многострочного раздела.
// актуально только для отчетов, содержащих многострочные разделы
//  похоже а ее унифицированность
Функция ОпределитьИдМногострочногоРазделаПоАктивнойСтранице()
	Перем ИмяГруппы;
	
	ТекущаяСтраницаПанели    = ЭлементыФормы.ОсновнаяПанель.ТекущаяСтраница;
	ИмяТекущейСтраницыПанели = ТекущаяСтраницаПанели.Имя;
	ТекущаяОбласть  = ЭлементыФормы["ПолеТабличногоДокумента" + ИмяТекущейСтраницыПанели].ТекущаяОбласть;
	ИмяПоказателя   = ТекущаяОбласть.Имя;
	
	Если ИмяТекущейСтраницыПанели = "Таблица1" Тогда
		
		Если Сред (ИмяПоказателя,1,3) = "Т1А" Тогда
			ИмяГруппы = мИдГруппы1А;
		ИначеЕсли Сред (ИмяПоказателя,1,3) = "Т1Б" Тогда
			ИмяГруппы = мИдГруппы1Б;
		КонецЕсли;
		
	ИначеЕсли ИмяТекущейСтраницыПанели = "Таблица5" Тогда
			ИмяГруппы = мИдГруппы5;
	ИначеЕсли ИмяТекущейСтраницыПанели = "Таблица6" Тогда
			ИмяГруппы = мИдГруппы6;
	ИначеЕсли ИмяТекущейСтраницыПанели = "Таблица7" Тогда
			ИмяГруппы = мИдГруппы7;
	ИначеЕсли ИмяТекущейСтраницыПанели = "Таблица8" Тогда
			ИмяГруппы = мИдГруппы8;
	КонецЕсли;
		
	Возврат ИмяГруппы;
	
КонецФункции // ОпределитьИдМногострочногоРазделаПоАктивнойСтранице()

// Процедура управляет выводом всех страниц многостраничного раздела на печать.
//
// Параметры:
//   СтруктураПараметровСтраницы - структура, содержащая параметры печаты отчета:
//
//      - имя страницы основной панели формы (многостраничного раздела);
//      - имя выводимого на печать листа;
//      - ориентация страницы;
//      - имя табличного документа, который выводится на печать;
//      - имя области табличного документа, выводимой на печать (содержит не пустое значение,
//        когда выводится на печать не весь табличный документ, а часть его);
//      - строка, задающая способ печати.Принимает значения:
//           "ПечататьСразу" - непосредственный вывод на печать;
//           "ПечататьБланк" - с предварительным просмотром.
//   унифицирована, но актульная для отчетов, их имеющих
// Процедура выводит строки многострочного раздела в табличный документ.
// При отсутствии в табличном документе необходимого количества строк
// добавляет отсутствующие строки.
//
// Параметры:
//  ИмяГруппы       - строка, имя многострочного раздела;
//  СтруктураГруппы - таблица значений, содержащая значения показателей многострочного раздела.
//  похоже унифицирована, используется при  восстановлении сохраненных данных
Процедура ВывестиРазделВТабличныйДокумент(ИмяГруппы, СтруктураГруппы)
	Перем ИсходноеКоличествоСтрокГруппы;

	// определим исходное колво строк многострочного раздела,
	// соответствующее бумажной форме отчета
	мСтруктураИсхКолвоСтрокРазделов.Свойство(ИмяГруппы, ИсходноеКоличествоСтрокГруппы);

	// реальное кол-во строк (колво заполненных строк)
	ТекущееКоличествоСтрокГруппы = СтруктураГруппы.Количество();

	ТекТабличноеПоле = ОпределитьТабличноеПолеПоИдМногострочногоРаздела(ИмяГруппы);

	// При восстановлении сохраненных данных отчета сравниваем исходное кол-во
	// отображаемых в форме строк многострочного раздела с реальным количеством
	// созданных строк в сохраненном отчете.
	Если ТекущееКоличествоСтрокГруппы > ИсходноеКоличествоСтрокГруппы Тогда

		///////////////////////////////////////////////////////
		// получаем описание координат каждой колонки многострочной части (лево, право, высота)
		СтруктураКоординатЯчеек = Новый Структура();
		ВысотаСтроки = 0;
		Для Каждого Колонка Из СтруктураГруппы.Колонки Цикл
			
			ИмяКолонки          = Колонка.Имя;
			
			ИмяОбластиЯчейки    = Сред(ИмяКолонки,1,3) + Формат(1,"ЧЦ=4;ЧВН=0;ЧГ=;") + Сред(ИмяКолонки,4);
			ОбластьЯчейки = ТекТабличноеПоле.Области[ИмяОбластиЯчейки];

			Координаты = Новый Структура();
			// определяем границы ячейки исходной области
			Координаты.Вставить("НомерВерхСтрокиЯчейки",  ОбластьЯчейки.Верх);
			Координаты.Вставить("НомерНижнСтрокиЯчейки",  ОбластьЯчейки.Низ);
			Координаты.Вставить("НомерЛевоКолонкиЯчейки", ОбластьЯчейки.Лево);
			Координаты.Вставить("НомерПравКолонкиЯчейки", ОбластьЯчейки.Право);
		
			СтруктураКоординатЯчеек.Вставить(ИмяКолонки, Координаты);
			
			Если ВысотаСтроки < ОбластьЯчейки.Низ - ОбластьЯчейки.Верх + 1 Тогда
				ВысотаСтроки = ОбластьЯчейки.Низ - ОбластьЯчейки.Верх + 1;
			КонецЕсли;
			
		КонецЦикла;

			
		///////////////////////////////////////////////////////
		// вставляем необходимое количество строк за один раз

		// номера строк исходной области
		НомерВерхЯчейкиОбласти = СтруктураКоординатЯчеек[СтруктураГруппы.Колонки[0].Имя].НомерВерхСтрокиЯчейки;
		НомерНижнЯчейкиОбласти = НомерВерхЯчейкиОбласти + ВысотаСтроки - 1;
		
		ВставляемаяОбласть = ТекТабличноеПоле.Область(НомерВерхЯчейкиОбласти, , НомерНижнЯчейкиОбласти, );
		// добавляем в таблицу новые строки
		ИсходнаяОбласть = ТекТабличноеПоле.Область(НомерВерхЯчейкиОбласти, , НомерНижнЯчейкиОбласти + (ТекущееКоличествоСтрокГруппы - ИсходноеКоличествоСтрокГруппы - 1) * ВысотаСтроки, );	
		ТекТабличноеПоле.ВставитьОбласть(ВставляемаяОбласть,ИсходнаяОбласть,ТипСмещенияТабличногоДокумента.ПоВертикали);
		
		///////////////////////////////////////////////////////
		// переименовываем все ячейки многострочной части сверху вниз
		// при этом удаляем старые имена, если они есть
		Для НомерСтроки = 1 По ТекущееКоличествоСтрокГруппы Цикл

			НомерПроставлен = Ложь;
			// переопределяем имена вставленной области
			Для Каждого Колонка Из СтруктураГруппы.Колонки Цикл

				ИмяКолонки          = Колонка.Имя;
				ИмяОбластиЯчейки    = Сред(ИмяКолонки,1,3) + Формат(НомерСтроки,"ЧЦ=4;ЧВН=0;ЧГ=;") + Сред(ИмяКолонки,4);
				
				Если НомерСтроки <= ИсходноеКоличествоСтрокГруппы Тогда
					// удаляем старые имена (они сдвинуты)
					ТекТабличноеПоле.Области[ИмяОбластиЯчейки].Имя = "";
				КонецЕсли;
				
				// определяем границы ячейки заданной строки и колонки 
				НомерВерхСтрокиЯчейки  = СтруктураКоординатЯчеек[ИмяКолонки].НомерВерхСтрокиЯчейки + ВысотаСтроки * (НомерСтроки - 1);
				НомерНижнСтрокиЯчейки  = СтруктураКоординатЯчеек[ИмяКолонки].НомерНижнСтрокиЯчейки + ВысотаСтроки * (НомерСтроки - 1);
				НомерЛевоКолонкиЯчейки = СтруктураКоординатЯчеек[ИмяКолонки].НомерЛевоКолонкиЯчейки;
				НомерПравКолонкиЯчейки = СтруктураКоординатЯчеек[ИмяКолонки].НомерПравКолонкиЯчейки;

				// Назначаем имя ячейки области,
				ОбластьЯчейки = ТекТабличноеПоле.Область(НомерВерхСтрокиЯчейки, НомерЛевоКолонкиЯчейки, НомерНижнСтрокиЯчейки, НомерПравКолонкиЯчейки);
                ОбластьЯчейки.Имя = ИмяОбластиЯчейки; 
				
				// очищаем значения ячеек 
				Если ОбластьЯчейки.СодержитЗначение Тогда
					ОбластьЯчейки.Очистить();
					// вставляем номер
					Если  НЕ НомерПроставлен 
						И НЕ (ИмяГруппы = мИдГруппы1А) 
				 	    И НЕ (ИмяГруппы = мИдГруппы1Б)Тогда
						ОбластьТекстовыйНомер = ТекТабличноеПоле.Область(ОбластьЯчейки.Верх,1,ОбластьЯчейки.Верх + 1, 2 );
						ОбластьТекстовыйНомер.Текст = Строка(НомерСтроки);
						НомерПроставлен = Истина;
					КонецЕсли;
					
				Иначе
					ОбластьЯчейки.Текст  = Строка(НомерСтроки);
				КонецЕсли;
				
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
	
	// выводим значения строк
	Для Каждого СтрокаТаблицы Из СтруктураГруппы Цикл
		Для Каждого КолонкаТаблицы Из СтруктураГруппы.Колонки Цикл
            ИмяКолонки          = КолонкаТаблицы.Имя;

			НомерСтрокиВТаблице      = СтруктураГруппы.Индекс(СтрокаТаблицы);
			НомерСтрокиВФормеТаблицы = НомерСтрокиВТаблице + 1;

			ИмяЯчейки = Сред(ИмяКолонки,1,3) + Формат(НомерСтрокиВФормеТаблицы,"ЧЦ=4;ЧВН=0;ЧГ=;") +  Сред(ИмяКолонки,4);
					
			ОбластьЯчейкиТаблицы     = ТекТабличноеПоле.Области[ИмяЯчейки];
			ЗначениеЯчейки           = СтрокаТаблицы[КолонкаТаблицы.Имя];

			Если ОбластьЯчейкиТаблицы.СодержитЗначение Тогда
				// задаем значение ячейки
				ОбластьЯчейкиТаблицы.Значение = ЗначениеЯчейки;

			Иначе
				// устанавливаем порядковый номер строки
				ОбластьЯчейкиТаблицы.Текст    = ЗначениеЯчейки;

			КонецЕсли;

		КонецЦикла;
	КонецЦикла;

КонецПроцедуры // ВывестиРазделВТабличныйДокумент()

// Формирует структуру данных отчета и помещает в реквизит типа ХранилищеЗначения
// документа РегламентированныйОтчет.
// 
// При первом сохранении данных отчета создает новый документ этого вида.
// Структура данных отчета состоит из элементов:
//   - значения редактируемых реквизитов отчета;
//   - данные по многострочным разделам отчета;
//   - данные по  многостраничным разделам отчета;
//   - данные по вариантам заполнения реквизитов,
//     участвующих в автозаполнении.
//
Функция Сохранить() Экспорт
	
	Если НЕ РегламентированнаяОтчетность.ПриЗаписиРегламентированногоОтчета(ЭтаФорма) Тогда
		Возврат Ложь;
	КонецЕсли;

	Если (мСохраненныйДок = Неопределено) ИЛИ (мСкопированаФорма <> Неопределено) Тогда
		// Отчет новый или был скопирован.

		Если мСохраненныйДок = Неопределено Тогда
			// создаем новый документ вида РегламентированныйОтчет
			мСохраненныйДок  = Документы.РегламентированныйОтчет.СоздатьДокумент();
		КонецЕсли;

		мСохраненныйДок.Дата = мДатаКонцаПериодаОтчета;
		мСохраненныйДок.УстановитьВремя();
		мСохраненныйДок.УстановитьНовыйНомер();

	КонецЕсли;

	// установим текущие значения реквизитов документа
	мСохраненныйДок.ИсточникОтчета             = ЭтотОбъект.Метаданные().Имя;
	мСохраненныйДок.НаименованиеОтчета         = ЭтотОбъект.Метаданные().Формы.ОсновнаяФорма.Представление();
	мСохраненныйДок.ДатаНачала                 = мДатаНачалаПериодаОтчета;
	мСохраненныйДок.ДатаОкончания              = мДатаКонцаПериодаОтчета;
	мСохраненныйДок.ВыбраннаяФорма             = мВыбраннаяФорма;
	мСохраненныйДок.Организация                = Организация;
	мСохраненныйДок.ДатаПодписи                = ДатаПодписи;
	мСохраненныйДок.ЕдиницаИзмерения           = ЕдиницаИзмерения;
	мСохраненныйДок.ТочностьЕдиницыИзмерения   = ТочностьЕдиницыИзмерения;
	мСохраненныйДок.Периодичность			   = Периодичность;
	мСохраненныйДок.ВидОтчетности              = Перечисления.ВидыОтчетности.РегламентированнаяОтчетность;
	мСохраненныйДок.Комментарий                = Комментарий;
	
	// обновляем структуру многострочных разделов
	ОбновитьСтруктуруМногострочныхРазделов();

	// формируем данные редактируемых ячеек таблицы
	ПоказателиОтчета = Новый Структура();
	
	Для каждого СтраницаПанели из ЭлементыФормы.ОсновнаяПанель.Страницы Цикл

		Если СтраницаПанели.Имя = "ВидыРасчетов" Тогда
			Продолжить;
		КонецЕсли;
		
		ИмяТекТабличногоПоля    = "ПолеТабличногоДокумента" + СтраницаПанели.Имя;
		ТекТабличноеПоле        = ЭлементыФормы[ИмяТекТабличногоПоля];

		ПоказателиТекущегоЛиста = СобратьДанныеТекущегоТаблПоля(ТекТабличноеПоле);
		ПоказателиОтчета.Вставить(ИмяТекТабличногоПоля, ПоказателиТекущегоЛиста);

	КонецЦикла;

	// формируем список сохранения
	СписокСохранения = Новый Структура();

	// вставляем данные редактируемых ячеек таблицы	
	СписокСохранения.Вставить("ПоказателиОтчета", ПоказателиОтчета);

	// вставляем данные многострочных разделов
	СписокСохранения.Вставить("ДанныеМногострочныхРазделов", мСтруктураМногострочныхРазделов);

	// вставляем данные вариантов автозаполнения ячеек
	СписокСохранения.Вставить("ДанныеВариантовАвтоЗаполнения", мСтруктураВариантыЗаполнения);

	// вствляем версию формы
	СписокСохранения.Вставить("ВерсияФормы", мВерсияФормы);
	
	Если РегламентированнаяОтчетность.ИДКонфигурации() = "БП" Тогда
		СписокСохранения.Вставить("ТаблицаВРБольничные", ТаблицаВРБольничные);
		СписокСохранения.Вставить("ТаблицаВРОтпускные", ТаблицаВРОтпускные);
		СохранитьЗначение("РегламентированнаяОтчетность_ТаблицаВРБольничные", ТаблицаВРБольничные.ВыгрузитьКолонку("ВидРасчета"));	
		СохранитьЗначение("РегламентированнаяОтчетность_ТаблицаВРОтпускные", ТаблицаВРОтпускные.ВыгрузитьКолонку("ВидРасчета"));	
		
		мСоостветствиеБольничныеЗаСчетПредприятия = Новый Соответствие();
		Для каждого Стр Из ТаблицаВРБольничные  Цикл
			мСоостветствиеБольничныеЗаСчетПредприятия.Вставить(Стр.ВидРасчета, Стр.ЗаСчетПредприятия);	
		КонецЦикла;
		СохранитьЗначение("РегламентированнаяОтчетность_СоостветствиеБольничныеЗаСчетПредприятия", мСоостветствиеБольничныеЗаСчетПредприятия);	
	КонецЕсли;

	// Сохраняем выбранные листы для печати в хранилище
	ХранилищеДанных = Новый ХранилищеЗначения(мДеревоСтраницОтчета);
	мСохраненныйДок.ДеревоНастройкиСтраниц = ХранилищеДанных;
	
	ХранилищеДанных = Новый ХранилищеЗначения(СписокСохранения);
	мСохраненныйДок.ДанныеОтчета = ХранилищеДанных;

	// записываем документ, хранящий данные отчета
	мСохраненныйДок.Записать();
	
	РегламентированнаяОтчетность.ПослеЗаписиРегламентированногоОтчета(ЭтаФорма);
	СохранитьДеревоСтраницОтчета();
	
	СохранитьЗначение("РегламентированнаяОтчетность_ПенсионныйФонд_ИсхНомер", мПереченьТаблиц.Области.ИсхНомер.Значение);	
	
	Модифицированность = Ложь;

	Возврат Истина;
	
КонецФункции // Сохранить()

// Восстанавливает сохраненные данные отчета.
//
Процедура ВосстановитьСохраненныеДанные()
	Перем ДанныеМногострочныхРазделов;
	Перем ДанныеВариановАвтоЗаполнения;
	Перем ПоказателиОтчета;
	Перем ВерсияФормы;

	// восстанавливаем реквизиты отчета
	Организация              = мСохраненныйДок.Организация;
	ДатаПодписи              = мСохраненныйДок.ДатаПодписи;
	ЕдиницаИзмерения         = мСохраненныйДок.ЕдиницаИзмерения;
	ТочностьЕдиницыИзмерения = мСохраненныйДок.ТочностьЕдиницыИзмерения;
    ЭлементыФормы.НадписьНазваниеОрганизации.Заголовок = Организация.Наименование;
	Комментарий              = мСохраненныйДок.Комментарий;
	// восстанавливаем сохраненные данные отчета
	СписокСохранения = мСохраненныйДок.ДанныеОтчета.Получить();

	// восстанавливаем сохраненные данные вариантов автозаполнения ячеек
	Если СписокСохранения.Свойство("ДанныеВариантовАвтоЗаполнения", ДанныеВариановАвтоЗаполнения) Тогда
		мСтруктураВариантыЗаполнения = ДанныеВариановАвтоЗаполнения;
	КонецЕсли;
	
	// список листов, выводимых на печать
	ДеревоНастройкиСтраниц = мСохраненныйДок.ДеревоНастройкиСтраниц.Получить();
	мДеревоСтраницОтчета   = ДеревоНастройкиСтраниц.Скопировать();

	// восстанавливаем версию формы
	Если СписокСохранения.Свойство("ВерсияФормы", ВерсияФормы) Тогда
		Если ВерсияФормы <> мВерсияФормы Тогда
			// Версия формы изменилась.
			// Обновляем пользовательские настройки.
			ОбновитьПользовательскиеНастройки(СписокСохранения);
		КонецЕсли;
	КонецЕсли;
	
	Если СписокСохранения.Свойство( "ДанныеМногострочныхРазделов", ДанныеМногострочныхРазделов) Тогда
		мСтруктураМногострочныхРазделов = ДанныеМногострочныхРазделов;

		Для Каждого ЭлементСтруктуры Из мСтруктураМногострочныхРазделов Цикл
			ИмяГруппы       = ЭлементСтруктуры.Ключ;
			СтруктураГруппы = ЭлементСтруктуры.Значение;

			ВывестиРазделВТабличныйДокумент(ИмяГруппы, СтруктураГруппы);
		КонецЦикла;
	КонецЕсли;


	// восстановим сохраненные данные редактируемых ячеек
	СписокСохранения.Свойство( "ПоказателиОтчета", ПоказателиОтчета );

	Для Каждого ПоказателиСтраницы Из ПоказателиОтчета Цикл
		ИмяТекТабличноеПоле = ПоказателиСтраницы.Ключ;
		ТекТабличноеПоле    = ЭлементыФормы[ИмяТекТабличноеПоле];
		ПоказателиТаблПоле  = ПоказателиСтраницы.Значение;

		Для Каждого Показатель Из ПоказателиТаблПоле Цикл
			ИмяПоказателя       = Показатель.Ключ;
			ЗначениеПоказателя  = Показатель.Значение;

			// установим значение в таблице
			Попытка
				ТекТабличноеПоле.Области[ИмяПоказателя].Значение = ЗначениеПоказателя;
			Исключение
			КонецПопытки;
		КонецЦикла;
	КонецЦикла;
	
	Если РегламентированнаяОтчетность.ИДКонфигурации() = "БП" Тогда
		// только для бухгалтерии
		мТаблицаВРБольничные = Неопределено;
		СписокСохранения.Свойство("ТаблицаВРБольничные", мТаблицаВРБольничные);
		
		Если мТаблицаВРБольничные = Неопределено Тогда
			// попробуем поднять значение общее для регл. отчетности
			мТаблицаВРБольничные = ВосстановитьЗначение("РегламентированнаяОтчетность_ТаблицаВРБольничные");	
		     
			Если НЕ мТаблицаВРБольничные = Неопределено Тогда
				// построим таблицу из двух общих параметров
				// один - массив видов расчетов (общий для персонификации и отчета)
				// второй - соответствие - кто из видов расчетов является оплатой первых пяти дней (за счет предприятия)
				мСоостветствиеБольничныеЗаСчетПредприятия = ВосстановитьЗначение("РегламентированнаяОтчетность_СоостветствиеБольничныеЗаСчетПредприятия");	
				Если мСоостветствиеБольничныеЗаСчетПредприятия = Неопределено Тогда
					мСоостветствиеБольничныеЗаСчетПредприятия = Новый Соответствие();
				КонецЕсли;
				
				ТаблицаВРБольничные.Очистить();
				Для каждого ВР Из мТаблицаВРБольничные Цикл
					СтрокаВР = ТаблицаВРБольничные.Добавить();
					СтрокаВР.ВидРасчета = ВР;
					Если мСоостветствиеБольничныеЗаСчетПредприятия[ВР] = Истина Тогда
						СтрокаВР.ЗаСчетПредприятия = Истина;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			
		Иначе
			// сохранена таблица значений
			ТаблицаВРБольничные.Очистить();
			Для каждого Стр Из мТаблицаВРБольничные Цикл
				СтрокаВР = ТаблицаВРБольничные.Добавить();
				СтрокаВР.ВидРасчета 		= Стр.ВидРасчета;
				СтрокаВР.ЗаСчетПредприятия  = Стр.ЗаСчетПредприятия;
			КонецЦикла;
		КонецЕсли;
		
		мТаблицаВРОтпускные = Неопределено;
		СписокСохранения.Свойство("ТаблицаВРОтпускные", мТаблицаВРОтпускные);
		
		Если мТаблицаВРОтпускные = Неопределено Тогда
			// попробуем поднять значение общее для регл. отчетности
			мТаблицаВРОтпускные = ВосстановитьЗначение("РегламентированнаяОтчетность_ТаблицаВРОтпускные");	
		     
			Если НЕ мТаблицаВРОтпускные = Неопределено Тогда
				ТаблицаВРОтпускные.Очистить();
				Для каждого ВР Из мТаблицаВРОтпускные Цикл
					СтрокаВР = ТаблицаВРОтпускные.Добавить();
					СтрокаВР.ВидРасчета = ВР;
				КонецЦикла;
			КонецЕсли;
			
		Иначе
			// сохранена таблица значений
			ТаблицаВРОтпускные.Очистить();
			Для каждого Стр Из мТаблицаВРОтпускные Цикл
				СтрокаВР = ТаблицаВРОтпускные.Добавить();
				СтрокаВР.ВидРасчета 		= Стр.ВидРасчета;
			КонецЦикла;
		КонецЕсли;
		
	КонецЕсли;

	УстановитьФорматВывода();
	Расчет();
	
	// Управляем видимостью страниц основной панели формы
	мДеревоВыбранныхСтраниц = мДеревоСтраницОтчета.Скопировать();
	ПоказатьСтраницыОтчета();
	
КонецПроцедуры // ВосстановитьСохраненныеДанные()

// Создает новую строку многострочного раздела.
//
Процедура ВставитьДополнительнуюСтроку(ИмяГруппы = Неопределено)
	Перем СтруктураГруппы;
	
	Если ИмяГруппы = Неопределено Тогда
		ИмяГруппы = ОпределитьИдМногострочногоРазделаПоАктивнойСтранице();
	КонецЕсли;
	
	Если ИмяГруппы = Неопределено Тогда 
		Сообщить(НСтр("ru='Установите курсор на строке многострочной части. Сейчас вы выбрали не верную строку!';uk='встановіть курсор на строку багатостроковї частини! Зараз ві обрали не вірну строку!'"), СтатусСообщения.Внимание);
		Возврат;
    КонецЕсли; 
	ТекТабличноеПоле = ОпределитьТабличноеПолеПоИдМногострочногоРаздела(ИмяГруппы);
	мСтруктураМногострочныхРазделов.Свойство(ИмяГруппы, СтруктураГруппы);

	// определяем последнюю строку многострочной группы
	КолСтрок = СтруктураГруппы.Количество();
	
	СдвигСтрок = 0;
	НомерВерхЯчейкиОбласти = 999999999;
	НомерНижнЯчейкиОбласти = 0;
	Для Каждого Колонка Из СтруктураГруппы.Колонки Цикл
		
		ИмяКолонки          = Колонка.Имя;
		
		ИмяОбластиЯчейки    = Сред(ИмяКолонки,1,3) + Формат(КолСтрок,"ЧЦ=4;ЧВН=0;ЧГ=;") + Сред(ИмяКолонки,4);
		ОбластьЯчейки = ТекТабличноеПоле.Области[ИмяОбластиЯчейки];

		Координаты = Новый Структура();
		// определяем границы ячейки исходной области
		Если НомерВерхЯчейкиОбласти > ОбластьЯчейки.Верх тогда
			НомерВерхЯчейкиОбласти = ОбластьЯчейки.Верх;
		КонецЕсли;
		
		Если НомерНижнЯчейкиОбласти < ОбластьЯчейки.Низ тогда
			НомерНижнЯчейкиОбласти = ОбластьЯчейки.Низ;
		КонецЕсли;
		
		Если СдвигСтрок < ОбластьЯчейки.Низ - ОбластьЯчейки.Верх + 1 Тогда
			СдвигСтрок = ОбластьЯчейки.Низ - ОбластьЯчейки.Верх + 1;
		КонецЕсли;
		
	КонецЦикла;
    	
	// номера строк вставляемой области
	НомерВерхЯчейкиНовойОбласти = НомерВерхЯчейкиОбласти + СдвигСтрок;
	НомерНижнЯчейкиНовойОбласти = НомерНижнЯчейкиОбласти + СдвигСтрок;

	// определяем вставляемую область
	ВставляемаяОбласть = ТекТабличноеПоле.Область(НомерВерхЯчейкиОбласти, , НомерНижнЯчейкиОбласти, );

	// добавляем в таблицу новую строку
	ТекТабличноеПоле.ВставитьОбласть( ВставляемаяОбласть,,ТипСмещенияТабличногоДокумента.ПоВертикали );
    КолСтрокНов = КолСтрок + 1;
	// переопределяем имена вставленной области
	ВерхОбластиНомера = 999999999;
	НизОбластиНомера  = 0;
	Для Каждого Колонка Из СтруктураГруппы.Колонки Цикл                    
		ИмяКолонки          = Колонка.Имя;
		
		//Если ...
		ИмяОбластиЯчейки    = Сред(ИмяКолонки,1,3) + Формат(КолСтрок,   "ЧЦ=4;ЧВН=0;ЧГ=;") + Сред(ИмяКолонки,4);
		ИмяНовОбластиЯчейки = Сред(ИмяКолонки,1,3) + Формат(КолСтрокНов,"ЧЦ=4;ЧВН=0;ЧГ=;") + Сред(ИмяКолонки,4);
		//КонецЕсли;
		
		ОбластьЯчейки = ТекТабличноеПоле.Области[ИмяОбластиЯчейки];
		ОбластьЯчейки.Имя = ИмяНовОбластиЯчейки;
		
		// определяем границы ячейки исходной области
		НомерВерхСтрокиЯчейки  = ОбластьЯчейки.Верх - СдвигСтрок;
		НомерНижнСтрокиЯчейки  = ОбластьЯчейки.Низ  - СдвигСтрок;
		НомерЛевоКолонкиЯчейки = ОбластьЯчейки.Лево;
		НомерПравКолонкиЯчейки = ОбластьЯчейки.Право;
		
		Если ВерхОбластиНомера > НомерВерхСтрокиЯчейки + СдвигСтрок Тогда
			ВерхОбластиНомера = НомерВерхСтрокиЯчейки  + СдвигСтрок ;
		КонецЕсли;
		
		Если НизОбластиНомера < НомерНижнСтрокиЯчейки + СдвигСтрок Тогда
			НизОбластиНомера = НомерНижнСтрокиЯчейки  + СдвигСтрок ;
		КонецЕсли;
		
		// Назначаем имя ячейки исходной области,
		// (т.к. в результате вставки новой области оно было очищено)
		ОбластьЯчейкиИсходнойОбласти = ТекТабличноеПоле.Область(НомерВерхСтрокиЯчейки, НомерЛевоКолонкиЯчейки, НомерНижнСтрокиЯчейки, НомерПравКолонкиЯчейки);
		ОбластьЯчейкиИсходнойОбласти.Имя = ИмяОбластиЯчейки;
		
		// очищаем значения ячеек вставленной области
		Если (ОбластьЯчейки.СодержитЗначение)  Тогда
			ОбластьЯчейки.Очистить();
			ОбластьЯчейки.Примечание.Текст = "";
		КонецЕсли;
		
	КонецЦикла;
	
	Если  НЕ (ИмяГруппы = мИдГруппы1А) 
	    И НЕ (ИмяГруппы = мИдГруппы1Б) Тогда 
		ОбластьТекстовыйНомер = ТекТабличноеПоле.Область(ВерхОбластиНомера,1,НизОбластиНомера, 2);
		ОбластьТекстовыйНомер.Текст = Строка(КолСтрок + 1);
	КонецЕсли;
	
	ИмяТекущейОбласти = Сред (СтруктураГруппы.Колонки[0].Имя,1,3) + Формат(КолСтрокНов,"ЧЦ=4;ЧВН=0;ЧГ=;") + Сред (СтруктураГруппы.Колонки[0].Имя,4);
	
	ТекТабличноеПоле.ТекущаяОбласть = ТекТабличноеПоле.Области[ИмяТекущейОбласти];

	// установим фокус на поле табличн. документа
	ТекущийЭлемент = ТекТабличноеПоле;

	// добавляем в структуру многострочной группы новую строку
	СтруктураГруппы.Добавить();

	Расчет();
	
	Модифицированность = Истина;

КонецПроцедуры // ВставитьДополнительнуюСтроку()

// Удаляет строку многострочного раздела формы.
//
Процедура УдалитьДополнительнуюСтроку()
	Перем ИсходноеКоличествоСтрокГруппы;
	Перем СтруктураГруппы;

	// Сначала выполним проверку на активную страницу панели формы,
	// которая содержит многострочный раздел
	ИмяГруппы = ОпределитьИдМногострочногоРазделаПоАктивнойСтранице();
	Если ИмяГруппы = Неопределено Тогда
		Сообщить(НСтр("ru='Не выбрана удаляемая строка многострочного раздела.';uk='Не обрано строку багаторядкового розділу, що видаляється'"), СтатусСообщения.Внимание);
		Возврат;
	КонецЕсли;

	// исходное количество строк группы
	мСтруктураИсхКолвоСтрокРазделов.Свойство(ИмяГруппы, ИсходноеКоличествоСтрокГруппы);

	ТекТабличноеПоле = ОпределитьТабличноеПолеПоИдМногострочногоРаздела(ИмяГруппы);
	мСтруктураМногострочныхРазделов.Свойство(ИмяГруппы, СтруктураГруппы);

	// Выполним также проверку вхождения текущей (выделенной) ячейки в многострочный раздел
	ТекущаяОбласть = ТекТабличноеПоле.ТекущаяОбласть;
	ИмяЯчейки      = ТекущаяОбласть.Имя;
	
	Если ИмяГруппы = Неопределено Тогда
		Сообщить(НСтр("ru='Не выбрана удаляемая строка многострочного раздела.';uk='Не обрано строку багаторядкового розділу, що видаляється'"), СтатусСообщения.Внимание);
		Возврат;
	КонецЕсли;

		Попытка
				НомУдаляемойСтроки = Число(Сред(ИмяЯчейки,4,4));
				КоличествоСтрокПослеУдаления = СтруктураГруппы.Количество() -1;
				Ответ = Вопрос(НСтр("ru='Удалить выбранную строку?"
				"(Внимание! данная операция необратима)';uk='Видалити обраний рядок?"
				"(Увага! дана операція необоротна)'"), РежимДиалогаВопрос.ДаНетОтмена, 60, КодВозвратаДиалога.Да);

  				Если Ответ <> КодВозвратаДиалога.Да Тогда
					Возврат;
				КонецЕсли;

		Исключение
			Ответ = Вопрос(НСтр("ru='Удалить последнюю строку?"
								"(Внимание! данная операция необратима)';uk='Видалити останній рядок?"
								"(Увага! дана операція необоротна)'"), РежимДиалогаВопрос.ДаНетОтмена, 60, КодВозвратаДиалога.Да);

				Если Ответ <> КодВозвратаДиалога.Да Тогда
					Возврат;
				КонецЕсли;
			НомУдаляемойСтроки = СтруктураГруппы.Количество();
		КонецПопытки;
 
	// предварительно обновим структуру многострочных разделов
	ОбновитьСтруктуруМногострочныхРазделов();

	// номер строки многострочного раздела определим
	// по имени выделенной ячейки
	НомерСтрокиТаблицы = НомУдаляемойСтроки - 1; // нумерация строк в таблице значений начинается с нуля

	Если СтруктураГруппы.Количество() > ИсходноеКоличествоСтрокГруппы Тогда
		
		// номера строк удаляемой области
		НомерВерхЯчейкиОбласти = 999999999;
		НомерНижнЯчейкиОбласти = 0;
		Для Каждого Колонка Из СтруктураГруппы.Колонки Цикл
			
			ИмяКолонки          = Колонка.Имя;
			
			ИмяОбластиЯчейки    = Сред(ИмяКолонки,1,3) + Формат(НомУдаляемойСтроки,"ЧЦ=4;ЧВН=0;ЧГ=;") + Сред(ИмяКолонки,4);
			ОбластьЯчейки = ТекТабличноеПоле.Области[ИмяОбластиЯчейки];

			Координаты = Новый Структура();
			// определяем границы ячейки исходной области
			Если НомерВерхЯчейкиОбласти > ОбластьЯчейки.Верх тогда
				НомерВерхЯчейкиОбласти = ОбластьЯчейки.Верх;
			КонецЕсли;
			
			Если НомерНижнЯчейкиОбласти < ОбластьЯчейки.Низ тогда
				НомерНижнЯчейкиОбласти = ОбластьЯчейки.Низ;
			КонецЕсли;
			
		КонецЦикла;		
		
		// Определим область удаляемой строки
		УдаляемаяОбласть = ТекТабличноеПоле.Область(НомерВерхЯчейкиОбласти, , НомерНижнЯчейкиОбласти, );

		// непосредственно удаляем область строки табличного документа
		ТекТабличноеПоле.УдалитьОбласть( УдаляемаяОбласть,ТипСмещенияТабличногоДокумента.ПоВертикали );

		КолвоСдвигаемыхСтрок = СтруктураГруппы.Количество() - НомУдаляемойСтроки;

		// обновим имена ячеек сдвинутых строк
		Если КолвоСдвигаемыхСтрок > 0 Тогда    
			Для НСтр = НомУдаляемойСтроки + 1 По СтруктураГруппы.Количество() Цикл
              	ТекСтрока = СтруктураГруппы[НСтр-1];
                НСтрНов = НСтр - 1;
				ВерхОбластиНомера = 999999999;
				НизОбластиНомера  = 0;
				Для Каждого Колонка Из СтруктураГруппы.Колонки Цикл
					
					ИмяСдвинутойЯчейки      = Сред(Колонка.Имя,1,3) + Формат(НСтр,"ЧЦ=4;ЧВН=0;ЧГ=;") + Сред(Колонка.Имя,4);
					НовоеИмяСдвинутойЯчейки = Сред(Колонка.Имя,1,3) + Формат(НСтрНов,"ЧЦ=4;ЧВН=0;ЧГ=;") + Сред(Колонка.Имя,4);

					ОбластьСдвинутойЯчейки     = ТекТабличноеПоле.Области[ИмяСдвинутойЯчейки];
					ОбластьСдвинутойЯчейки.Имя = НовоеИмяСдвинутойЯчейки;
					
					Если ВерхОбластиНомера > ОбластьСдвинутойЯчейки.Верх Тогда
						ВерхОбластиНомера = ОбластьСдвинутойЯчейки.Верх;
					КонецЕсли;
					
					Если НизОбластиНомера < ОбластьСдвинутойЯчейки.Низ Тогда
						НизОбластиНомера = ОбластьСдвинутойЯчейки.Низ;
					КонецЕсли;
					
				КонецЦикла;
				
				Если  НЕ (ИмяГруппы = мИдГруппы1А) 
				 	И НЕ (ИмяГруппы = мИдГруппы1Б) Тогда 
						ОбластьТекстовыйНомер = ТекТабличноеПоле.Область(ВерхОбластиНомера,1,НизОбластиНомера, 2);
						ОбластьТекстовыйНомер.Текст = Строка(НСтрНов);
			    КонецЕсли;
					
	          КонецЦикла;

		КонецЕсли;

		// обновляем структуру многострочного раздела
		СтруктураГруппы.Удалить(НомерСтрокиТаблицы);

	Иначе
		// строка не удаляется в форме табличного документа,
		// а должна осуществляться сдвиг строк

		// обновляем структуру многострочного раздела
		// методом удаления выбранной строки и добавления пустой строки
		СтруктураГруппы.Удалить(НомерСтрокиТаблицы);

		ДобавляемаяСтрока = СтруктураГруппы.Добавить();

		// обновляем порядковые номера строк, выводимых в табличный документ
		Для Каждого СтрокаТаблицы Из СтруктураГруппы Цикл
			Для Каждого КолонкаТаблицы Из СтруктураГруппы.Колонки Цикл

				НомерСтрокиВТаблице      = СтруктураГруппы.Индекс(СтрокаТаблицы);
				НомерСтрокиВФормеТаблицы = НомерСтрокиВТаблице + 1;
					
				//Если (ТекТабличноеПоле = мПриложение1) Тогда
					ИмяЯчейки    = Сред(КолонкаТаблицы.Имя,1,3) + Формат(НомерСтрокиВФормеТаблицы,"ЧЦ=4;ЧВН=0;ЧГ=;") + Сред(КолонкаТаблицы.Имя,4);
				//КонецЕсли;
				
				ОбластьЯчейкиТаблицы     = ТекТабличноеПоле.Области[ИмяЯчейки];

				Если НЕ(ОбластьЯчейкиТаблицы.СодержитЗначение) Тогда
					ПервыйНомерВГруппе = 1;
					// обновляем порядковый номер строки
					НовыйПорядковыйНомер = Строка(ПервыйНомерВГруппе + НомерСтрокиВТаблице);
					СтрокаТаблицы[КолонкаТаблицы.Имя] = НовыйПорядковыйНомер;
				КонецЕсли;
				
			КонецЦикла;
		КонецЦикла;

		// Обновляем экранную форму табличного документа
		ВывестиРазделВТабличныйДокумент(ИмяГруппы, СтруктураГруппы);

	КонецЕсли;

	// назначим текущей областью таблицы первую редактируемую ячейку
	// удаленной строки, если ее порядковый номер меньше кол-ва строк
	// многострочного раздела, или последней строки раздела в противном случае

	// определяем текущую область таблицы
	НомТекущейСтроки  = Мин( НомУдаляемойСтроки, СтруктураГруппы.Количество() );
	
	ИмяТекущейОбласти    = Сред(СтруктураГруппы.Колонки[0].Имя,1,3) + Формат(НомТекущейСтроки,"ЧЦ=4;ЧВН=0;ЧГ=;") +  Сред(СтруктураГруппы.Колонки[0].Имя,4);
	
	ТекТабличноеПоле.ТекущаяОбласть = ТекТабличноеПоле.Области[ИмяТекущейОбласти];

	// установим фокус на поле табличн. документа
	ТекущийЭлемент = ТекТабличноеПоле;

	Расчет();
	
	Модифицированность = Истина;

КонецПроцедуры // УдалитьДополнительнуюСтроку()	


// Выполняет расчет вычисляемых показателей отчета
// (ячеек, выделенных зеленым цветом).
//
Процедура Расчет()
	Перем СтруктураГруппы1А,СтруктураГруппы1Б;
	Перем СтруктураГруппы5,СтруктураГруппы6,СтруктураГруппы7,СтруктураГруппы8;
	
	мСтруктураМногострочныхРазделов.Свойство(мИдГруппы1А, СтруктураГруппы1А);
	мСтруктураМногострочныхРазделов.Свойство(мИдГруппы1Б, СтруктураГруппы1Б);
	мСтруктураМногострочныхРазделов.Свойство(мИдГруппы5, СтруктураГруппы5);
	мСтруктураМногострочныхРазделов.Свойство(мИдГруппы6, СтруктураГруппы6);
	мСтруктураМногострочныхРазделов.Свойство(мИдГруппы7, СтруктураГруппы7);
	мСтруктураМногострочныхРазделов.Свойство(мИдГруппы8, СтруктураГруппы8);
	
	Если ТаблицаМногострочнойЧастиПуста(СтруктураГруппы5, мИдГруппы5) Тогда
		мПереченьТаблиц.Области.СтраницТаб5.Значение = 0;			
		мПереченьТаблиц.Области.СтрокТаб5.Значение   = 0;			
	Иначе	
		мПереченьТаблиц.Области.СтраницТаб5.Значение = Цел(СтруктураГруппы5.Количество()/15) + ?(СтруктураГруппы5.Количество()%15 = 0, 0, 1);			
		мПереченьТаблиц.Области.СтрокТаб5.Значение = СтруктураГруппы5.Количество();			
	КонецЕсли;
	
	Если ТаблицаМногострочнойЧастиПуста(СтруктураГруппы6, мИдГруппы6) Тогда
		мПереченьТаблиц.Области.СтраницТаб6.Значение = 0;			
		мПереченьТаблиц.Области.СтрокТаб6.Значение   = 0;			
	Иначе	
		мПереченьТаблиц.Области.СтраницТаб6.Значение = Цел(СтруктураГруппы6.Количество()/10) + ?(СтруктураГруппы6.Количество()%10 = 0, 0, 1);			
		мПереченьТаблиц.Области.СтрокТаб6.Значение = СтруктураГруппы6.Количество();			
	КонецЕсли;
	
	Если ТаблицаМногострочнойЧастиПуста(СтруктураГруппы7, мИдГруппы7) Тогда
		мПереченьТаблиц.Области.СтраницТаб7.Значение = 0;			
		мПереченьТаблиц.Области.СтрокТаб7.Значение   = 0;			
	Иначе	
		мПереченьТаблиц.Области.СтраницТаб7.Значение = Цел(СтруктураГруппы7.Количество()/10) + ?(СтруктураГруппы7.Количество()%10 = 0, 0, 1);			
		мПереченьТаблиц.Области.СтрокТаб7.Значение = СтруктураГруппы7.Количество();			
	КонецЕсли;
	
	Если ТаблицаМногострочнойЧастиПуста(СтруктураГруппы8, мИдГруппы8) Тогда
		мПереченьТаблиц.Области.СтраницТаб8.Значение = 0;			
		мПереченьТаблиц.Области.СтрокТаб8.Значение   = 0;			
	Иначе	
		мПереченьТаблиц.Области.СтраницТаб8.Значение = Цел(СтруктураГруппы8.Количество()/10) + ?(СтруктураГруппы8.Количество()%10 = 0, 0, 1);			
		мПереченьТаблиц.Области.СтрокТаб8.Значение = СтруктураГруппы8.Количество();			
	КонецЕсли;	
	
	мПереченьТаблиц.Области.СтраницВсего.Значение =  мПереченьТаблиц.Области.СтраницТаб1.Значение
												  +  мПереченьТаблиц.Области.СтраницТаб2.Значение
												  +  мПереченьТаблиц.Области.СтраницТаб3.Значение
												  +  мПереченьТаблиц.Области.СтраницТаб4.Значение
												  +  мПереченьТаблиц.Области.СтраницТаб5.Значение
												  +  мПереченьТаблиц.Области.СтраницТаб6.Значение
												  +  мПереченьТаблиц.Области.СтраницТаб7.Значение
												  +  мПереченьТаблиц.Области.СтраницТаб8.Значение
												  +  мПереченьТаблиц.Области.СтраницТаб9.Значение
												  +  мПереченьТаблиц.Области.СтраницТаб10.Значение;
												  
	мПереченьТаблиц.Области.СтрокВсего.Значение   =  мПереченьТаблиц.Области.СтрокТаб5.Значение
												  +  мПереченьТаблиц.Области.СтрокТаб6.Значение
												  +  мПереченьТаблиц.Области.СтрокТаб7.Значение
												  +  мПереченьТаблиц.Области.СтрокТаб8.Значение
												  +  мПереченьТаблиц.Области.СтрокТаб9.Значение
												  +  мПереченьТаблиц.Области.СтрокТаб10.Значение;
	
	мТаблица1.Области.П1.Значение = ОкруглитьЧислоПоФормату(мТаблица1.Области.П1_1.Значение) 
	                             + ОкруглитьЧислоПоФормату(мТаблица1.Области.П1_2.Значение);	 
	
	//Фактичні витрати на оплату праці, суми перших п'яти днів тимчасової непрацездатності та суми 
	//допомоги у зв'язку з тимчасовою непрацездатністю та суми доходу, що розподіляється між членами 
	//колективних, орендних підприємств, сільськогосподарських кооперативів, фермерських господарств, 
	//на які нараховуються внески, усього
	мТаблица1.Области.П2.Значение = ОкруглитьЧислоПоФормату(мТаблица1.Области.П2_1.Значение) 
	                             + ОкруглитьЧислоПоФормату(мТаблица1.Области.П2_2.Значение)
	                             + ОкруглитьЧислоПоФормату(мТаблица1.Области.П2_3.Значение);
	                                
	
	мТаблица1.Области.П3.Значение = ОкруглитьЧислоПоФормату(мТаблица1.Области.П3_1.Значение) 
	                               + ОкруглитьЧислоПоФормату(мТаблица1.Области.П3_2.Значение)
								   + ОкруглитьЧислоПоФормату(мТаблица1.Области.П3_3.Значение);
								   
	//Сума, на яку збільшено внески у зв'язку з виправленням помилки у період після 01.01.2004
	мТаблица1.Области.П6.Значение = ОкруглитьЧислоПоФормату(мТаблица1.Области.П6_1.Значение) 
	                             + ОкруглитьЧислоПоФормату(мТаблица1.Области.П6_2.Значение);
	
	//Сума, на яку зменшені внески у зв'язку з виправленням помилки у період після 01.01.2004
	мТаблица1.Области.П7.Значение = ОкруглитьЧислоПоФормату(мТаблица1.Области.П7_1.Значение) 
	                             + ОкруглитьЧислоПоФормату(мТаблица1.Области.П7_2.Значение);
	
	//Загальна сума страхових внесків за розділом 1 (рядки 3 + 5 + 6 - 7)
	//32%, 4%, 42%   (рядки 3 + 6.1 - 7.1)
	мТаблица1.Области.П8_1.Значение = ОкруглитьЧислоПоФормату(мТаблица1.Области.П3.Значение) 
	                               + ОкруглитьЧислоПоФормату(мТаблица1.Области.П6_1.Значение) 
	                               - ОкруглитьЧислоПоФормату(мТаблица1.Области.П7_1.Значение); 
								   
	
	//1-5%    (рядки 5 + 6.2 - 7.2)  
	мТаблица1.Области.П8_2.Значение = ОкруглитьЧислоПоФормату(мТаблица1.Области.П5.Значение) 
	                               + ОкруглитьЧислоПоФормату(мТаблица1.Области.П6_2.Значение) 
	                               - ОкруглитьЧислоПоФормату(мТаблица1.Области.П7_2.Значение); 
	
	мТаблица1.Области.П8.Значение = 	  ОкруглитьЧислоПоФормату(мТаблица1.Области.П3.Значение) 
									+ ОкруглитьЧислоПоФормату(мТаблица1.Области.П5.Значение) 
									+ ОкруглитьЧислоПоФормату(мТаблица1.Области.П6.Значение)
									- ОкруглитьЧислоПоФормату(мТаблица1.Области.П7.Значение); 
	                   
	
	//II Розділ*
    //Розрахунки за внесками (зборами) за період до 01.01.2004
	//Одержаний фонд оплати праці у звітному місяці
	мТаблица1.Области.ПР2_1.Значение  = ОкруглитьЧислоПоФормату(СтруктураГруппы1Б.Итог("Т1БФОП"));
	
	//Належить до сплати, усього 32 %
	мТаблица1.Области.ПР2_2_1.Значение = ОкруглитьЧислоПоФормату(СтруктураГруппы1Б.Итог("Т1БКВыпл32")); 
	
	//Належить до сплати, усього 4 %
	мТаблица1.Области.ПР2_2_2.Значение = ОкруглитьЧислоПоФормату(СтруктураГруппы1Б.Итог("Т1БКВыпл4")); 
	
	//Належить до сплати, усього 42 %
	мТаблица1.Области.ПР2_2_3.Значение = ОкруглитьЧислоПоФормату(СтруктураГруппы1Б.Итог("Т1БКВыпл42")); 

	//Належить до сплати, усього  1 - 5 % 
	мТаблица1.Области.ПР2_2_4.Значение = ОкруглитьЧислоПоФормату(СтруктураГруппы1Б.Итог("Т1БКВыпл15")); 

	//Належить до сплати, усього
	мТаблица1.Области.ПР2_2.Значение  = мТаблица1.Области.ПР2_2_1.Значение 
									 + мТаблица1.Области.ПР2_2_2.Значение 
									 + мТаблица1.Области.ПР2_2_3.Значение 
									 + мТаблица1.Области.ПР2_2_4.Значение;
	
	//Загальна сума внесків (збору) за розділом II (рядки 2 + 3 - 4)
	мТаблица1.Области.ПР2_5.Значение = мТаблица1.Области.ПР2_2.Значение 
									 + мТаблица1.Области.ПР2_3.Значение 
									 - мТаблица1.Области.ПР2_4.Значение;

	Для каждого Строка Из СтруктураГруппы1Б Цикл
		Строка.Т1БКВыпл = ОкруглитьЧислоПоФормату(Строка.Т1БКВыпл32) + ОкруглитьЧислоПоФормату(Строка.Т1БКВыпл4) + ОкруглитьЧислоПоФормату(Строка.Т1БКВыпл42) + ОкруглитьЧислоПоФормату(Строка.Т1БКВыпл15);
		мТаблица1.Области[мИдГруппы1Б + ФОрмат(СтруктураГруппы1Б.Индекс(Строка)+ 1, "ЧЦ=4; ЧДЦ=0; ЧВН=; ЧГ=0") + "Квыпл"].Значение = Строка.Т1БКВыпл;
	КонецЦикла;
	
	//Одержаний фонд оплати праці у звітному місяці за місяці
	мТаблица1.Области.ФОП_Итого.Значение = ОкруглитьЧислоПоФормату(СтруктураГруппы1Б.Итог("Т1БФОП"));
	
	мТаблица1.Области.КВыпл_Итого.Значение = ОкруглитьЧислоПоФормату(СтруктураГруппы1Б.Итог("Т1БКВыпл"));
	
	мТаблица6.Области.СуммаНачисленоВсего.Значение = СтруктураГруппы6.Итог("Т6_СуммаНачислено");
	мТаблица6.Области.СуммаНачисленоМаксБазаВсего.Значение = СтруктураГруппы6.Итог("Т6_СуммаНачисленоМаксБаза");
	мТаблица6.Области.СуммаВзносовВсего.Значение = СтруктураГруппы6.Итог("Т6_СуммаВзносов");
	
	мТаблица7.Области.СуммаНачисленоВсего.Значение = СтруктураГруппы7.Итог("Т7_СуммаНачислено");
	мТаблица7.Области.СуммаНачисленоМаксБазаВсего.Значение = СтруктураГруппы7.Итог("Т7_СуммаНачисленоМаксБаза");
	мТаблица7.Области.СуммаВзносовВсего.Значение = СтруктураГруппы7.Итог("Т7_СуммаВзносов");
	
КонецПроцедуры // Расчет()

//выпоняет расчет числа застрахованных лиц и лиц, получающих пособие по уходу за ребенком
Процедура РассчитатьЧислоЗастрахованныхЛиц (ТаблицаБазВзносовОтчетногоПериода)
	
	ТаблицаКоличестваЗастрахованныхЛиц = ТаблицаБазВзносовОтчетногоПериода.Скопировать();
	ТаблицаКоличестваЗастрахованныхЛиц.Свернуть("СтатьяНалоговойДекларации, ФизЛицо", "");
	
	// платежи с сотрудника (ПФ_Сотр15)
	НайденныеСтроки = ТаблицаКоличестваЗастрахованныхЛиц.НайтиСтроки(Новый Структура("СтатьяНалоговойДекларации",МассивНужныхСтатей[3]));
	
	УстановитьЗначениеПоказателя("ЗастрЛиц", НайденныеСтроки.Количество());	

КонецПроцедуры

Процедура РассчитатьБольничные()
	
	БольничныеПредприятие = 0;
	БольничныеФСС = 0;
	
	Если 	РегламентированнаяОтчетность.ИДКонфигурации() = "УТП"
		ИЛИ РегламентированнаяОтчетность.ИДКонфигурации() = "БП" Тогда
		ИмяРегистра = "Начисления";
	Иначе	
		ИмяРегистра = "ОсновныеНачисленияРаботниковОрганизаций";
	КонецЕсли;
	
	//запросы по больничным
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	ОсновныеНачисленияРаботников.ВидРасчета 	  КАК ВидРасчета,
	|	СУММА(ОсновныеНачисленияРаботников.Результат) КАК Результат
	|ИЗ
	|	РегистрРасчета."+ИмяРегистра+" КАК ОсновныеНачисленияРаботников
	|
	|ГДЕ
	|	  ОсновныеНачисленияРаботников.Организация = &Организация
	|	И ОсновныеНачисленияРаботников.ПериодРегистрации МЕЖДУ &ДатаНач И &ДатаКон
	|   И ОсновныеНачисленияРаботников.ВидРасчета В (&Больничные)
	|
	|СГРУППИРОВАТЬ ПО
	|	ОсновныеНачисленияРаботников.ВидРасчета";
	
	ЗапросНачисленияБольн = Новый Запрос ();
	ЗапросНачисленияБольн.Текст = ТекстЗапроса;
	ЗапросНачисленияБольн.УстановитьПараметр("ДатаНач", мДатаНачалаПериодаОтчета);
	ЗапросНачисленияБольн.УстановитьПараметр("ДатаКон" , мДатаКонцаПериодаОтчета);
	ЗапросНачисленияБольн.УстановитьПараметр("Организация",   Организация);
	
	ИмяПланаВидовРасчета = "ОсновныеНачисленияОрганизаций";
	Если РегламентированнаяОтчетность.ИДКонфигурации() = "БП" Тогда
		ЗапросНачисленияБольн.УстановитьПараметр("Больничные", ТаблицаВРБольничные.ВыгрузитьКолонку("ВидРасчета"));
	Иначе		
		МассивБольничных = Новый Массив();
		Если РегламентированнаяОтчетность.ИДКонфигурации() = "УТП" Тогда
			ИмяПланаВидовРасчета = "Начисления";
			МассивБольничных.Добавить(ПланыВидовРасчета[ИмяПланаВидовРасчета].ОплатаПоСреднемуБЛОрганизации);
			МассивБольничных.Добавить(ПланыВидовРасчета[ИмяПланаВидовРасчета].ОплатаПоСреднемуБЛ);
			МассивБольничных.Добавить(ПланыВидовРасчета[ИмяПланаВидовРасчета].ОплатаПоСреднемуБЛТравмаНаПроизводстве);
			
		Иначе
			МассивБольничных.Добавить(ПланыВидовРасчета[ИмяПланаВидовРасчета].ОплатаПоСреднемуБЛОрганизации);
			МассивБольничных.Добавить(ПланыВидовРасчета[ИмяПланаВидовРасчета].ОплатаПоСреднемуБЛ);
			МассивБольничных.Добавить(ПланыВидовРасчета[ИмяПланаВидовРасчета].ОплатаБЛПоТравмеНаПроизводстве);
		КонецЕсли;
		ЗапросНачисленияБольн.УстановитьПараметр("Больничные", МассивБольничных);
	КонецЕсли;
	
	Выборка = ЗапросНачисленияБольн.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если РегламентированнаяОтчетность.ИДКонфигурации() = "БП"  Тогда
			
			СтрокаТаблицыБольничных = ТаблицаВРБольничные.Найти(Выборка.ВидРасчета);
			ЗаСчетПредприятия = Ложь;
			Если НЕ СтрокаТаблицыБольничных = Неопределено Тогда
				ЗаСчетПредприятия = СтрокаТаблицыБольничных.ЗаСчетПредприятия;
			КонецЕсли;
			
			Если ЗаСчетПредприятия Тогда
				БольничныеПредприятие = БольничныеПредприятие + Выборка.Результат;
			Иначе
				БольничныеФСС 		  = БольничныеФСС + Выборка.Результат;
			КонецЕсли;
			
		Иначе	
			
			Если  Выборка.ВидРасчета  = ПланыВидовРасчета[ИмяПланаВидовРасчета].ОплатаПоСреднемуБЛОрганизации Тогда 
				БольничныеПредприятие = БольничныеПредприятие + Выборка.Результат;
			Иначе
				БольничныеФСС = БольничныеФСС + Выборка.Результат;
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла; 
		
	//У тому числі:
	//а) сума оплати перших п'яти днів тимчасової непрацездатності
	УстановитьЗначениеПоказателя("П1_1_1", БольничныеПредприятие);
	
	//б) сума допомоги у зв'язку з тимчасовою непрацездатністю
	УстановитьЗначениеПоказателя("П1_1_2", БольничныеФСС);	
	
КонецПроцедуры

//выполняет расчет начислений за прошлые и будущие периоды
Процедура  РассчитатьНачисленияЗаПрошлыеИБудущиеПериоды(ТаблицаБазВзносовОтчетногоПериода)
	
	Перем ИсходноеКоличествоСтрокГруппы;	

	ТаблицаНачисленийПрошлБудущ = ТаблицаБазВзносовОтчетногоПериода.Скопировать();
	ТаблицаНачисленийПрошлБудущ.Свернуть("ПериодДействия, СтатьяНалоговойДекларации", "База");
	
	тбНачисления = Новый ТаблицаЗначений;
	тбНачисления.Колонки.Добавить("Месяц");
	тбНачисления.Колонки.Добавить("ПрошлаяСумма",ОписаниеТиповЧисло);
	тбНачисления.Колонки.Добавить("БудущаяСумма",ОписаниеТиповЧисло);

	Для каждого стр Из ТаблицаНачисленийПрошлБудущ Цикл
		
		Если    стр.СтатьяНалоговойДекларации = МассивНужныхСтатей[0]
			ИЛИ стр.СтатьяНалоговойДекларации = МассивНужныхСтатей[1]
			ИЛИ стр.СтатьяНалоговойДекларации = МассивНужныхСтатей[2] Тогда
		
			Если стр.ПериодДействия < мДатаНачалаПериодаОтчета Тогда 
				НоваяСтрока 			 = тбНачисления.Добавить();
				НоваяСтрока.Месяц 		 = стр.ПериодДействия;
				НоваяСтрока.ПрошлаяСумма = стр.База;   
			ИначеЕсли стр.ПериодДействия > мДатаКонцаПериодаОтчета Тогда
				НоваяСтрока 			 = тбНачисления.Добавить();
				НоваяСтрока.Месяц 		 = стр.ПериодДействия;
				НоваяСтрока.БудущаяСумма = стр.База;   
			КонецЕсли;
		
		КонецЕсли;
		
	КонецЦикла; 
		
	тбНачисления.Свернуть("Месяц","ПрошлаяСумма,БудущаяСумма");
	тбНачисления.Сортировать("Месяц Возр");   
	
	// III Раздел 	
	//Суми, нараховані у звітному базовому періоді за минулі та 
	//майбутні місяці, на які нараховуються страхові внески	
	Если тбНачисления.Количество() <> 0 Тогда   
		
		мСтруктураИсхКолвоСтрокРазделов.Свойство(мИдГруппы1А, ИсходноеКоличествоСтрокГруппы);
		
		ТекТаблПоле = мТаблица1;
		
		КолСтрок = 0;		
		Для каждого стр из  тбНачисления Цикл  
			КолСтрок = КолСтрок + 1;
			
			Если  КолСтрок > ИсходноеКоличествоСтрокГруппы Тогда
				ВставитьДополнительнуюСтроку(мИдГруппы1А);
			КонецЕсли;	
			
			НомСтр = тбНачисления.Индекс(стр) + 1; 
			
			ИмяЯчейки = мИдГруппы1А +  Формат(НомСтр,"ЧЦ=4;ЧВН=0;ЧГ=;") + "Мес";
			ТекТаблПоле.Области[ИмяЯчейки].Значение =Формат(стр.Месяц,"ДФ = 'ММММ';Л = uk_UA");
			
			ИмяЯчейки = мИдГруппы1А + Формат(НомСтр,"ЧЦ=4;ЧВН=0;ЧГ=;")  + "СУМП" ;
			ТекТаблПоле.Области[ИмяЯчейки].Значение = стр.ПрошлаяСумма;
			
			ИмяЯчейки = мИдГруппы1А  + Формат(НомСтр,"ЧЦ=4;ЧВН=0;ЧГ=;")+ "СУМБ";
			ТекТаблПоле.Области[ИмяЯчейки].Значение = стр.БудущаяСумма;             		
			
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры	

Процедура РассчитатьСуммыВыплат()
	
	ТекстЗапроса = "
	 |ВЫБРАТЬ
	 |	СУММА(СуммаВзаиморасчетов) КАК Выплачено
	 |ИЗ
	 |	РегистрНакопления.ВзаиморасчетыСРаботникамиОрганизаций КАК ВзаиморасчетыСРаботникамиОрганизаций
	 |ГДЕ 
	 |	  ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	 |  И Период МЕЖДУ &НачДата И &КонДата
	 |  И Организация = &парамОрганизация
	 |	И КодОперации = ЗНАЧЕНИЕ(Перечисление.КодыОперацийВзаиморасчетыСРаботникамиОрганизаций.Выплата)
	 |";
	 
	ЗапросВыплатаВТекПериоде = Новый Запрос;
	ЗапросВыплатаВТекПериоде.УстановитьПараметр("НачДата", мДатаНачалаПериодаОтчета);
	ЗапросВыплатаВТекПериоде.УстановитьПараметр("КонДата", мДатаКонцаПериодаОтчета);
	ЗапросВыплатаВТекПериоде.УстановитьПараметр("парамОрганизация" ,Организация);
	ЗапросВыплатаВТекПериоде.Текст = ТекстЗапроса;
	
	РезультатЗапроса = ЗапросВыплатаВТекПериоде.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		ТаблицаВыплатОтчетногоПериода = РезультатЗапроса.Выгрузить();
		мТаблица1.Области.СправочноВыплач.Значение =  ТаблицаВыплатОтчетногоПериода[0].Выплачено;
	КонецЕсли;	
	
КонецПроцедуры	

Процедура РассчитатьСуммуФактическихЗатратНаОплатуТруда()
	
	//Если (РегламентированнаяОтчетность.ИДКонфигурации() = "ЗУП") Тогда
	//	//Загальна сума фактичних витрат на оплату праці та інших виплат, пов'язаних з відносинами 
	//	//трудового найму (Кт 661)
	//	
	//	//  по виду взаиморасчетов "заработная плата" начисления гарантированно пройдут 
	//	//  по кредиту счет 661
	//	Запрос = Новый Запрос;
	//	Запрос.Текст = "	
	//	|ВЫБРАТЬ
	//	|	ЕстьNULL(СУММА(Взаиморасчеты.СуммаВзаиморасчетовПриход),0) КАК КО66	
	//	|ИЗ
	//	|	РегистрНакопления.ВзаиморасчетыСРаботникамиОрганизаций.Обороты(&ПериодНачало, &ПериодКонец, МЕСЯЦ, (СчетУчета В ИЕРАРХИИ (&СчетУчета661) ИЛИ СчетУчета В ИЕРАРХИИ (&СчетУчета663)) И Организация = &Организация) КАК Взаиморасчеты
	//	|";
	//	
	//	Запрос.УстановитьПараметр("ПериодНачало",	мДатаНачалаПериодаОтчета);
	//	Запрос.УстановитьПараметр("ПериодКонец",	мДатаКонцаПериодаОтчета);
	//	Запрос.УстановитьПараметр("Организация",	Организация);
	//	Запрос.УстановитьПараметр("СчетУчета661",	ПланыСчетов.Хозрасчетный.РасчетыПоЗаработнойПлате);
	//	Запрос.УстановитьПараметр("СчетУчета663",	ПланыСчетов.Хозрасчетный.РасчетыПоДругимВыплатам);
	//	
	//	Выборка = Запрос.Выполнить().Выбрать();
	//	
	//	П1_1 = 0;
	//	Если Выборка.Следующий() Тогда	
	//		П1_1 = Выборка.КО66;
	//		
	//		// без выплат за счет соц. страха
	//		П1_1 = П1_1 - СуммаВыплатЗаСчетФССКромеБольничных();
	//	КонецЕсли;
	//	
	//	УстановитьЗначениеПоказателя("П1_1", П1_1);
	//	
	//Иначе
	//	
	//	П1_1 = КО(Счет66);
	//	
	//	// без возврата денег в кассу
	//	П1_1 = П1_1 - ОБ(Счет301, Счет66);
	//	// без движения по депонентам
	//	П1_1 = П1_1 - КО(Счет66_2);
	//	// без выплат за счет соц. страха
	//	П1_1 = П1_1 - СуммаВыплатЗаСчетФССКромеБольничных();
	//		  
	//	УстановитьЗначениеПоказателя("П1_1", П1_1);
	//		
	//КонецЕсли;	
	
	
	Запрос = Новый Запрос();
	Запрос.Параметры.Вставить("ПериодОтчета", НачалоМесяца(мДатаКонцаПериодаОтчета));
	Запрос.Параметры.Вставить("Организация", Организация);
	СЗ = Новый СписокЗначений();
	СЗ.Добавить(Справочники.Налоги.Пенсионный);
	СЗ.Добавить(Справочники.Налоги.Пенсионный1_5);
	Запрос.Параметры.Вставить("НалогиПенсионный", СЗ);
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Базовые.ВидРасчета 
	|ИЗ 
	|	ПланВидовРасчета.ВзносыВФонды.БазовыеВидыРасчета КАК Базовые
	|ГДЕ
	|	Базовые.Ссылка В (ВЫБРАТЬ ВидРасчета ИЗ РегистрСведений.ВидыРасчетовВзносовВФонды.СрезПоследних(&ПериодОтчета, Налог В (&НалогиПенсионный)))
	|";
	ОблагаемоеПенсионным = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ВидРасчета"); 
	Запрос.Параметры.Вставить("ОблагаемоеПенсионным", ОблагаемоеПенсионным);
	
	Запрос.Текст = "
	|	ВЫБРАТЬ
	|			СУММА(ОсновныеНачисленияРаботниковОрганизаций.Результат) КАК Результат
	|		ИЗ
	|			РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК ОсновныеНачисленияРаботниковОрганизаций
	|		ГДЕ
	|			ОсновныеНачисленияРаботниковОрганизаций.Организация 		= &Организация
	|			И ОсновныеНачисленияРаботниковОрганизаций.ПериодРегистрации = &ПериодОтчета
	|			И ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета В (&ОблагаемоеПенсионным)
	|";
	Если     РегламентированнаяОтчетность.ИДКонфигурации() = "УТП" 
		 ИЛИ РегламентированнаяОтчетность.ИДКонфигурации() = "БП" Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций","РегистрРасчета.Начисления");
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
	
		УстановитьЗначениеПоказателя("П1_1", Выборка.Результат);
	
	КонецЕсли;
	
КонецПроцедуры	

//Функция СуммаВыплатЗаСчетФССКромеБольничных()
//	
//	СуммаФСС = 0;
//	
//	Если (РегламентированнаяОтчетность.ИДКонфигурации() = "ЗУП") Тогда
//		
//		Запрос = Новый Запрос();
//		
//		Запрос.Текст =
//		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
//		|	ОтражениеЗарплатыВРеглУчетеОтражениеВУчете.СчетКт,
//		|	ОтражениеЗарплатыВРеглУчетеОтражениеВУчете.СчетДт,
//		|	ОтражениеЗарплатыВРеглУчетеОтражениеВУчете.СубконтоДт2 КАК СтатьяНалоговойДекларации,
//		|	СУММА(ОтражениеЗарплатыВРеглУчетеОтражениеВУчете.Сумма) КАК Сумма
//		|ИЗ
//		|	Документ.ОтражениеЗарплатыВРеглУчете.ОтражениеВУчете КАК ОтражениеЗарплатыВРеглУчетеОтражениеВУчете
//		|ГДЕ
//		|	ОтражениеЗарплатыВРеглУчетеОтражениеВУчете.Ссылка.ПериодРегистрации МЕЖДУ НАЧАЛОПЕРИОДА(&ДатаНач, МЕСЯЦ) И КОНЕЦПЕРИОДА(&ДатаНач, МЕСЯЦ)
//		|	И ОтражениеЗарплатыВРеглУчетеОтражениеВУчете.Ссылка.Проведен = ИСТИНА
//		|	И ОтражениеЗарплатыВРеглУчетеОтражениеВУчете.СчетДт В(&СчетаФСС)
//		|	И ОтражениеЗарплатыВРеглУчетеОтражениеВУчете.СчетКт В(&СчетаНачислений)
//		|	И ОтражениеЗарплатыВРеглУчетеОтражениеВУчете.Ссылка.Организация = &Организация
//		|
//		|СГРУППИРОВАТЬ ПО
//		|	ОтражениеЗарплатыВРеглУчетеОтражениеВУчете.СчетКт,
//		|	ОтражениеЗарплатыВРеглУчетеОтражениеВУчете.СчетДт,
//		|	ОтражениеЗарплатыВРеглУчетеОтражениеВУчете.СубконтоДт2";		
//		
//		Запрос.УстановитьПараметр("ДатаНач",мДатаНачалаПериодаОтчета);
//		Запрос.УстановитьПараметр("ДатаНач",мДатаКонцаПериодаОтчета);
//		Запрос.УстановитьПараметр("Организация",Организация);
//											  
//		СчетаФСС = Новый Массив();
//		СчетаФСС.Добавить(ПланыСчетов.Хозрасчетный.РасчетыПоСоциальномуСтрахованию);
//		СчетаФСС.Добавить(ПланыСчетов.Хозрасчетный.РасчетыПоСтрахованиюОтНесчастныхСлучаев);
//		Запрос.УстановитьПараметр("СчетаФСС",СчетаФСС);
//		
//		СчетаНачислений = Новый Массив();
//		СчетаНачислений.Добавить(ПланыСчетов.Хозрасчетный.РасчетыПоЗаработнойПлате);
//		СчетаНачислений.Добавить(ПланыСчетов.Хозрасчетный.РасчетыПоДругимВыплатам);
//		Запрос.УстановитьПараметр("СчетаНачислений",СчетаНачислений);
//		
//		Выборка = Запрос.Выполнить().Выбрать();
//		Пока Выборка.Следующий() Цикл
//			
//			СтатьиЗаСчетФСС = Справочники.СтатьиНалоговыхДеклараций.ВыбратьИерархически(Справочники.СтатьиНалоговыхДеклараций.ФССУтратаТрудосп_);
//			Пока СтатьиЗаСчетФСС.Следующий() Цикл
//				
//				Если    СтатьиЗаСчетФСС.Ссылка = Справочники.СтатьиНалоговыхДеклараций.ФССУтрТрудосп_ВремНетрудосп
//					ИЛИ СтатьиЗаСчетФСС.Ссылка = Справочники.СтатьиНалоговыхДеклараций.ФССУтрТрудосп_ВремНетрудоспУход Тогда
//					Продолжить;
//				КонецЕсли;
//				
//				Если Выборка.СтатьяНалоговойДекларации = СтатьиЗаСчетФСС.Ссылка Тогда
//					СуммаФСС = СуммаФСС + Выборка.Сумма;	
//				КонецЕсли;
//				
//			КонецЦикла;			
//			
//			СтатьиЗаСчетФССНесч = Справочники.СтатьиНалоговыхДеклараций.ВыбратьИерархически(Справочники.СтатьиНалоговыхДеклараций.ФССНесчСлуч_);
//			Пока СтатьиЗаСчетФССНесч.Следующий() Цикл
//				
//				Если СтатьиЗаСчетФССНесч.Ссылка = Справочники.СтатьиНалоговыхДеклараций.ФССНесчСлуч_ВремНетрудосп Тогда
//					Продолжить;
//				КонецЕсли;
//				
//				Если Выборка.СтатьяНалоговойДекларации = СтатьиЗаСчетФССНесч.Ссылка Тогда
//					СуммаФСС = СуммаФСС + Выборка.Сумма;	
//				КонецЕсли;
//			КонецЦикла;
//			
//		КонецЦикла;
//		
//	Иначе
//		
//		СтатьиЗаСчетФСС = Справочники.СтатьиНалоговыхДеклараций.ВыбратьИерархически(Справочники.СтатьиНалоговыхДеклараций.ФССУтратаТрудосп_);
//		Пока СтатьиЗаСчетФСС.Следующий() Цикл
//			
//			Если    СтатьиЗаСчетФСС.Ссылка = Справочники.СтатьиНалоговыхДеклараций.ФССУтрТрудосп_ВремНетрудосп
//				ИЛИ СтатьиЗаСчетФСС.Ссылка = Справочники.СтатьиНалоговыхДеклараций.ФССУтрТрудосп_ВремНетрудоспУход Тогда
//				Продолжить;
//			КонецЕсли;
//			
//			СуммаФСС = СуммаФСС + мБухИтогиКорРС.ПолучитьИтог("СуммаКорОборотДт", "Счет, Субконто2,КорСчет, ", Счет65_2, СтатьиЗаСчетФСС.Ссылка,Счет66_1)
//						 		+ мБухИтогиКорРС.ПолучитьИтог("СуммаКорОборотДт", "Счет, Субконто2,КорСчет, ", Счет65_2, СтатьиЗаСчетФСС.Ссылка,Счет66_3);
//		КонецЦикла;
//		
//		СтатьиЗаСчетФССНесч = Справочники.СтатьиНалоговыхДеклараций.ВыбратьИерархически(Справочники.СтатьиНалоговыхДеклараций.ФССНесчСлуч_);
//		Пока СтатьиЗаСчетФССНесч.Следующий() Цикл
//			
//			Если СтатьиЗаСчетФССНесч.Ссылка = Справочники.СтатьиНалоговыхДеклараций.ФССНесчСлуч_ВремНетрудосп Тогда
//				Продолжить;
//			КонецЕсли;
//			
//			СуммаФСС = СуммаФСС + мБухИтогиКорРС.ПолучитьИтог("СуммаКорОборотДт", "Счет, Субконто2,КорСчет, ", Счет65_6, СтатьиЗаСчетФССНесч.Ссылка,Счет66_1)
//						 		+ мБухИтогиКорРС.ПолучитьИтог("СуммаКорОборотДт", "Счет, Субконто2,КорСчет, ", Счет65_6, СтатьиЗаСчетФССНесч.Ссылка,Счет66_3);
//		КонецЦикла;
//		
//	КонецЕсли;
//	
//	Возврат СуммаФСС;				 
//				 
//КонецФункции

//выполняет расчет сальдо взаиомрасчетов с фондом
Процедура РассчитатьСальдоВзаиморасчетовСФондом()
	
	Если (РегламентированнаяОтчетность.ИДКонфигурации() = "ЗУП") Тогда
		
		//Сальдо розрахунків рахунка 65 "Розрахунки за страхуванням" субрахунка 651 "За пенсійним забезпеченням" на початок 
		//звітного періоду: 
		
		ЗапросРасчетыСФондом = Новый Запрос;
		ЗапросРасчетыСФондом.Текст ="
		|ВЫБРАТЬ
		|	ЕстьNULL(СУММА(РезультатОстаток), 0)	КАК Результат
		|
		|ИЗ
		|	РегистрНакопления.ВзаиморасчетыПоВзносамВФонды.Остатки(&НачДата, Организация = &Организация И СтатьяНалоговойДекларации В (&МассивСтатей))
		|
		|";
		
		ЗапросРасчетыСФондом.УстановитьПараметр("НачДата", мДатаНачалаПериодаОтчета);
		ЗапросРасчетыСФондом.УстановитьПараметр("Организация",   Организация);
		
		ЗапросРасчетыСФондом.УстановитьПараметр("МассивСтатей",   МассивНужныхСтатей);
		
		РезультатЗапроса = ЗапросРасчетыСФондом.Выполнить().Выбрать();
		Если РезультатЗапроса.Следующий() Тогда
			Если РезультатЗапроса.Результат > 0 Тогда
				ПенсНачКт = РезультатЗапроса.Результат;
				УстановитьЗначениеПоказателя("ПенсНачКт",ПенсНачКт);
			Иначе
				ПенсНачДт = -РезультатЗапроса.Результат;
				УстановитьЗначениеПоказателя("ПенсНачДт",ПенсНачДт);
			КонецЕсли;
		КонецЕсли;
		
		//Сальдо розрахунків рахунка 65 "Розрахунки за страхуванням" субрахунка 651 "За пенсійним забезпеченням" на кінець 
		//звітного періоду:
		ЗапросРасчетыСФондом.УстановитьПараметр("НачДата", мДатаКонцаПериодаОтчета);
		
		РезультатЗапроса = ЗапросРасчетыСФондом.Выполнить().Выбрать();
		Если РезультатЗапроса.Следующий() Тогда
			Если РезультатЗапроса.Результат > 0 Тогда
				ПенсКонКт = РезультатЗапроса.Результат;
				УстановитьЗначениеПоказателя("ПенсКонКт",ПенсКонКт);
			Иначе
				ПенсКонДт = -РезультатЗапроса.Результат;
				УстановитьЗначениеПоказателя("ПенсКонДт",ПенсКонДт);
			КонецЕсли;
		КонецЕсли;
	Иначе
		ПенсНачДт = СНД(Счет65_1);
		УстановитьЗначениеПоказателя("ПенсНачДт",ПенсНачДт);
		
		ПенсНачКт = СНК(Счет65_1);
		УстановитьЗначениеПоказателя("ПенсНачКт",ПенсНачКт);
		
		//Сальдо розрахунків рахунка 65 "Розрахунки за страхуванням" субрахунка 651 "За пенсійним забезпеченням" на кінець 
		//звітного періоду: 
		ПенсКонДт = СКД(Счет65_1);
		УстановитьЗначениеПоказателя("ПенсКонДт",ПенсКонДт);
		
		ПенсКонКт = СКК(Счет65_1);
		УстановитьЗначениеПоказателя("ПенсКонКт",ПенсКонКт);
	КонецЕсли;   
	   
КонецПроцедуры

Процедура ВыполнитьИнициализацию()
	
	Если     РегламентированнаяОтчетность.ИДКонфигурации() = "БП"
		Или  РегламентированнаяОтчетность.ИДКонфигурации() = "УПП"
		Или  РегламентированнаяОтчетность.ИДКонфигурации() = "УТП" Тогда
		
		ПС = ПланыСчетов["Хозрасчетный"];
		Счет65_1      = ПС.РасчетыПоПенсионномуОбеспечению;
		Счет66        = ПС.РасчетыПоОплатеТруда;
		Счет66_1      = ПС.РасчетыПоЗаработнойПлате;
		Счет66_2      = ПС.РасчетыПоДепонентам;
		Счет66_3      = ПС.РасчетыПоДругимВыплатам;
		Счет65_2      = ПС.РасчетыПоСоциальномуСтрахованию;
		Счет65_6      = ПС.РасчетыПоСтрахованиюОтНесчастныхСлучаев;
		Счет81_5      = ПС.ОплатаДругогоНеотработанногоВремени;
		Счет91        = ПС.ОбщепроизводственныеРасходы;
		Счет92        = ПС.АдминистративныеРасходы;
		Счет93        = ПС.РасходыНаСбыт;
		Счет301       = ПС.КассаВНациональнойВалюте;
		
		// Бухгалтерский итоги по счетам
		мБухИтоги = Обработки.БухгалтерскиеИтоги.Создать();
		// Бухгалтерские итоги по аналитике 
		мБухИтогиРС = Обработки.БухгалтерскиеИтоги.Создать();
		
		МассивСубконто = Новый Массив;
		МассивСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Налоги);
		МассивСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиНалоговыхДеклараций);
		
		Итоги = "НачальныйОстатокДт, НачальныйРазвернутыйОстатокДт, 
		|НачальныйОстатокКт, НачальныйРазвернутыйОстатокКт,
		|КонечныйОстатокДт,  КонечныйРазвернутыйОстатокДт, 
		|КонечныйОстатокКт,  КонечныйРазвернутыйОстатокКт,
		|ОборотДт, ОборотКт,
		|КорОборотДт, КорОборотКт";
		
		ИтогиРС = "ОборотДт, ОборотКт";
		
		// Бухгалтерские итоги по счетам, без аналитики
		мБухИтоги.РассчитатьИтоги("Хозрасчетный", Итоги, "Сумма", "Счет,КорСчет", мДатаНачалаПериодаОтчета, мДатаКонцаПериодаОтчета, , , , , , "Организация", Организация);
		
		// Бухгалтерские итоги по счетам, с аналитикой
		мБухИтогиРС.РассчитатьИтоги("Хозрасчетный", ИтогиРС, "Сумма", "Счет,Субконто1,Субконто2", мДатаНачалаПериодаОтчета, мДатаКонцаПериодаОтчета,,"651",МассивСубконто,,, "Организация", Организация);
		
		мБухИтогиКорРС = Обработки.БухгалтерскиеИтоги.Создать();
		Итоги = "ОборотКт,ОборотДт,КорОборотДт, КорОборотКт";	
		мБухИтогиКорРС.РассчитатьИтоги("Хозрасчетный", Итоги, "Сумма", "Период,Счет,Субконто1,Субконто2,КорСчет", мДатаНачалаПериодаОтчета, мДатаКонцаПериодаОтчета,"Месяц","652,656",МассивСубконто,,, "Организация", Организация);
		
	КонецЕсли;
	
	СтрокиДекларации = Справочники.СтатьиНалоговыхДеклараций;
	
	МассивНужныхСтатей = Новый Массив; 
	МассивНужныхСтатей.Добавить(СтрокиДекларации.ПФ_Орг32);
	МассивНужныхСтатей.Добавить(СтрокиДекларации.ПФ_Орг4);
	МассивНужныхСтатей.Добавить(СтрокиДекларации.ПФ_Орг42);
	МассивНужныхСтатей.Добавить(СтрокиДекларации.ПФ_Сотр15);
	МассивНужныхСтатей.Добавить(СтрокиДекларации.ПФ_Декр);
	
КонецПроцедуры	

// Процедура выполняет заполнение отчета автоматически по данным ИБ.
//
Процедура ЗаполнитьАвто()  Экспорт

	ВыполнитьИнициализацию();
	
	ТаблСреднеспЧисленности = ПроведениеРасчетов.ПолучитьСреднююЧисленность(мДатаНачалаПериодаОтчета, мДатаКонцаПериодаОтчета, "ССЧ", "МЕСЯЦ", Организация, "ШТАТ"); 
	Сотрудников = ТаблСреднеспЧисленности[0].Средняя;
	УстановитьЗначениеПоказателя("Сотрудников", Сотрудников);
	ТаблСреднеспЧисленности = ПроведениеРасчетов.ПолучитьСреднююЧисленность(мДатаНачалаПериодаОтчета, мДатаКонцаПериодаОтчета, "ССЧ", "МЕСЯЦ", Организация, "ИНВ");
	Инвалидов = ТаблСреднеспЧисленности[0].Средняя;
	УстановитьЗначениеПоказателя("Инвалидов", Инвалидов);
	
	КолГПХ = 0;	
	Если    (РегламентированнаяОтчетность.ИДКонфигурации() = "УПП") 
		ИЛИ (РегламентированнаяОтчетность.ИДКонфигурации() = "ЗУП") 
		ИЛИ (РегламентированнаяОтчетность.ИДКонфигурации() = "УТП") Тогда
	
		ЗапросГПХ = Новый Запрос;
		ЗапросГПХ.Текст = "
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Работники.Сотрудник.ФизЛицо
		|ИЗ  Документ.ДоговорНаВыполнениеРаботСФизЛицом КАК Работники
		|ГДЕ 
		|   Работники.Проведен
		| И Работники.ДатаОкончания >= &парамНачало
		| И Работники.ДатаНачала    <= &парамКонец
		| И Работники.Организация = &парамОрганизация
		|";	
		ЗапросГПХ.УстановитьПараметр("парамНачало",мДатаНачалаПериодаОтчета);
		ЗапросГПХ.УстановитьПараметр("парамКонец",мДатаКонцаПериодаОтчета);
		ЗапросГПХ.УстановитьПараметр("парамОрганизация",Организация);
		
		ВыборкаГПХ = ЗапросГПХ.Выполнить().Выбрать();
		КолГПХ = ВыборкаГПХ.Количество()
		
	КонецЕсли;
	УстановитьЗначениеПоказателя("Сотр_по_ГПХ", КолГПХ);

	Запрос = Новый Запрос();
	
	Если РегламентированнаяОтчетность.ИДКонфигурации() = "БП" Тогда
		ИмяРегистра = "ВзносыВФондыИНалоги";
	Иначе	
	    ИмяРегистра = "ВзносыВФонды";
	КонецЕсли;
	
	Запрос.Текст = "ВЫБРАТЬ
				   |	НАЧАЛОПЕРИОДА(ВзносыВФондыИНалоги.ДатаНачала, МЕСЯЦ) КАК ПериодДействия,
	               |    ВзносыВФондыИНалоги.Сотрудник.ФизЛицо 				 КАК ФизЛицо,
				   |    ВзносыВФондыИНалоги.СтатьяНалоговойДекларации		 КАК СтатьяНалоговойДекларации,
	               |	СУММА(ВзносыВФондыИНалоги.БазаВзноса) 				 КАК База,
	               |	СУММА(ВзносыВФондыИНалоги.Результат)  				 КАК СуммаВзноса
	               |ИЗ
	               |	РегистрРасчета."+ИмяРегистра+" КАК ВзносыВФондыИНалоги
				   |
				   |ГДЕ
				   |    ВзносыВФондыИНалоги.ПериодРегистрации МЕЖДУ &ПарамНач И &ПарамКон
				   |  И ВзносыВФондыИНалоги.Организация = &Организация
				   |  И ВзносыВФондыИНалоги.СтатьяНалоговойДекларации В (&МассивНужныхСтатей)
		           |
				   |СГРУППИРОВАТЬ ПО 
				   |	НАЧАЛОПЕРИОДА(ВзносыВФондыИНалоги.ДатаНачала, МЕСЯЦ),
				   |	ВзносыВФондыИНалоги.Сотрудник.ФизЛицо,
				   |	ВзносыВФондыИНалоги.СтатьяНалоговойДекларации
				   |";
		
	
	Запрос.УстановитьПараметр("ПарамНач",            мДатаНачалаПериодаОтчета);
	Запрос.УстановитьПараметр("ПарамКон",            мДатаКонцаПериодаОтчета);
	Запрос.УстановитьПараметр("Организация",         Организация);
	Запрос.УстановитьПараметр("МассивНужныхСтатей",  МассивНужныхСтатей);
	
	РезультатЗапроса = Запрос.Выполнить();

	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		ТаблицаБазВзносов = РезультатЗапроса.Выгрузить();
		
		РассчитатьЧислоЗастрахованныхЛиц(ТаблицаБазВзносов);
		
		РассчитатьБольничные();
		
		РассчитатьНачисленияЗаПрошлыеИБудущиеПериоды(ТаблицаБазВзносов);
		
		ТаблицаБазВзносов.Свернуть("СтатьяНалоговойДекларации", "База, СуммаВзноса");
		
		//ищем структуру по месяцу и статье декларации для определения баз
		Отбор = Новый Структура;
		Для i = 0 по 3  Цикл
			Отбор.Вставить("СтатьяНалоговойДекларации",МассивНужныхСтатей[i]);
			НайденныеСтроки = ТаблицаБазВзносов.НайтиСтроки(Отбор);
			
			Если  НайденныеСтроки.Количество() >0  Тогда
				Если (i < 3)  Тогда
					// взносы с ФОТ
					Ном = i + 1;
					ИмяЯчейки = "П2"+ "_" + Ном;
					УстановитьЗначениеПоказателя(ИмяЯчейки,НайденныеСтроки[0].База);
					
					ИмяЯчейки = "П3"+ "_" + Ном;
					УстановитьЗначениеПоказателя(ИмяЯчейки,НайденныеСтроки[0].СуммаВзноса);
				Иначе
					// взносы с Сотрудника
					П4 = НайденныеСтроки[0].База;
					УстановитьЗначениеПоказателя("П4", П4);
					
					П5 = НайденныеСтроки[0].СуммаВзноса;
					УстановитьЗначениеПоказателя("П5",П5);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;	
	
	//Загальна сума фактичних витрат на оплату праці та інших виплат, пов'язаних з відносинами 
	//трудового найму (Кт 661)
	РассчитатьСуммуФактическихЗатратНаОплатуТруда();
	
	//Додаток до розрахунку суми страхових внесків
	//на загальнообов'язкове державне пенсійне 	
	//Сума заборгованості з виплати заробітної плати на початок звітного періоду
	ЗапросСуммаЗадолжНачало = Новый Запрос ("
	|ВЫБРАТЬ
	| СУММА (ВзаиморасчетыСРаботниками.СуммаВзаиморасчетовОстаток) КАК Результат
	|  ИЗ
	|	РегистрНакопления.ВзаиморасчетыСРаботникамиОрганизаций.Остатки(&НачДата,Организация = &Организация) КАК ВзаиморасчетыСРаботниками
	| ГДЕ
	| ВзаиморасчетыСРаботниками.ПериодВзаиморасчетов <> &ПрошлыйМесяц  
	|");
	
	ЗапросСуммаЗадолжНачало.УстановитьПараметр("НачДата", мДатаНачалаПериодаОтчета);
	ЗапросСуммаЗадолжНачало.УстановитьПараметр("ПрошлыйМесяц",ДобавитьМесяц(мДатаНачалаПериодаОтчета,-1));
	ЗапросСуммаЗадолжНачало.УстановитьПараметр("Организация",   Организация);
	РезультатЗапроса = ЗапросСуммаЗадолжНачало.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		ТаблицаРезультатовЗадолжЗПНач = РезультатЗапроса.Выгрузить();
		ЗадолжНач = ТаблицаРезультатовЗадолжЗПНач[0].Результат;
		УстановитьЗначениеПоказателя("ЗадолжНач",ЗадолжНач);
	КонецЕсли;
	
	//Сума заборгованості з виплати заробітної плати на початок звітного періоду
	ЗапросСуммаЗадолжКонец = Новый Запрос ("
	|ВЫБРАТЬ
	| СУММА (ВзаиморасчетыСРаботниками.СуммаВзаиморасчетовОстаток) КАК Результат
	|  ИЗ
	|	РегистрНакопления.ВзаиморасчетыСРаботникамиОрганизаций.Остатки(&КонДата,Организация = &Организация) КАК ВзаиморасчетыСРаботниками
	| ГДЕ
	| ВзаиморасчетыСРаботниками.ПериодВзаиморасчетов <> &НачДата 
	|");
	
	ЗапросСуммаЗадолжКонец.УстановитьПараметр("НачДата", мДатаНачалаПериодаОтчета);
	ЗапросСуммаЗадолжКонец.УстановитьПараметр("КонДата", мДатаКонцаПериодаОтчета);
	ЗапросСуммаЗадолжКонец.УстановитьПараметр("Организация",   Организация);
	РезультатЗапроса = ЗапросСуммаЗадолжКонец.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		ТаблицаРезультатовЗадолжЗПКон = РезультатЗапроса.Выгрузить();
		ЗадолжКон = ТаблицаРезультатовЗадолжЗПКон[0].Результат;
		УстановитьЗначениеПоказателя("ЗадолжКон",ЗадолжКон);
	КонецЕсли;
	
	//Сальдо розрахунків рахунка 65 "Розрахунки за страхуванням" субрахунка 651 "За пенсійним забезпеченням" на початок 
	//звітного періоду: 
	РассчитатьСальдоВзаиморасчетовСФондом();
	
	//РассчитатьСуммыЗадолженностейЗаПериодДо2004();
	РассчитатьСуммыВыплат();
	
	//////////////////////////////////////////////////////////////////	
	// Таблица 5 - трудовые отношения
	ТаблицаПриемовУвольнений = СформироватьСписокТрудовыхОтношенийТаблица5();
	
	//////////////////////////////////////////////////////////////////	
	// Таблица 8 - спец стаж
	СписокРаботниковСоСпецСтажем = СформироватьСпецСтажТаблица8(ТаблицаПриемовУвольнений);
	
	//////////////////////////////////////////////////////////////////	
	// Таблицы 6-7 - начисления/взносы
	СформироватьНачисленияВзносыТаблица6Таблица7(СписокРаботниковСоСпецСтажем);
	
	Расчет();
	
	Модифицированность = Истина;
	
КонецПроцедуры // ЗаполнитьАвто()

Функция СформироватьСпецСтажТаблица8(ТаблицаПриемовУвольнений)
	
	Перем СтруктураГруппы8;
	Перем ИсходноеКоличествоСтрокГруппы8;
	
	// сформируем список значений: Значение - ссылка на физ.лицо, а представление - основание для льготного стажа
	Список = Новый СписокЗначений;	
	
	Если  НЕ Метаданные.РегистрыСведений.Найти("СпецстажРаботниковОрганизаций") = Неопределено Тогда
	
		Запрос = Новый Запрос();
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|          СпецСтаж.Физлицо КАК ФизЛицо,
		|              СпецСтаж.ДРФО КАК ДРФО,
		|              СпецСтаж.Основание КАК Основание,
		|          СпецСтаж.Норма КАК Норма,
		|              СпецСтаж.ЕдиницаВремени КАК ЕдиницаВремени,
		|              СпецСтаж.Сезонность КАК Сезонность,
		|          СпецСтаж.Фамилия КАК ФизЛицоФамилия,
		|              СпецСтаж.Имя КАК ФизЛицоИмя,
		|              СпецСтаж.Отчество КАК ФизЛицоОтчество,
		|          МАКСИМУМ(СпецСтаж.КонецДействия) КАК КонецДействия,
		|              МИНИМУМ(СпецСтаж.НачалоДействия) КАК НачалоДействия,
		|              СУММА(СпецСтаж.Результат) КАК Результат
		|ИЗ(ВЫБРАТЬ
		|          СпецСтаж.Сотрудник.Физлицо КАК ФизЛицо,
		|              СпецСтаж.Сотрудник.Физлицо.КодПоДРФО КАК ДРФО,
		|              СпецСтаж.ВидСтажа.ОснованиеЛьготногоСтажа.КодПФ КАК Основание,
		|              СпецСтаж.ДатаОкончания КАК КонецДействия,
		|              СпецСтаж.ДатаНачала КАК НачалоДействия,
		|              СпецСтаж.Норма КАК Норма,
		|              СпецСтаж.ЕдиницаВремени КАК ЕдиницаВремени,
		|              СпецСтаж.Сезонность КАК Сезонность,
		|          СпецСтаж.Результат КАК Результат,
		|          ФИОФизЛицСрезПоследних.Фамилия КАК Фамилия,
		|              ФИОФизЛицСрезПоследних.Имя КАК Имя,
		|              ФИОФизЛицСрезПоследних.Отчество КАК Отчество
		|ИЗ
		|              РегистрСведений.СпецстажРаботниковОрганизаций КАК СпецСтаж
		|                              ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних(&Дата, ) КАК ФИОФизЛицСрезПоследних
		|                              ПО СпецСтаж.Сотрудник.Физлицо = ФИОФизЛицСрезПоследних.ФизЛицо
		|ГДЕ
		|              СпецСтаж.ВидСтажа.ЛьготныйСтаж
		|              И СпецСтаж.Организация = &Организация
		|              И СпецСтаж.ПериодРегистрации = НАЧАЛОПЕРИОДА(&Дата, МЕСЯЦ)
		|) КАК СпецСтаж
		|
		|СГРУППИРОВАТЬ ПО
		|  СпецСтаж.Физлицо, СпецСтаж.ДРФО, СпецСтаж.Основание, СпецСтаж.Норма, СпецСтаж.ЕдиницаВремени, СпецСтаж.Сезонность, СпецСтаж.Фамилия, СпецСтаж.Имя, СпецСтаж.Отчество    
		|";
		
		Запрос.УстановитьПараметр("Организация", Организация);
		Запрос.УстановитьПараметр("Дата", мДатаКонцаПериодаОтчета);
		
		ТаблицаСпецСтажа = Запрос.Выполнить().Выгрузить();
		
		// теперь заполним таблицу 8
		мСтруктураМногострочныхРазделов.Свойство(мИдГруппы8, СтруктураГруппы8);
		мСтруктураИсхКолвоСтрокРазделов.Свойство(мИдГруппы8, ИсходноеКоличествоСтрокГруппы8);           
		
		НомСтроки = 1;
		Для каждого СтрокаСпецСтажа Из ТаблицаСпецСтажа Цикл
			
			Список.Добавить(СтрокаСпецСтажа.ФизЛицо, СтрокаСпецСтажа.Основание);        
			
			Если НомСтроки <= ИсходноеКоличествоСтрокГруппы8 Тогда
				ДобавленнаяСтрока = СтруктураГруппы8[НомСтроки - 1];
			Иначе
				ДобавленнаяСтрока = СтруктураГруппы8.Добавить();            
			КонецЕсли;
			НомСтроки = НомСтроки + 1;
			
			ДобавленнаяСтрока[мИдГруппы8+"ДРФО"]			= СтрокаСпецСтажа.ДРФО;
			
			ДобавленнаяСтрока[мИдГруппы8+"ФИО"]          = СтрокаСпецСтажа.ФизЛицоФамилия;
			ДобавленнаяСтрока[мИдГруппы8+"Имя"]          = СтрокаСпецСтажа.ФизЛицоИмя;                      
			ДобавленнаяСтрока[мИдГруппы8+"Отчество"]     = СтрокаСпецСтажа.ФизЛицоОтчество;                             
			
			ДобавленнаяСтрока[мИдГруппы8+"КодОснования"] = СтрЗаменить(СтрокаСпецСтажа.Основание,"_","");
			
			ДобавленнаяСтрока[мИдГруппы8+"ДатаНач"]      = СтрокаСпецСтажа.НачалоДействия;
			ДобавленнаяСтрока[мИдГруппы8+"ДатаКон"]      = СтрокаСпецСтажа.КонецДействия;
			
			Если СтрокаСпецСтажа.ЕдиницаВремени = Перечисления.ЕдиницыВремениУчетаСпецстажа.Смены Тогда
				// нормо-смены
				ДобавленнаяСтрока[мИдГруппы8+"НормоСмен"] = СтрокаСпецСтажа.Результат;	
				
			ИначеЕсли СтрокаСпецСтажа.ЕдиницаВремени = Перечисления.ЕдиницыВремениУчетаСпецстажа.Часы Тогда
				// часы-минуты
				ДобавленнаяСтрока[мИдГруппы8+"Часов"] = Цел(СтрокаСпецСтажа.Результат);	
				ДобавленнаяСтрока[мИдГруппы8+"Минут"] = Окр((СтрокаСпецСтажа.Результат - Цел(СтрокаСпецСтажа.Результат)) * 60, 0, РежимОкругления.Окр15как20);	
				
			Иначе	   
				// дни
				ДобавленнаяСтрока[мИдГруппы8+"Дней"]  = СтрокаСпецСтажа.Результат;	
				
			КонецЕсли;
			
			ДобавленнаяСтрока[мИдГруппы8+"Норма"] = СтрокаСпецСтажа.Норма;
			ДобавленнаяСтрока[мИдГруппы8+"СЕЗОН"] = СтрокаСпецСтажа.Сезонность;
			
		КонецЦикла;   
		
	ИначеЕсли НЕ Метаданные.РегистрыСведений.Найти("НачальныеСведенияОСтажеРаботниковОрганизации") = Неопределено Тогда
		
		Запрос = Новый Запрос();
		Запрос.Текст = "
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СпецСтаж.ФизЛицо,
		|	СпецСтаж.ФизЛицо.КодПоДРФО КАК ДРФО,
		|	СпецСтаж.ВидСтажа.ОснованиеЛьготногоСтажа.КодПФ КАК Основание,
		//|	СпецСтаж.Период КАК КонецДействия
		//|	СпецСтаж.ДатаСтажа КАК НачалоДействия,
		|	ФИОФизЛицСрезПоследних.Фамилия  КАК ФизЛицоФамилия,
		|	ФИОФизЛицСрезПоследних.Имя	    КАК ФизЛицоИмя,
		|	ФИОФизЛицСрезПоследних.Отчество КАК ФизЛицоОтчество
		|ИЗ
		|	РегистрСведений.НачальныеСведенияОСтажеРаботниковОрганизации КАК СпецСтаж
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних(&Дата, ) КАК ФИОФизЛицСрезПоследних
		|		ПО СпецСтаж.ФизЛицо = ФИОФизЛицСрезПоследних.ФизЛицо
		|ГДЕ
		|	  СпецСтаж.ВидСтажа.ЛьготныйСтаж
		//|	И СпецСтаж.Период    >= &ДатаКон
		//|	И СпецСтаж.ДатаСтажа <= &ДатаНач
		|	И СпецСтаж.Организация = &Организация
		|	И НЕ СпецСтаж.ФизЛицо.ЭтоГруппа
		|";
		
		Запрос.УстановитьПараметр("Организация", Организация);
		Запрос.УстановитьПараметр("Дата", мДатаКонцаПериодаОтчета);
		
		ТаблицаСпецСтажа = Запрос.Выполнить().Выгрузить();
		
		// теперь заполним таблицу 8
		мСтруктураМногострочныхРазделов.Свойство(мИдГруппы8, СтруктураГруппы8);
		мСтруктураИсхКолвоСтрокРазделов.Свойство(мИдГруппы8, ИсходноеКоличествоСтрокГруппы8);	
		
		НомСтроки = 1;
		Для каждого СтрокаСпецСтажа Из ТаблицаСпецСтажа Цикл
			
			Список.Добавить(СтрокаСпецСтажа.ФизЛицо, СтрокаСпецСтажа.Основание);	

			Если НомСтроки <= ИсходноеКоличествоСтрокГруппы8 Тогда
				ДобавленнаяСтрока = СтруктураГруппы8[НомСтроки - 1];
			Иначе
				ДобавленнаяСтрока = СтруктураГруппы8.Добавить();	
			КонецЕсли;
	        НомСтроки = НомСтроки + 1;
			
	        ДобавленнаяСтрока[мИдГруппы8+"ДРФО"] 			= СтрокаСпецСтажа.ДРФО;
			
			ДобавленнаяСтрока[мИдГруппы8+"ФИО"] 			= СтрокаСпецСтажа.ФизЛицоФамилия;
			ДобавленнаяСтрока[мИдГруппы8+"Имя"] 			= СтрокаСпецСтажа.ФизЛицоИмя;		
			ДобавленнаяСтрока[мИдГруппы8+"Отчество"]        = СтрокаСпецСтажа.ФизЛицоОтчество;		
			
			ДобавленнаяСтрока[мИдГруппы8+"КодОснования"]	= СтрокаСпецСтажа.Основание;
			
			ДатаНач = мДатаНачалаПериодаОтчета;
			ДатаКон = мДатаКонцаПериодаОтчета;
			Дней    = День(мДатаКонцаПериодаОтчета);
			СтрокаПриемаУвольнений = ТаблицаПриемовУвольнений.Найти(СтрокаСпецСтажа.Физлицо);
			Если НЕ СтрокаПриемаУвольнений = Неопределено Тогда
				ДатаПриема     = СтрокаПриемаУвольнений.ДатаПриема;
				ДатаУвольнения = СтрокаПриемаУвольнений.ДатаУвольнения;
				Если НЕ ЗначениеЗаполнено(ДатаПриема)
					  И ЗначениеЗаполнено(ДатаУвольнения) Тогда
					// было увольнение
					ДатаКон = ДатаУвольнения;
					Дней    = День(ДатаУвольнения);					
				ИначеЕсли    ЗначениеЗаполнено(ДатаПриема)
					    И НЕ ЗначениеЗаполнено(ДатаУвольнения) Тогда
					// был прием
					ДатаНач = ДатаПриема;
					Дней = День(мДатаКонцаПериодаОтчета) - День(ДатаПриема) + 1;					
				ИначеЕсли ЗначениеЗаполнено(ДатаПриема)
					    И ЗначениеЗаполнено(ДатаУвольнения) Тогда
					// два варианта: был уволен, потом вновь принят; 
					//				 в начале принят, потом уволен	
					Если ДатаПриема <= ДатаУвольнения Тогда
						//в начале принят, потом уволен
						ДатаНач = ДатаПриема;
						ДатаКон = ДатаУвольнения;
						Дней = День(ДатаУвольнения) - День(ДатаПриема) + 1;					
					Иначе	
					    // был уволен, потом вновь принят;
						// значит на начало и конец месяца он работал - поэтому даты начала и конца совпадают
						// с границами периода.
						
						// но отработано дней здесь по-другому рассчитываются
						Дней = День(ДатаУвольнения) + (День(мДатаКонцаПериодаОтчета) - День(ДатаПриема) + 1);
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			ДобавленнаяСтрока[мИдГруппы8+"ДатаНач"] 	= ДатаНач;
	        ДобавленнаяСтрока[мИдГруппы8+"ДатаКон"]		= ДатаКон;
			ДобавленнаяСтрока[мИдГруппы8+"Дней"]  		= Дней;
			
			ДобавленнаяСтрока[мИдГруппы8+"Норма"] 		= День(мДатаКонцаПериодаОтчета);
			ДобавленнаяСтрока[мИдГруппы8+"СЕЗОН"]		= 1;
			
		КонецЦикла;	
		
	Иначе	
		
		// в Данной конфигурации нет такого регистра сведений - заполнить данные о спец. стаже не представляется возможным
		Возврат Список;	
	КонецЕсли;
	
	ВывестиРазделВТабличныйДокумент(мИдГруппы8, СтруктураГруппы8);	
	
	Возврат Список;

КонецФункции

Функция  СформироватьСписокТрудовыхОтношенийТаблица5()
	
	перем Работавшие, СтруктураГруппы, КоличествоСтрокВГруппе;
	
	ТаблицаПриемовУвольнений = Новый ТаблицаЗначений();
	ТаблицаПриемовУвольнений.Колонки.Добавить("ФизЛицо",        Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица"));
	ТаблицаПриемовУвольнений.Колонки.Добавить("ДатаПриема",     Новый ОписаниеТипов("Дата"));
	ТаблицаПриемовУвольнений.Колонки.Добавить("ДатаУвольнения", Новый ОписаниеТипов("Дата"));
	
	Работавшие = ПолучитьСписокЛиц();

	Номер = 1;
	
	мСтруктураМногострочныхРазделов.Свойство(мИдГруппы5, СтруктураГруппы);
    мСтруктураИсхКолвоСтрокРазделов.Свойство(мИдГруппы5, КоличествоСтрокВГруппе);
	
	Для Каждого стр ИЗ Работавшие Цикл
		
		ДатаНач = Неопределено;
		ДатаКон = Неопределено;
		
		Если стр.СтавокНаНачало <= 0 И стр.СтавокНаКонец <= 0
			И ЗначениеЗаполнено(Стр.ДатаПриема)     И (Стр.ДатаПриема <= мДатаКонцаПериодаОтчета)
			И ЗначениеЗаполнено(Стр.ДатаУвольнения) И (Стр.ДатаУвольнения - 1 >= мДатаНачалаПериодаОтчета) И (Стр.ДатаУвольнения - 1 <= мДатаКонцаПериодаОтчета) Тогда
			ДатаНач = Стр.ДатаПриема;
			ДатаКон = Стр.ДатаУвольнения - 1;
			
		ИначеЕсли стр.СтавокНаНачало <= 0 И стр.СтавокНаКонец > 0 
		   И ЗначениеЗаполнено(Стр.ДатаПриема) И (Стр.ДатаПриема <= мДатаКонцаПериодаОтчета) Тогда
			ДатаНач = Стр.ДатаПриема;
		ИначеЕсли стр.СтавокНаНачало > 0 И стр.СтавокНаКонец <= 0 
				И ЗначениеЗаполнено(Стр.ДатаУвольнения) И (Стр.ДатаУвольнения - 1 >= мДатаНачалаПериодаОтчета) И (Стр.ДатаУвольнения - 1 <= мДатаКонцаПериодаОтчета) Тогда
			ДатаКон = Стр.ДатаУвольнения - 1;
			
		ИначеЕсли стр.СтавокНаНачало > 0 И стр.СтавокНаКонец > 0
			    И ЗначениеЗаполнено(Стр.ДатаУвольнения) И (Стр.ДатаУвольнения - 1 >= мДатаНачалаПериодаОтчета) И (Стр.ДатаУвольнения - 1 <= мДатаКонцаПериодаОтчета)
				И ЗначениеЗаполнено(Стр.ДатаПриема)     И (Стр.ДатаПриема <= мДатаКонцаПериодаОтчета) Тогда				
			// увольнение и прием в течение месяца				
			ДатаНач = Стр.ДатаПриема;
			ДатаКон = Стр.ДатаУвольнения - 1;
			
		ИначеЕсли НЕ Стр.ИзменилосьФИО	Тогда
			Продолжить;
		КонецЕсли;
		
		Если  ЗначениеЗаполнено(ДатаНач) 
			И ЗначениеЗаполнено(ДатаКон)
			И НачалоДня(ДатаНач) = НачалоДня(ДатаКон) Тогда
		    // прием и увольнение в один день - отражать нечего
			Продолжить;	
		КонецЕсли;
		
		СтрокаТаблицыПриемовУвольнений = ТаблицаПриемовУвольнений.Добавить();
		СтрокаТаблицыПриемовУвольнений.ФизЛицо        = стр.ФизЛицо;
		СтрокаТаблицыПриемовУвольнений.ДатаПриема     = ДатаНач;
		СтрокаТаблицыПриемовУвольнений.ДатаУвольнения = ДатаКон;
			
		Если (Номер > КоличествоСтрокВГруппе) Тогда
			ВставитьДополнительнуюСтроку(мИдГруппы5);
		КонецЕсли;
		
		мТаблица5.Области[мИдГруппы5 + Формат(Номер,"ЧЦ=4;ЧВН=0;ЧГ=;") + "ДРФО"].Значение       = стр.КодПоДРФО;
		мТаблица5.Области[мИдГруппы5 + Формат(Номер,"ЧЦ=4;ЧВН=0;ЧГ=;") + "Фамилия"].Значение    = стр.Фамилия;
		мТаблица5.Области[мИдГруппы5 + Формат(Номер,"ЧЦ=4;ЧВН=0;ЧГ=;") + "Имя"].Значение 		= стр.Имя;
		мТаблица5.Области[мИдГруппы5 + Формат(Номер,"ЧЦ=4;ЧВН=0;ЧГ=;") + "Отчество"].Значение   = стр.Отчество;
		
		мТаблица5.Области[мИдГруппы5 + Формат(Номер,"ЧЦ=4;ЧВН=0;ЧГ=;") + "ДатаНач"].Значение   = ДатаНач;
		мТаблица5.Области[мИдГруппы5 + Формат(Номер,"ЧЦ=4;ЧВН=0;ЧГ=;") + "ДатаКон"].Значение   = ДатаКон;
		
		Номер = Номер + 1;
		
	КонецЦикла;
	
	ОбновитьСтруктуруМногострочныхРазделов();	
	
	Возврат ТаблицаПриемовУвольнений;
	
КонецФункции	

Процедура СформироватьНачисленияВзносыТаблица6Таблица7(СписокРаботниковСоСпецСтажем)
	
	Перем 	СтруктураГруппы6, ИсходноеКоличествоСтрокГруппы6;
	Перем 	СтруктураГруппы7, ИсходноеКоличествоСтрокГруппы7;
	
	Запрос = Новый Запрос();
	Запрос.Параметры.Вставить("ПериодОтчета", НачалоМесяца(мДатаКонцаПериодаОтчета));
	Запрос.Параметры.Вставить("Организация", Организация);
	Запрос.Параметры.Вставить("Пенсионный", Справочники.Налоги.Пенсионный);
	
	ВзносыФОТПенсионный = Новый Массив();
	ВзносыФОТПенсионный.Добавить(Справочники.Налоги.ПенсионныйФОТИнв);		
	ВзносыФОТПенсионный.Добавить(Справочники.Налоги.ПенсионныйФОТЛет);
	ВзносыФОТПенсионный.Добавить(Справочники.Налоги.ПенсионныйФОТ);
	Запрос.Параметры.Вставить("ВзносыФОТПенсионный", ВзносыФОТПенсионный);
	
	СЗ = Новый СписокЗначений();
	СЗ.Добавить(Справочники.Налоги.Пенсионный);
	СЗ.Добавить(Справочники.Налоги.Пенсионный1_5);
	Запрос.Параметры.Вставить("НалогиПенсионный", СЗ);
	
	Запрос.Параметры.Вставить("Отпуска", СписокОтпусков());
	Запрос.Параметры.Вставить("БольничныеПредприятие", СписокБольничных());
	
	Запрос.Параметры.Вставить("БольничныеФСС", СписокБольничных(истина));
	
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Базовые.ВидРасчета 
	|ИЗ 
	|	ПланВидовРасчета.ВзносыВФонды.БазовыеВидыРасчета КАК Базовые
	|ГДЕ
	|	Базовые.Ссылка В (ВЫБРАТЬ ВидРасчета ИЗ РегистрСведений.ВидыРасчетовВзносовВФонды.СрезПоследних(&ПериодОтчета, Налог В (&НалогиПенсионный)))
	|";
	
	ОблагаемоеПенсионным = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ВидРасчета"); 
	Запрос.Параметры.Вставить("ОблагаемоеПенсионным", ОблагаемоеПенсионным);
	
	ТекстЗапросаВзносыВФондыРаботниковОрганизаци = 
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Сотрудник,
	|	МАКСИМУМ(ВзносыВФондыРаботниковОрганизаций.Налог) КАК Налог
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВложенныйЗапрос.Сотрудник КАК Сотрудник,
	|		МАКСИМУМ(ВложенныйЗапрос.Период) КАК ПериодПоследнейЗаписи
	|	ИЗ
	|		(ВЫБРАТЬ
	|			ВзносыВФондыРаботниковОрганизаций.Период КАК Период,
	|			ВзносыВФондыРаботниковОрганизаций.Сотрудник КАК Сотрудник,
	|			ВзносыВФондыРаботниковОрганизаций.Налог КАК НАЛОГ
	|		ИЗ
	|			РегистрСведений.ВзносыВФондыРаботниковОрганизаций КАК ВзносыВФондыРаботниковОрганизаций
	|		ГДЕ
	|			ВзносыВФондыРаботниковОрганизаций.Организация = &Организация
	|			И ВзносыВФондыРаботниковОрганизаций.Период <= КОНЕЦПЕРИОДА(&ПериодОтчета, МЕСЯЦ)
	|			И ВзносыВФондыРаботниковОрганизаций.Налог В(&ВзносыФОТПенсионный)
	|			И ВзносыВФондыРаботниковОрганизаций.Актуальность = ИСТИНА) КАК ВложенныйЗапрос
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ВложенныйЗапрос.Сотрудник) КАК ВложенныйЗапрос
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВзносыВФондыРаботниковОрганизаций КАК ВзносыВФондыРаботниковОрганизаций
	|		ПО (ВзносыВФондыРаботниковОрганизаций.Организация = &Организация)
	|			И (ВзносыВФондыРаботниковОрганизаций.Период = ВложенныйЗапрос.ПериодПоследнейЗаписи)
	|			И (ВзносыВФондыРаботниковОрганизаций.Налог В (&ВзносыФОТПенсионный))
	|			И (ВзносыВФондыРаботниковОрганизаций.Сотрудник = ВложенныйЗапрос.Сотрудник)
	|			И (ВзносыВФондыРаботниковОрганизаций.Актуальность = ИСТИНА)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Сотрудник";
	
	//Тексты запросов для ЗУП и УПП
	//Для УТП и БП модифицируются ниже по коду
	ТекстТаблица6 = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|		ВзносыВФонды.Сотрудник,
	|		ВЫБОР КОГДА ВзносыВФонды.Сотрудник.ВидЗанятости = ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.ОсновноеМестоРаботы) ТОГДА 1 Иначе 0 КОНЕЦ КАК ПризнакНаличияТрудовойКнижки, 
	
	|		ВЫБОР КОГДА ЕстьNULL(ВзносыВФондыРаботниковОрганизаций.Налог,0) = ЗНАЧЕНИЕ (Справочник.Налоги.ПенсионныйФОТЛет)ТОГДА 3
	|			  КОГДА ЕстьNULL(ВзносыВФондыРаботниковОрганизаций.Налог,0) = ЗНАЧЕНИЕ (Справочник.Налоги.ПенсионныйФОТИнв)ТОГДА 2
	| 			  ИНАЧЕ 1 
	|		КОНЕЦ КАК КодКатегории,
	
	|		ВЫБОР КОГДА ЕстьNULL(ВзносыВФондыРаботниковОрганизаций.Налог,0) = ЗНАЧЕНИЕ (Справочник.Налоги.ПенсионныйФОТИнв)ТОГДА 2
	| 			  ИНАЧЕ 1 
	|		КОНЕЦ КАК КодТипаСтавки,
	
	|		ВЫБОР
	|			КОГДА ФИОФизЛиц.ФизЛицо ЕСТЬ NULL 
	|				ТОГДА ВзносыВФонды.Сотрудник.Физлицо.Наименование
	|			ИНАЧЕ ФИОФизЛиц.Фамилия
	|		КОНЕЦ              КАК ФизЛицоФио,
	|		ФИОФизЛиц.Имя 	   КАК ФизЛицоИмя,
	|		ФИОФизЛиц.Отчество КАК ФизЛицоОтчество,
	
	|		ВзносыВФонды.Сотрудник.ФизЛицо.КодПоДРФО КАК ДРФО,
	|		Начисления.Результат,
	|		ВЫБОР
	|		 КОГДА Начисления.Результат < ВзносыВФонды.БазаВзноса
	|		  ТОГДА Начисления.Результат
	|		  ИНАЧЕ ВзносыВФонды.БазаВзноса
	|		КОНЕЦ КАК РезультатСПределом,
	|		ВзносыВФонды.Результат+ЕСТЬNULL(ВзносыВФондыБудущихПериодов.Результат,0) КАК Налог  
	|
	|	ИЗ
	|		(ВЫБРАТЬ 
	|		   ВзносыВФонды.Сотрудник,
	|		   СУММА(ВзносыВФонды.БазаВзноса) КАК БазаВзноса,
	|		   СУММА(ВзносыВФонды.Результат) КАК Результат
	|		 ИЗ	
	|			РегистрРасчета.ВзносыВФонды КАК ВзносыВФонды
	|		 ГДЕ
	|			ВзносыВФонды.Организация = &Организация
	|			И ВзносыВФонды.ПериодРегистрации = &ПериодОтчета
	|			И НАЧАЛОПЕРИОДА(ВзносыВФонды.БазовыйПериодНачало,МЕСЯЦ) = &ПериодОтчета
	|		 	И ВзносыВФонды.ВидРасчета В (ВЫБРАТЬ ВидРасчета ИЗ РегистрСведений.ВидыРасчетовВзносовВФонды.СрезПоследних(&ПериодОтчета, Налог В (&НалогиПенсионный)))	
	|		 СГРУППИРОВАТЬ ПО
	|		 	ВзносыВФонды.Сотрудник
	|		) КАК ВзносыВФонды
	|		ЛЕВОЕ СОЕДИНЕНИЕ
	|		(ВЫБРАТЬ
	|			ОсновныеНачисленияРаботниковОрганизаций.ПериодРегистрации,
	|			ОсновныеНачисленияРаботниковОрганизаций.Организация,
	|			ОсновныеНачисленияРаботниковОрганизаций.Сотрудник,
	|			СУММА(ОсновныеНачисленияРаботниковОрганизаций.Результат) КАК Результат
	|		ИЗ
	|			РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК ОсновныеНачисленияРаботниковОрганизаций
	|		ГДЕ
	|			ОсновныеНачисленияРаботниковОрганизаций.Организация = &Организация
	|			И ОсновныеНачисленияРаботниковОрганизаций.ПериодРегистрации = &ПериодОтчета
	|			И ОсновныеНачисленияРаботниковОрганизаций.ПериодДействия = &ПериодОтчета
	|			И ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета В (&ОблагаемоеПенсионным)
	|			И ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета НЕ В (&Отпуска)
	|			И ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета НЕ В (&БольничныеПредприятие)
	|			И ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета НЕ В (&БольничныеФСС)   	
	|		СГРУППИРОВАТЬ ПО
	|			ОсновныеНачисленияРаботниковОрганизаций.ПериодРегистрации,
	|			ОсновныеНачисленияРаботниковОрганизаций.Организация,
	|			ОсновныеНачисленияРаботниковОрганизаций.Сотрудник
	|		) КАК Начисления	
	|		ПО Начисления.Сотрудник = ВзносыВФонды.Сотрудник
	|       ЛЕВОЕ СОЕДИНЕНИЕ
	|		(ВЫБРАТЬ 
	|		   ВзносыВФонды.Сотрудник,
	|		   СУММА(ВзносыВФонды.БазаВзноса) КАК БазаВзноса,
	|		   СУММА(ВзносыВФонды.Результат) КАК Результат
	|		 ИЗ	
	|			РегистрРасчета.ВзносыВФонды КАК ВзносыВФонды
	|		 ГДЕ
	|			ВзносыВФонды.Организация = &Организация
	|			И ВзносыВФонды.ПериодРегистрации = &ПериодОтчета
	|			И НАЧАЛОПЕРИОДА(ВзносыВФонды.БазовыйПериодНачало,МЕСЯЦ) > &ПериодОтчета
	|		 	И ВзносыВФонды.ВидРасчета В (ВЫБРАТЬ ВидРасчета ИЗ РегистрСведений.ВидыРасчетовВзносовВФонды.СрезПоследних(&ПериодОтчета, Налог В (&НалогиПенсионный)))	
	|		 СГРУППИРОВАТЬ ПО
	|		 	ВзносыВФонды.Сотрудник
	|		) КАК ВзносыВФондыБудущихПериодов
    |		ПО ВзносыВФонды.Сотрудник = ВзносыВФондыБудущихПериодов.Сотрудник
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|		РегистрСведений.ФиоФизЛиц.СрезПоследних(КОНЕЦПЕРИОДА(&ПериодОтчета,МЕСЯЦ)) КАК ФИОФизЛиц
	|		ПО ВзносыВФонды.Сотрудник.ФизЛицо = ФИОФизЛиц.ФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|            ("+ТекстЗапросаВзносыВФондыРаботниковОрганизаци+") КАК ВзносыВФондыРаботниковОрганизаций
	|			ПО ВзносыВФонды.Сотрудник = ВзносыВФондыРаботниковОрганизаций.Сотрудник 
	|
	|		ГДЕ 
	|			ВзносыВФонды.Результат+ЕСТЬNULL(ВзносыВФондыБудущихПериодов.Результат,0)<>0
	|УПОРЯДОЧИТЬ ПО ФизЛицоФио
	|";

	ТекстТаблица61 = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|		ВЫБОР КОГДА ВзносыВФонды.Сотрудник.ВидЗанятости = ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.ОсновноеМестоРаботы) ТОГДА 1 Иначе 0 КОНЕЦ КАК ПризнакНаличияТрудовойКнижки, 
	|		ВЫБОР КОГДА ЕстьNULL(ВзносыВФондыРаботниковОрганизаций.Налог,0) = ЗНАЧЕНИЕ (Справочник.Налоги.ПенсионныйФОТЛет)ТОГДА 3
	|			  КОГДА ЕстьNULL(ВзносыВФондыРаботниковОрганизаций.Налог,0) = ЗНАЧЕНИЕ (Справочник.Налоги.ПенсионныйФОТИнв)ТОГДА 2
	| 			  ИНАЧЕ 1 
	|		КОНЕЦ КАК КодКатегории,
	|		ВЫБОР КОГДА ЕстьNULL(ВзносыВФондыРаботниковОрганизаций.Налог,0) = ЗНАЧЕНИЕ (Справочник.Налоги.ПенсионныйФОТИнв)ТОГДА 2
	| 			  ИНАЧЕ 1 
	|		КОНЕЦ КАК КодТипаСтавки,
	|		ВЫБОР
	|			КОГДА ФИОФизЛиц.ФизЛицо ЕСТЬ NULL 
	|				ТОГДА ВзносыВФонды.Сотрудник.Физлицо.Наименование
	|			ИНАЧЕ ФИОФизЛиц.Фамилия
	|		КОНЕЦ              КАК ФизЛицоФио,
	|		ФИОФизЛиц.Имя      КАК ФизЛицоИмя,
	|		ФИОФизЛиц.Отчество КАК ФизЛицоОтчество,
	|		ВзносыВФонды.Сотрудник.ФизЛицо.КодПоДРФО КАК ДРФО,
	|			ВзносыВФонды.Сотрудник,
	|			ВзносыВФонды.ПериодДействия  КАК ПериодДействия,
	|			ЕСТЬNULL(ВзносыВФонды.Результат,0) КАК Налог,
	|			ЕСТЬNULL(ВзносыВФонды.БазаВзноса,0) КАК ВсегоУчтено,
	|			ЕСТЬNULL(ВзносыВФонды.База,0) КАК НачисленоВсего,
	|			ЕСТЬNULL(Начисления45.Результат,0) КАК Начислено45,
	|			ЕСТЬNULL(Начисления1.Результат,0) КАК Начислено1,
	|			ЕСТЬNULL(Начисления2.Результат,0) КАК Начислено2,
	|			ЕСТЬNULL(Начисления6.Результат,0) КАК Начислено6,
	|           0 КАК НалогБольничные,
	|           0 КАК Учтено45,
	|           0 КАК Учтено1,
	|           0 КАК Учтено2,
	|           0 КАК Учтено6
	|
	|		ИЗ
	|			(ВЫБРАТЬ 
	|			   ВзносыВФонды.ПериодРегистрации,
	|			   ВзносыВФонды.Организация,
	|			   ВзносыВФонды.Сотрудник,
	|			   НАЧАЛОПЕРИОДА(ВзносыВФонды.БазовыйПериодНачало,МЕСЯЦ) КАК ПериодДействия,
	|			   СУММА(ВзносыВФонды.Результат) КАК Результат,
	|			   СУММА(ВзносыВФонды.БазаВзноса) КАК БазаВзноса,
	|			   СУММА(ВзносыВФонды.База) КАК База
	|			 ИЗ	
	|				РегистрРасчета.ВзносыВФонды КАК ВзносыВФонды
	|			 ГДЕ
	|			 	ВзносыВФонды.Организация = &Организация
	|			 	И ВзносыВФонды.ПериодРегистрации = &ПериодОтчета
	|			 	И НАЧАЛОПЕРИОДА(ВзносыВФонды.БазовыйПериодНачало,МЕСЯЦ) < &ПериодОтчета
	|			 	И ВзносыВФонды.ВидРасчета В (ВЫБРАТЬ ВидРасчета ИЗ РегистрСведений.ВидыРасчетовВзносовВФонды.СрезПоследних(&ПериодОтчета, Налог В (&НалогиПенсионный)))	
	|			 СГРУППИРОВАТЬ ПО
	|			 	ВзносыВФонды.ПериодРегистрации,
	|			 	ВзносыВФонды.Организация,
	|			 	ВзносыВФонды.Сотрудник,
	|			 	НАЧАЛОПЕРИОДА(ВзносыВФонды.БазовыйПериодНачало,МЕСЯЦ)
	|			) КАК ВзносыВФонды
	|			ЛЕВОЕ СОЕДИНЕНИЕ
	|			(ВЫБРАТЬ
	|				ОсновныеНачисленияРаботниковОрганизаций.ПериодРегистрации,
	|				ОсновныеНачисленияРаботниковОрганизаций.Организация,
	|				ОсновныеНачисленияРаботниковОрганизаций.Сотрудник,
	|				ОсновныеНачисленияРаботниковОрганизаций.ПериодДействия  КАК ПериодДействия,
	|				0 КАК ТипНачисления,
	|				СУММА(ОсновныеНачисленияРаботниковОрганизаций.Результат) КАК Результат
	|			ИЗ
	|				РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК ОсновныеНачисленияРаботниковОрганизаций
	|			ГДЕ
	|				ОсновныеНачисленияРаботниковОрганизаций.Организация = &Организация
	|				И ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета В (&ОблагаемоеПенсионным)
	|				И ОсновныеНачисленияРаботниковОрганизаций.ПериодРегистрации = &ПериодОтчета
	|				И ОсновныеНачисленияРаботниковОрганизаций.ПериодДействия < &ПериодОтчета
	|				И НЕ (ОсновныеНачисленияРаботниковОрганизаций.Регистратор ССЫЛКА Документ.НачислениеПоБольничномуЛисту)
	|			СГРУППИРОВАТЬ ПО
	|				ОсновныеНачисленияРаботниковОрганизаций.ПериодРегистрации,
	|				ОсновныеНачисленияРаботниковОрганизаций.Организация,
	|				ОсновныеНачисленияРаботниковОрганизаций.Сотрудник,
	|				ОсновныеНачисленияРаботниковОрганизаций.ПериодДействия,
	|				0
	|			) КАК Начисления45
	|			ПО Начисления45.Сотрудник = ВзносыВФонды.Сотрудник
	|			 И Начисления45.ПериодДействия = ВзносыВФонды.ПериодДействия
	|			ЛЕВОЕ СОЕДИНЕНИЕ
	|			(ВЫБРАТЬ
	|				ОсновныеНачисленияРаботниковОрганизаций.ПериодРегистрации,
	|				ОсновныеНачисленияРаботниковОрганизаций.Организация,
	|				ОсновныеНачисленияРаботниковОрганизаций.Сотрудник,
	|				ОсновныеНачисленияРаботниковОрганизаций.ПериодДействия  КАК ПериодДействия,
	|				0 КАК ТипНачисления,
	|				СУММА(ОсновныеНачисленияРаботниковОрганизаций.Результат) КАК Результат
	|			ИЗ
	|				РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК ОсновныеНачисленияРаботниковОрганизаций
	|			ГДЕ
	|				ОсновныеНачисленияРаботниковОрганизаций.Организация = &Организация
	|				И ОсновныеНачисленияРаботниковОрганизаций.ПериодРегистрации = &ПериодОтчета
	|				И ОсновныеНачисленияРаботниковОрганизаций.ПериодДействия < &ПериодОтчета
	|				И ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета В (&БольничныеПредприятие)
	|			СГРУППИРОВАТЬ ПО
	|				ОсновныеНачисленияРаботниковОрганизаций.ПериодРегистрации,
	|				ОсновныеНачисленияРаботниковОрганизаций.Организация,
	|				ОсновныеНачисленияРаботниковОрганизаций.Сотрудник,
	|				ОсновныеНачисленияРаботниковОрганизаций.ПериодДействия,
	|				0
	|			) КАК Начисления1	
	|			ПО Начисления1.Сотрудник = ВзносыВФонды.Сотрудник
	|			 И Начисления1.ПериодДействия = ВзносыВФонды.ПериодДействия
	|			ЛЕВОЕ СОЕДИНЕНИЕ
	|			(ВЫБРАТЬ
	|				ОсновныеНачисленияРаботниковОрганизаций.ПериодРегистрации,
	|				ОсновныеНачисленияРаботниковОрганизаций.Организация,
	|				ОсновныеНачисленияРаботниковОрганизаций.Сотрудник,
	|				ОсновныеНачисленияРаботниковОрганизаций.ПериодДействия  КАК ПериодДействия,
	|				0 КАК ТипНачисления,
	|				СУММА(ОсновныеНачисленияРаботниковОрганизаций.Результат) КАК Результат
	|			ИЗ
	|				РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК ОсновныеНачисленияРаботниковОрганизаций
	|			ГДЕ
	|				ОсновныеНачисленияРаботниковОрганизаций.Организация = &Организация
	|				И ОсновныеНачисленияРаботниковОрганизаций.ПериодРегистрации = &ПериодОтчета
	|				И ОсновныеНачисленияРаботниковОрганизаций.ПериодДействия < &ПериодОтчета
	|				И ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета В (&БольничныеФСС)
	|			СГРУППИРОВАТЬ ПО
	|				ОсновныеНачисленияРаботниковОрганизаций.ПериодРегистрации,
	|				ОсновныеНачисленияРаботниковОрганизаций.Организация,
	|				ОсновныеНачисленияРаботниковОрганизаций.Сотрудник,
	|				ОсновныеНачисленияРаботниковОрганизаций.ПериодДействия,
	|				0
	|			) КАК Начисления2	
	|			ПО Начисления2.Сотрудник = ВзносыВФонды.Сотрудник
	|			 И Начисления2.ПериодДействия = ВзносыВФонды.ПериодДействия	
	|			ЛЕВОЕ СОЕДИНЕНИЕ
	|			(ВЫБРАТЬ
	|				ОсновныеНачисленияРаботниковОрганизаций.ПериодРегистрации,
	|				ОсновныеНачисленияРаботниковОрганизаций.Организация,
	|				ОсновныеНачисленияРаботниковОрганизаций.Сотрудник,
	|				ОсновныеНачисленияРаботниковОрганизаций.ПериодДействия  КАК ПериодДействия,
	|				0 КАК ТипНачисления,
	|				СУММА(ОсновныеНачисленияРаботниковОрганизаций.Результат) КАК Результат
	|			ИЗ
	|				РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК ОсновныеНачисленияРаботниковОрганизаций
	|			ГДЕ
	|				ОсновныеНачисленияРаботниковОрганизаций.Организация = &Организация
	|				И ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета В (&ОблагаемоеПенсионным)
	|				И ОсновныеНачисленияРаботниковОрганизаций.ПериодРегистрации = &ПериодОтчета
	|				И ОсновныеНачисленияРаботниковОрганизаций.ПериодДействия < &ПериодОтчета
	|				И (ОсновныеНачисленияРаботниковОрганизаций.Регистратор ССЫЛКА Документ.НачислениеПоБольничномуЛисту)
	|				И НЕ ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета В (&БольничныеФСС)
	|				И НЕ ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета В (&БольничныеПредприятие)
	|			СГРУППИРОВАТЬ ПО
	|				ОсновныеНачисленияРаботниковОрганизаций.ПериодРегистрации,
	|				ОсновныеНачисленияРаботниковОрганизаций.Организация,
	|				ОсновныеНачисленияРаботниковОрганизаций.Сотрудник,
	|				ОсновныеНачисленияРаботниковОрганизаций.ПериодДействия,
	|				0
	|			) КАК Начисления6
	|			ПО Начисления6.Сотрудник = ВзносыВФонды.Сотрудник
	|			 И Начисления6.ПериодДействия = ВзносыВФонды.ПериодДействия	
	|	    ЛЕВОЕ СОЕДИНЕНИЕ 
	|		РегистрСведений.ФиоФизЛиц.СрезПоследних(КОНЕЦПЕРИОДА(&ПериодОтчета,МЕСЯЦ)) КАК ФИОФизЛиц
	|		ПО ВзносыВФонды.Сотрудник.ФизЛицо = ФИОФизЛиц.ФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|            ("+ТекстЗапросаВзносыВФондыРаботниковОрганизаци+") КАК ВзносыВФондыРаботниковОрганизаций
	|			ПО ВзносыВФонды.Сотрудник = ВзносыВФондыРаботниковОрганизаций.Сотрудник 
	|";

	
	
	ТекстТаблица71 = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|		Начисления.Сотрудник,
	|		ВЫБОР КОГДА Начисления.Сотрудник.ВидЗанятости = ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.ОсновноеМестоРаботы) ТОГДА 1 Иначе 0 КОНЕЦ КАК ПризнакНаличияТрудовойКнижки, 
	
	|		ВЫБОР КОГДА ЕстьNULL(ВзносыВФондыРаботниковОрганизаций.Налог,0) = ЗНАЧЕНИЕ (Справочник.Налоги.ПенсионныйФОТЛет)ТОГДА 3
	|			  КОГДА ЕстьNULL(ВзносыВФондыРаботниковОрганизаций.Налог,0) = ЗНАЧЕНИЕ (Справочник.Налоги.ПенсионныйФОТИнв)ТОГДА 2
	| 			  ИНАЧЕ 1 
	|		КОНЕЦ КАК КодКатегории,
	
	|		ВЫБОР КОГДА ЕстьNULL(ВзносыВФондыРаботниковОрганизаций.Налог,0) = ЗНАЧЕНИЕ (Справочник.Налоги.ПенсионныйФОТИнв)ТОГДА 2
	| 			  ИНАЧЕ 1 
	|		КОНЕЦ КАК КодТипаСтавки,
	
	|		ВЫБОР
	|			КОГДА ФИОФизЛиц.ФизЛицо ЕСТЬ NULL 
	|				ТОГДА ВзносыВФонды.Сотрудник.Физлицо.Наименование
	|			ИНАЧЕ ФИОФизЛиц.Фамилия
	|		КОНЕЦ              КАК ФизЛицоФио,
	|		ФИОФизЛиц.Имя      КАК ФизЛицоИмя,
	|		ФИОФизЛиц.Отчество КАК ФизЛицоОтчество,

	|		Начисления.Сотрудник.ФизЛицо.КодПоДРФО КАК ДРФО,
	|		Начисления.ПериодДействия,
	|		Начисления.ТипНачисления,
	|		Начисления.Результат КАК Результат,
	|		ВзносыВФонды.БазаВзноса,
	|		0 КАК Налог,
	|		НачисленияПоТаблице6.Результат,
	|		ВЫБОР 
	|		 КОГДА ЕСТЬNULL(НачисленияПоТаблице6.Результат,0) >= ВзносыВФонды.БазаВзноса И Начисления.ПериодДействия = &ПериодОтчета ТОГДА 0 
	|		 КОГДА Начисления.ТипНачисления = 1 ТОГДА
	|		  ВЫБОР
	|		   КОГДА (ЕСТЬNULL(НачисленияПоТаблице6.Результат,0)+ ЕстьNULL(Начисления.Результат, 0)) <= ВзносыВФонды.БазаВзноса
	|		    ТОГДА ЕстьNULL(Начисления.Результат, 0)
	|		    ИНАЧЕ ВзносыВФонды.БазаВзноса - ЕСТЬNULL(НачисленияПоТаблице6.Результат,0)
	|		  КОНЕЦ
	|		 КОГДА Начисления.ТипНачисления = 2 ТОГДА
	|		  ВЫБОР
	|		   КОГДА (ЕСТЬNULL(НачисленияПоТаблице6.Результат,0)+ЕСТЬNULL(НачисленияПоТипу1.Результат,0)+ЕстьNULL(Начисления.Результат, 0)) <= ВзносыВФонды.БазаВзноса
	|		    ТОГДА ЕстьNULL(Начисления.Результат, 0)
	|		    ИНАЧЕ 
	|		     ВЫБОР 
	|		      КОГДА (ВзносыВФонды.БазаВзноса - ЕСТЬNULL(НачисленияПоТаблице6.Результат,0) - ЕСТЬNULL(НачисленияПоТипу1.Результат,0))>0
	|		       ТОГДА ВзносыВФонды.БазаВзноса - ЕСТЬNULL(НачисленияПоТаблице6.Результат,0) - ЕСТЬNULL(НачисленияПоТипу1.Результат,0)
	|		       ИНАЧЕ 0
	|		     КОНЕЦ  
	|		  КОНЕЦ
	|		 КОГДА Начисления.ТипНачисления = 3 И Начисления.ПериодДействия = &ПериодОтчета ТОГДА
	|		  ВЫБОР
	|		   КОГДА (ЕСТЬNULL(НачисленияПоТаблице6.Результат,0)+ЕСТЬNULL(НачисленияПоТипу1.Результат,0)+ЕСТЬNULL(НачисленияПоТипу2.Результат,0)+ЕстьNULL(Начисления.Результат, 0)) <= ВзносыВФонды.БазаВзноса
	|		    ТОГДА ЕстьNULL(Начисления.Результат, 0)
	|	   	    ИНАЧЕ 
	|		     ВЫБОР 
	|		      КОГДА (ВзносыВФонды.БазаВзноса - ЕСТЬNULL(НачисленияПоТаблице6.Результат,0) - ЕСТЬNULL(НачисленияПоТипу1.Результат,0) - ЕСТЬNULL(НачисленияПоТипу2.Результат,0))>0
	|		       ТОГДА ВзносыВФонды.БазаВзноса - ЕСТЬNULL(НачисленияПоТаблице6.Результат,0) - ЕСТЬNULL(НачисленияПоТипу1.Результат,0) - ЕСТЬNULL(НачисленияПоТипу2.Результат,0)
	|		       ИНАЧЕ 0
	|		     КОНЕЦ  
	|		  КОНЕЦ
	|		 ИНАЧЕ Начисления.Результат //Это отпуск за следующий месяц
	|		КОНЕЦ КАК РезультатСПределом
	|	ИЗ
	|		(ВЫБРАТЬ
	|			ОсновныеНачисленияРаботниковОрганизаций.ПериодРегистрации,
	|			ОсновныеНачисленияРаботниковОрганизаций.Организация,
	|			ОсновныеНачисленияРаботниковОрганизаций.Сотрудник,
	|			ОсновныеНачисленияРаботниковОрганизаций.ПериодДействия КАК ПериодДействия,
	|			ВЫБОР 
	|			 КОГДА ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета В (&БольничныеПредприятие)
	|			 ТОГДА 1
	|			 КОГДА ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета В (&БольничныеФСС)
	|			 ТОГДА 2
	|			 ИНАЧЕ 3
	|			КОНЕЦ КАК ТипНачисления, 
	|			СУММА(ОсновныеНачисленияРаботниковОрганизаций.Результат) КАК Результат
	|		ИЗ
	|			РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК ОсновныеНачисленияРаботниковОрганизаций
	|		ГДЕ
	|			ОсновныеНачисленияРаботниковОрганизаций.Организация = &Организация
	|			И ОсновныеНачисленияРаботниковОрганизаций.ПериодРегистрации = &ПериодОтчета
	|			И ОсновныеНачисленияРаботниковОрганизаций.ПериодДействия >= &ПериодОтчета
	|			И (ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета В (&Отпуска)
	|			ИЛИ ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета В (&БольничныеПредприятие)
	|			ИЛИ ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета В (&БольничныеФСС))   	
	|		СГРУППИРОВАТЬ ПО
	|			ОсновныеНачисленияРаботниковОрганизаций.ПериодРегистрации,
	|			ОсновныеНачисленияРаботниковОрганизаций.Организация,
	|			ОсновныеНачисленияРаботниковОрганизаций.Сотрудник,
	|			ОсновныеНачисленияРаботниковОрганизаций.ПериодДействия,
	|			ВЫБОР 
	|			 КОГДА ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета В (&БольничныеПредприятие)
	|			 ТОГДА 1
	|			 КОГДА ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета В (&БольничныеФСС)
	|			 ТОГДА 2
	|			 ИНАЧЕ 3
	|			КОНЕЦ
	|		) КАК Начисления
	|		ЛЕВОЕ СОЕДИНЕНИЕ
	|		(ВЫБРАТЬ
	|			ОсновныеНачисленияРаботниковОрганизаций.ПериодРегистрации,
	|			ОсновныеНачисленияРаботниковОрганизаций.Организация,
	|			ОсновныеНачисленияРаботниковОрганизаций.Сотрудник,
	|			СУММА(ОсновныеНачисленияРаботниковОрганизаций.Результат) КАК Результат
	|		ИЗ
	|			РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК ОсновныеНачисленияРаботниковОрганизаций
	|		ГДЕ
	|			ОсновныеНачисленияРаботниковОрганизаций.Организация = &Организация
	|			И ОсновныеНачисленияРаботниковОрганизаций.ПериодРегистрации = &ПериодОтчета
	|			И ОсновныеНачисленияРаботниковОрганизаций.ПериодДействия = &ПериодОтчета
	|			И ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета В (&ОблагаемоеПенсионным)
	|			И ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета НЕ В (&Отпуска)
	|			И ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета НЕ В (&БольничныеПредприятие)
	|			И ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета НЕ В (&БольничныеФСС)   	
	|		СГРУППИРОВАТЬ ПО
	|			ОсновныеНачисленияРаботниковОрганизаций.ПериодРегистрации,
	|			ОсновныеНачисленияРаботниковОрганизаций.Организация,
	|			ОсновныеНачисленияРаботниковОрганизаций.Сотрудник
	|		) КАК НачисленияПоТаблице6
	|		ПО Начисления.Сотрудник = НачисленияПоТаблице6.Сотрудник
	|		ЛЕВОЕ СОЕДИНЕНИЕ
	|		(ВЫБРАТЬ
	|			ОсновныеНачисленияРаботниковОрганизаций.ПериодРегистрации,
	|			ОсновныеНачисленияРаботниковОрганизаций.Организация,
	|			ОсновныеНачисленияРаботниковОрганизаций.Сотрудник,
	|			СУММА(ОсновныеНачисленияРаботниковОрганизаций.Результат) КАК Результат
	|		ИЗ
	|			РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК ОсновныеНачисленияРаботниковОрганизаций
	|		ГДЕ
	|			ОсновныеНачисленияРаботниковОрганизаций.Организация = &Организация
	|			И ОсновныеНачисленияРаботниковОрганизаций.ПериодРегистрации = &ПериодОтчета
	|			И ОсновныеНачисленияРаботниковОрганизаций.ПериодДействия = &ПериодОтчета
	|			И ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета В (&БольничныеПредприятие)
	|		СГРУППИРОВАТЬ ПО
	|			ОсновныеНачисленияРаботниковОрганизаций.ПериодРегистрации,
	|			ОсновныеНачисленияРаботниковОрганизаций.Организация,
	|			ОсновныеНачисленияРаботниковОрганизаций.Сотрудник
	|		) КАК НачисленияПоТипу1
	|		ПО Начисления.Сотрудник = НачисленияПоТипу1.Сотрудник
	|		ЛЕВОЕ СОЕДИНЕНИЕ
	|		(ВЫБРАТЬ
	|			ОсновныеНачисленияРаботниковОрганизаций.ПериодРегистрации,
	|			ОсновныеНачисленияРаботниковОрганизаций.Организация,
	|			ОсновныеНачисленияРаботниковОрганизаций.Сотрудник,
	|			СУММА(ОсновныеНачисленияРаботниковОрганизаций.Результат) КАК Результат
	|		ИЗ
	|			РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК ОсновныеНачисленияРаботниковОрганизаций
	|		ГДЕ
	|			ОсновныеНачисленияРаботниковОрганизаций.Организация = &Организация
	|			И ОсновныеНачисленияРаботниковОрганизаций.ПериодРегистрации = &ПериодОтчета
	|			И ОсновныеНачисленияРаботниковОрганизаций.ПериодДействия = &ПериодОтчета
	|			И ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета В (&БольничныеФСС)
	|		СГРУППИРОВАТЬ ПО
	|			ОсновныеНачисленияРаботниковОрганизаций.ПериодРегистрации,
	|			ОсновныеНачисленияРаботниковОрганизаций.Организация,
	|			ОсновныеНачисленияРаботниковОрганизаций.Сотрудник
	|		) КАК НачисленияПоТипу2
	|		ПО Начисления.Сотрудник = НачисленияПоТипу2.Сотрудник
	|		ЛЕВОЕ СОЕДИНЕНИЕ
	|		(ВЫБРАТЬ 
	|			   ВзносыВФонды.Сотрудник,
	|			   НАЧАЛОПЕРИОДА(ВзносыВФонды.БазовыйПериодНачало,МЕСЯЦ) КАК ПериодДействия,
	|			   СУММА(ВзносыВФонды.БазаВзноса) КАК БазаВзноса
	|			 ИЗ	
	|				РегистрРасчета.ВзносыВФонды КАК ВзносыВФонды
	|			 ГДЕ
	|				ВзносыВФонды.Организация = &Организация
	|				И ВзносыВФонды.ПериодРегистрации = &ПериодОтчета
	|			 	И ВзносыВФонды.ВидРасчета В (ВЫБРАТЬ ВидРасчета ИЗ РегистрСведений.ВидыРасчетовВзносовВФонды.СрезПоследних(&ПериодОтчета, Налог В (&НалогиПенсионный)))	
	|			СГРУППИРОВАТЬ ПО
	|		 		ВзносыВФонды.Сотрудник,
	|		 		НАЧАЛОПЕРИОДА(ВзносыВФонды.БазовыйПериодНачало,МЕСЯЦ)
	|		) КАК ВзносыВФонды
	|		ПО Начисления.Сотрудник = ВзносыВФонды.Сотрудник
	|		 И Начисления.ПериодДействия = ВзносыВФонды.ПериодДействия
	|	    ЛЕВОЕ СОЕДИНЕНИЕ 
	|		РегистрСведений.ФиоФизЛиц.СрезПоследних(КОНЕЦПЕРИОДА(&ПериодОтчета,МЕСЯЦ)) КАК ФИОФизЛиц
	|		ПО Начисления.Сотрудник.ФизЛицо = ФИОФизЛиц.ФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|            ("+ТекстЗапросаВзносыВФондыРаботниковОрганизаци+") КАК ВзносыВФондыРаботниковОрганизаций
	|			ПО Начисления.Сотрудник = ВзносыВФондыРаботниковОрганизаций.Сотрудник 
	|
	|УПОРЯДОЧИТЬ ПО ФизЛицоФио
	|";

	ТекстБольничныеФОТ = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|			ВзносыВФонды.Сотрудник,
	|			ЕСТЬNULL(ВзносыВФонды.Результат,0) КАК Налог,
	|			ЕСТЬNULL(ВзносыВФонды.БазаВзноса,0) КАК ВсегоУчтено,
	|			ВзносыВФонды.ПериодДействия  КАК ПериодДействия,
	|			ЕСТЬNULL(Начисления.Результат,0) КАК НачисленоВсего,
	|			ЕСТЬNULL(НачисленияБольничные.Результат,0) КАК НачисленоБольничные,
	|           0 КАК НалогБольничные
    |
	|		ИЗ
	|			(ВЫБРАТЬ 
	|			   ВзносыВФонды.ПериодРегистрации,
	|			   ВзносыВФонды.Организация,
	|			   ВзносыВФонды.Сотрудник,
	|			   НАЧАЛОПЕРИОДА(ВзносыВФонды.БазовыйПериодНачало,МЕСЯЦ) КАК ПериодДействия,
	|			   СУММА(ВзносыВФонды.Результат) КАК Результат,
	|			   СУММА(ВзносыВФонды.БазаВзноса) КАК БазаВзноса
	|			 ИЗ	
	|				РегистрРасчета.ВзносыВФонды КАК ВзносыВФонды
	|			 ГДЕ
	|			 	ВзносыВФонды.Организация = &Организация
	|			 	И ВзносыВФонды.ПериодРегистрации = &ПериодОтчета
	|			 	И НАЧАЛОПЕРИОДА(ВзносыВФонды.БазовыйПериодНачало,МЕСЯЦ) < &ПериодОтчета
	|			 	И ВзносыВФонды.ВидРасчета В (ВЫБРАТЬ ВидРасчета ИЗ РегистрСведений.ВидыРасчетовВзносовВФонды.СрезПоследних(&ПериодОтчета, Налог В (&ВзносыФОТПенсионный)))	
	|			 СГРУППИРОВАТЬ ПО
	|			 	ВзносыВФонды.ПериодРегистрации,
	|			 	ВзносыВФонды.Организация,
	|			 	ВзносыВФонды.Сотрудник,
	|			 	НАЧАЛОПЕРИОДА(ВзносыВФонды.БазовыйПериодНачало,МЕСЯЦ)
	|			) КАК ВзносыВФонды
	|			ЛЕВОЕ СОЕДИНЕНИЕ
	|			(ВЫБРАТЬ
	|				ОсновныеНачисленияРаботниковОрганизаций.ПериодРегистрации,
	|				ОсновныеНачисленияРаботниковОрганизаций.Организация,
	|				ОсновныеНачисленияРаботниковОрганизаций.Сотрудник,
	|				ОсновныеНачисленияРаботниковОрганизаций.ПериодДействия  КАК ПериодДействия,
	|				0 КАК ТипНачисления,
	|				СУММА(ОсновныеНачисленияРаботниковОрганизаций.Результат) КАК Результат
	|			ИЗ
	|				РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК ОсновныеНачисленияРаботниковОрганизаций
	|			ГДЕ
	|				ОсновныеНачисленияРаботниковОрганизаций.Организация = &Организация
	|				И ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета В (&ОблагаемоеПенсионным)
	|				И ОсновныеНачисленияРаботниковОрганизаций.ПериодРегистрации = &ПериодОтчета
	|				И ОсновныеНачисленияРаботниковОрганизаций.ПериодДействия < &ПериодОтчета
	|			СГРУППИРОВАТЬ ПО
	|				ОсновныеНачисленияРаботниковОрганизаций.ПериодРегистрации,
	|				ОсновныеНачисленияРаботниковОрганизаций.Организация,
	|				ОсновныеНачисленияРаботниковОрганизаций.Сотрудник,
	|				ОсновныеНачисленияРаботниковОрганизаций.ПериодДействия,
	|				0
	|			) КАК Начисления
	|			ПО Начисления.Сотрудник = ВзносыВФонды.Сотрудник
	|			 И Начисления.ПериодДействия = ВзносыВФонды.ПериодДействия
	|			ЛЕВОЕ СОЕДИНЕНИЕ
	|			(ВЫБРАТЬ
	|				ОсновныеНачисленияРаботниковОрганизаций.ПериодРегистрации,
	|				ОсновныеНачисленияРаботниковОрганизаций.Организация,
	|				ОсновныеНачисленияРаботниковОрганизаций.Сотрудник,
	|				ОсновныеНачисленияРаботниковОрганизаций.ПериодДействия  КАК ПериодДействия,
	|				0 КАК ТипНачисления,
	|				СУММА(ОсновныеНачисленияРаботниковОрганизаций.Результат) КАК Результат
	|			ИЗ
	|				РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК ОсновныеНачисленияРаботниковОрганизаций
	|			ГДЕ
	|				ОсновныеНачисленияРаботниковОрганизаций.Организация = &Организация
	|				И ОсновныеНачисленияРаботниковОрганизаций.ПериодРегистрации = &ПериодОтчета
	|				И ОсновныеНачисленияРаботниковОрганизаций.ПериодДействия < &ПериодОтчета
	|				И (ОсновныеНачисленияРаботниковОрганизаций.Регистратор ССЫЛКА Документ.НачислениеПоБольничномуЛисту)
	|			СГРУППИРОВАТЬ ПО
	|				ОсновныеНачисленияРаботниковОрганизаций.ПериодРегистрации,
	|				ОсновныеНачисленияРаботниковОрганизаций.Организация,
	|				ОсновныеНачисленияРаботниковОрганизаций.Сотрудник,
	|				ОсновныеНачисленияРаботниковОрганизаций.ПериодДействия,
	|				0
	|			) КАК НачисленияБольничные	
	|			ПО НачисленияБольничные.Сотрудник = ВзносыВФонды.Сотрудник
	|			 И НачисленияБольничные.ПериодДействия = ВзносыВФонды.ПериодДействия
	|   ГДЕ
	|          ЕСТЬNULL(НачисленияБольничные.Результат,0) > 0
	|";
	
	ТекстКорректировкиФОТ = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|			ВзносыВФонды.Сотрудник,
	|			ВзносыВФонды.ПериодДействия  КАК ПериодДействия,
	|           ВзносыВФонды.БазаВзноса,
	|			ВзносыВФонды.Результат КАК Результат
    |
	|		ИЗ
	|			(ВЫБРАТЬ 
	|			   ВзносыВФонды.ПериодРегистрации,
	|			   ВзносыВФонды.Организация,
	|			   ВзносыВФонды.Сотрудник,
	|			   НАЧАЛОПЕРИОДА(ВзносыВФонды.БазовыйПериодНачало,МЕСЯЦ) КАК ПериодДействия,
	|			   СУММА(ВзносыВФонды.Результат) КАК Результат,
	|			   СУММА(ВзносыВФонды.БазаВзноса) КАК БазаВзноса
	|			 ИЗ	
	|				РегистрРасчета.ВзносыВФонды КАК ВзносыВФонды
	|			 ГДЕ
	|			 	ВзносыВФонды.Организация = &Организация
	|			 	И ВзносыВФонды.ПериодРегистрации = &ПериодОтчета
	|			 	И НАЧАЛОПЕРИОДА(ВзносыВФонды.БазовыйПериодНачало,МЕСЯЦ) < &ПериодОтчета
	|			 	И ВзносыВФонды.ВидРасчета В (ВЫБРАТЬ ВидРасчета ИЗ РегистрСведений.ВидыРасчетовВзносовВФонды.СрезПоследних(&ПериодОтчета, Налог В (&ВзносыФОТПенсионный)))	
	|			 СГРУППИРОВАТЬ ПО
	|			 	ВзносыВФонды.ПериодРегистрации,
	|			 	ВзносыВФонды.Организация,
	|			 	ВзносыВФонды.Сотрудник,
	|			 	НАЧАЛОПЕРИОДА(ВзносыВФонды.БазовыйПериодНачало,МЕСЯЦ)
	|			) КАК ВзносыВФонды
	|";
	
	Если РегламентированнаяОтчетность.ИДКонфигурации() = "УТП" Тогда
		ТекстТаблица6 = СтрЗаменить(ТекстТаблица6,"РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций","РегистрРасчета.Начисления");
		ТекстТаблица61 = СтрЗаменить(ТекстТаблица61,"РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций","РегистрРасчета.Начисления");
		ТекстТаблица71 = СтрЗаменить(ТекстТаблица71,"РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций","РегистрРасчета.Начисления");
		ТекстКорректировкиФОТ = СтрЗаменить(ТекстКорректировкиФОТ,"РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций","РегистрРасчета.Начисления");
		ТекстБольничныеФОТ = СтрЗаменить(ТекстБольничныеФОТ,"РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций","РегистрРасчета.Начисления");
	ИначеЕсли РегламентированнаяОтчетность.ИДКонфигурации() = "БП" Тогда
		ТекстТаблица6 = СтрЗаменить(ТекстТаблица6,"РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций","РегистрРасчета.Начисления");
		ТекстТаблица61 = СтрЗаменить(ТекстТаблица61,"РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций","РегистрРасчета.Начисления");
		ТекстТаблица71 = СтрЗаменить(ТекстТаблица71,"РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций","РегистрРасчета.Начисления");
		ТекстКорректировкиФОТ = СтрЗаменить(ТекстКорректировкиФОТ,"РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций","РегистрРасчета.Начисления");
		ТекстБольничныеФОТ = СтрЗаменить(ТекстБольничныеФОТ,"РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций","РегистрРасчета.Начисления");
		ТекстТаблица6 = СтрЗаменить(ТекстТаблица6,"РегистрРасчета.ВзносыВФонды","РегистрРасчета.ВзносыВФондыИНалоги");
		ТекстТаблица61 = СтрЗаменить(ТекстТаблица61,"РегистрРасчета.ВзносыВФонды","РегистрРасчета.ВзносыВФондыИНалоги");
		ТекстТаблица71 = СтрЗаменить(ТекстТаблица71,"РегистрРасчета.ВзносыВФонды","РегистрРасчета.ВзносыВФондыИНалоги");
		ТекстКорректировкиФОТ = СтрЗаменить(ТекстКорректировкиФОТ,"РегистрРасчета.ВзносыВФонды","РегистрРасчета.ВзносыВФондыИНалоги");
		ТекстБольничныеФОТ = СтрЗаменить(ТекстБольничныеФОТ,"РегистрРасчета.ВзносыВФонды","РегистрРасчета.ВзносыВФондыИНалоги");
		ТекстТаблица6 = СтрЗаменить(ТекстТаблица6,  "ОсновныеНачисленияРаботниковОрганизаций.ПериодДействия","НАЧАЛОПЕРИОДА(ОсновныеНачисленияРаботниковОрганизаций.ДатаНачала,МЕСЯЦ)");
		ТекстТаблица61 = СтрЗаменить(ТекстТаблица61,  "ОсновныеНачисленияРаботниковОрганизаций.ПериодДействия","НАЧАЛОПЕРИОДА(ОсновныеНачисленияРаботниковОрганизаций.ДатаНачала,МЕСЯЦ)");
		ТекстТаблица71 = СтрЗаменить(ТекстТаблица71,"ОсновныеНачисленияРаботниковОрганизаций.ПериодДействия","НАЧАЛОПЕРИОДА(ОсновныеНачисленияРаботниковОрганизаций.ДатаНачала,МЕСЯЦ)");
		ТекстКорректировкиФОТ = СтрЗаменить(ТекстКорректировкиФОТ,"ОсновныеНачисленияРаботниковОрганизаций.ПериодДействия","НАЧАЛОПЕРИОДА(ОсновныеНачисленияРаботниковОрганизаций.ДатаНачала,МЕСЯЦ)");
		ТекстБольничныеФОТ = СтрЗаменить(ТекстБольничныеФОТ,"ОсновныеНачисленияРаботниковОрганизаций.ПериодДействия","НАЧАЛОПЕРИОДА(ОсновныеНачисленияРаботниковОрганизаций.ДатаНачала,МЕСЯЦ)");
		ТекстТаблица6 = СтрЗаменить(ТекстТаблица6,"ОсновныеНачисленияРаботниковОрганизаций.Регистратор ССЫЛКА Документ.НачислениеПоБольничномуЛисту","ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета В (&БольничныеПредприятие) ИЛИ ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета В (&БольничныеФСС)");
		ТекстТаблица61 = СтрЗаменить(ТекстТаблица61,"ОсновныеНачисленияРаботниковОрганизаций.Регистратор ССЫЛКА Документ.НачислениеПоБольничномуЛисту","ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета В (&БольничныеПредприятие) ИЛИ ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета В (&БольничныеФСС)");
		ТекстТаблица71 = СтрЗаменить(ТекстТаблица71,"ОсновныеНачисленияРаботниковОрганизаций.Регистратор ССЫЛКА Документ.НачислениеПоБольничномуЛисту","ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета В (&БольничныеПредприятие) ИЛИ ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета В (&БольничныеФСС)");
		ТекстКорректировкиФОТ = СтрЗаменить(ТекстКорректировкиФОТ,"ОсновныеНачисленияРаботниковОрганизаций.Регистратор ССЫЛКА Документ.НачислениеПоБольничномуЛисту","ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета В (&БольничныеПредприятие) ИЛИ ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета В (&БольничныеФСС)");
		ТекстБольничныеФОТ = СтрЗаменить(ТекстБольничныеФОТ,"ОсновныеНачисленияРаботниковОрганизаций.Регистратор ССЫЛКА Документ.НачислениеПоБольничномуЛисту","ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета В (&БольничныеПредприятие) ИЛИ ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета В (&БольничныеФСС)");
	КонецЕсли;	

	//////////////////////////////////////////
	// таблица 6
	мСтруктураМногострочныхРазделов.Свойство(мИдГруппы6, СтруктураГруппы6);
	мСтруктураИсхКолвоСтрокРазделов.Свойство(мИдГруппы6, ИсходноеКоличествоСтрокГруппы6);	
	
	Запрос.Текст    = ТекстТаблица6;
	ВыборкаТаблица6 = Запрос.Выполнить().Выбрать();
	
	Запрос.Текст    = ТекстТаблица61;
	ВыборкаТаблица61 = Запрос.Выполнить().Выгрузить(); 
	//Все за предыдущие периоды распределяем по кодам 1,2,4,5,6	
	Для каждого СтрокаВыборки из ВыборкаТаблица61 Цикл
		Если СтрокаВыборки.Начислено1 = 0 И СтрокаВыборки.Начислено2 = 0 И СтрокаВыборки.Начислено6 = 0 Тогда
			//Есть только корректировки, больничных нет
			СтрокаВыборки.Учтено45 = СтрокаВыборки.ВсегоУчтено;
			Продолжить;
		КонецЕсли;
		СтрокаВыборки.НалогБольничные = СтрокаВыборки.Налог;
		Если СтрокаВыборки.Начислено6 <> 0 Тогда
			Если СтрокаВыборки.ВсегоУчтено >= 0 Тогда
				СтрокаВыборки.Учтено6 = СтрокаВыборки.Начислено6;
			ИначеЕсли СтрокаВыборки.ВсегоУчтено >= СтрокаВыборки.Начислено6  Тогда
				СтрокаВыборки.Учтено6 = СтрокаВыборки.ВсегоУчтено;
			Иначе
				СтрокаВыборки.Учтено6 = СтрокаВыборки.Начислено6;
			КонецЕсли;
		КонецЕсли;
		
		Если СтрокаВыборки.ВсегоУчтено > 0 Тогда
			СтрокаВыборки.Учтено1 = МИН(СтрокаВыборки.ВсегоУчтено - СтрокаВыборки.Учтено6,СтрокаВыборки.Начислено1);
            СтрокаВыборки.Учтено2 = МИН(СтрокаВыборки.ВсегоУчтено - СтрокаВыборки.Учтено6 - СтрокаВыборки.Учтено1,СтрокаВыборки.Начислено2);
		КонецЕсли;
		СтрокаВыборки.Учтено45 = СтрокаВыборки.ВсегоУчтено - СтрокаВыборки.Учтено6 - СтрокаВыборки.Учтено1 - СтрокаВыборки.Учтено2;
		
		
	КонецЦикла;
	
	ВыборкаТаблица61Сводно = ВыборкаТаблица61.Скопировать();
	ВыборкаТаблица61Сводно.Свернуть("Сотрудник","НалогБольничные");

	
	НомСтроки = 1;
	Пока ВыборкаТаблица6.Следующий() Цикл

		Если НомСтроки <= ИсходноеКоличествоСтрокГруппы6 Тогда
			ДобавленнаяСтрока = СтруктураГруппы6[НомСтроки - 1];
		Иначе
			ДобавленнаяСтрока = СтруктураГруппы6.Добавить();	
		КонецЕсли;
        НомСтроки = НомСтроки + 1;
		
        ДобавленнаяСтрока[мИдГруппы6+"ДРФО"] 			= ВыборкаТаблица6.ДРФО;
		
		ДобавленнаяСтрока[мИдГруппы6+"ФИО"] 			= ВыборкаТаблица6.ФизЛицоФио;
		ДобавленнаяСтрока[мИдГруппы6+"Имя"] 			= ВыборкаТаблица6.ФизЛицоИмя;		
		ДобавленнаяСтрока[мИдГруппы6+"Отчество"]        = ВыборкаТаблица6.ФизЛицоОтчество;		
		
		ДобавленнаяСтрока[мИдГруппы6+"Категория"] 	= ВыборкаТаблица6.КодКатегории;
        ДобавленнаяСтрока[мИдГруппы6+"ТипСтавки"] 	= ВыборкаТаблица6.КодТипаСтавки;
        ДобавленнаяСтрока[мИдГруппы6+"СуммаНачислено"]= ВыборкаТаблица6.Результат;
        ДобавленнаяСтрока[мИдГруппы6+"СуммаНачисленоМаксБаза"] = ВыборкаТаблица6.РезультатСПределом;
		КорректировкаБольничных = ВыборкаТаблица61Сводно.Найти(ВыборкаТаблица6.Сотрудник,"Сотрудник");
		Если КорректировкаБольничных = Неопределено Тогда
			ДобавленнаяСтрока[мИдГруппы6+"СуммаВзносов"]  = ВыборкаТаблица6.Налог;
		Иначе
			ДобавленнаяСтрока[мИдГруппы6+"СуммаВзносов"]  = ВыборкаТаблица6.Налог + КорректировкаБольничных.НалогБольничные;
		КонецЕсли;	
        ДобавленнаяСтрока[мИдГруппы6+"ТрудКнижка"] 	= ВыборкаТаблица6.ПризнакНаличияТрудовойКнижки;
		
		Если ДобавленнаяСтрока[мИдГруппы6+"СуммаНачислено"] = 0 Тогда
			ДобавленнаяСтрока[мИдГруппы6+"СуммаНачисленоМаксБаза"] = 0;
		КонецЕсли;
		
		Если НЕ СписокРаботниковСоСпецСтажем.НайтиПоЗначению(ВыборкаТаблица6.Сотрудник.ФизЛицо) = Неопределено Тогда
			ДобавленнаяСтрока[мИдГруппы6+"СпецСтаж"] = 1;
		КонецЕсли;
		
	КонецЦикла;	
	ВывестиРазделВТабличныйДокумент(мИдГруппы6, СтруктураГруппы6);	
	
	//////////////////////////////////////////
	// таблица 7
	мСтруктураМногострочныхРазделов.Свойство(мИдГруппы7, СтруктураГруппы7);
	мСтруктураИсхКолвоСтрокРазделов.Свойство(мИдГруппы7, ИсходноеКоличествоСтрокГруппы7);	
	
	Запрос.Текст = ТекстТаблица71;
	ВыборкаТаблица7 = Запрос.Выполнить().Выбрать(); 
	НомСтроки = 1;
	Пока ВыборкаТаблица7.Следующий() Цикл

		ВыборкаТаблица7Результат 			= ?(ВыборкаТаблица7.Результат = NULL, 			0,ВыборкаТаблица7.Результат);
		ВыборкаТаблица7РезультатСПределом 	= ?(ВыборкаТаблица7.РезультатСПределом = NULL, 	0,ВыборкаТаблица7.РезультатСПределом);
		ВыборкаТаблица7Налог 				= ?(ВыборкаТаблица7.Налог = NULL, 				0,ВыборкаТаблица7.Налог);
		
		Если  ВыборкаТаблица7Результат = 0
			И ВыборкаТаблица7РезультатСПределом = 0 
			И ВыборкаТаблица7Налог = 0 Тогда
		
			Продолжить	
		
		КонецЕсли;
		
		Если НомСтроки <= ИсходноеКоличествоСтрокГруппы7 Тогда
			ДобавленнаяСтрока = СтруктураГруппы7[НомСтроки - 1];
		Иначе
			ДобавленнаяСтрока = СтруктураГруппы7.Добавить();	
		КонецЕсли;
        НомСтроки = НомСтроки + 1;
		
        ДобавленнаяСтрока[мИдГруппы7+"ДРФО"] 			= ВыборкаТаблица7.ДРФО;
		
		ДобавленнаяСтрока[мИдГруппы7+"ФИО"] 			= ВыборкаТаблица7.ФизЛицоФио;
		ДобавленнаяСтрока[мИдГруппы7+"Имя"] 			= ВыборкаТаблица7.ФизЛицоИмя;		
		ДобавленнаяСтрока[мИдГруппы7+"Отчество"]        = ВыборкаТаблица7.ФизЛицоОтчество;		
		
		ДобавленнаяСтрока[мИдГруппы7+"Категория"] 	= ВыборкаТаблица7.КодКатегории;
        ДобавленнаяСтрока[мИдГруппы7+"ТипСтавки"] 	= ВыборкаТаблица7.КодТипаСтавки;
		
        ДобавленнаяСтрока[мИдГруппы7+"МесяцНачисления"] 	= НачалоМесяца(ВыборкаТаблица7.ПериодДействия);
        ДобавленнаяСтрока[мИдГруппы7+"ТипНачисления"] 	= ВыборкаТаблица7.ТипНачисления;
		
		// суммы выводятся только со знаком "+"
		ДобавленнаяСтрока[мИдГруппы7+"СуммаНачислено"]			= МАКС(ВыборкаТаблица7Результат			    , - ВыборкаТаблица7Результат);
        ДобавленнаяСтрока[мИдГруппы7+"СуммаНачисленоМаксБаза"] 	= МАКС(ВыборкаТаблица7РезультатСПределом	, - ВыборкаТаблица7РезультатСПределом);
        ДобавленнаяСтрока[мИдГруппы7+"СуммаВзносов"]  			= МАКС(ВыборкаТаблица7Налог				    , - ВыборкаТаблица7Налог);
		
		ДобавленнаяСтрока[мИдГруппы7+"ТрудКнижка"] 				= ВыборкаТаблица7.ПризнакНаличияТрудовойКнижки;
		
		Если НЕ СписокРаботниковСоСпецСтажем.НайтиПоЗначению(ВыборкаТаблица7.Сотрудник.ФизЛицо) = Неопределено Тогда
			ДобавленнаяСтрока[мИдГруппы7+"СпецСтаж"] = 1;
		КонецЕсли;
		
	КонецЦикла;	
	
	Запрос.Текст    = ТекстБольничныеФОТ;
	БольничныеФОТ = Запрос.Выполнить().Выгрузить(); 
	Для каждого СтрокаВыборки из БольничныеФОТ Цикл
		НачисленоБезБольничных = СтрокаВыборки.НачисленоВсего - СтрокаВыборки.НачисленоБольничные;
		УчтеноБольничные = СтрокаВыборки.ВсегоУчтено - НачисленоБезБольничных;
		Если УчтеноБольничные > 0 Тогда
			Коэф = ?(СтрокаВыборки.ВсегоУчтено = 0, 0, УчтеноБольничные/СтрокаВыборки.ВсегоУчтено);
			СтрокаВыборки.НалогБольничные = Окр(СтрокаВыборки.Налог*100*Коэф)/100;
		КонецЕсли;
	КонецЦикла;
	
	Запрос.Текст = ТекстКорректировкиФОТ;
	КорректировкиФОТ = Запрос.Выполнить().Выгрузить(); 
	
	//Вывод данных за прошедшие периоды
	//Данные рассчитаны при заполнении таблицы 6
	Для Каждого СтрокаПП Из ВыборкаТаблица61 Цикл
	
		Если СтрокаПП.Начислено1 <> 0 Тогда 
	
			Если НомСтроки <= ИсходноеКоличествоСтрокГруппы7 Тогда
				ДобавленнаяСтрока = СтруктураГруппы7[НомСтроки - 1];	
			Иначе
				ДобавленнаяСтрока = СтруктураГруппы7.Добавить();	
			КонецЕсли;
			НомСтроки = НомСтроки + 1;
			
			ДобавленнаяСтрока[мИдГруппы7+"МесяцНачисления"] 		= НачалоМесяца(СтрокаПП.ПериодДействия);
			ДобавленнаяСтрока[мИдГруппы7+"ТипНачисления"] 			= 1;
			ДобавленнаяСтрока[мИдГруппы7+"СуммаНачислено"]			= МАКС(СтрокаПП.Начислено1,- СтрокаПП.Начислено1);
			ДобавленнаяСтрока[мИдГруппы7+"СуммаНачисленоМаксБаза"] 	= МАКС(СтрокаПП.Учтено1, - СтрокаПП.Учтено1);
			ДобавленнаяСтрока[мИдГруппы7+"СуммаВзносов"]  			= 0;
			
			ДобавленнаяСтрока[мИдГруппы7+"ДРФО"] 			= СтрокаПП.ДРФО;
			ДобавленнаяСтрока[мИдГруппы7+"ФИО"] 			= СтрокаПП.ФизЛицоФио;
			ДобавленнаяСтрока[мИдГруппы7+"Имя"] 			= СтрокаПП.ФизЛицоИмя;		
			ДобавленнаяСтрока[мИдГруппы7+"Отчество"]        = СтрокаПП.ФизЛицоОтчество;		
			ДобавленнаяСтрока[мИдГруппы7+"Категория"] 		= СтрокаПП.КодКатегории;
			ДобавленнаяСтрока[мИдГруппы7+"ТипСтавки"] 		= СтрокаПП.КодТипаСтавки;
			ДобавленнаяСтрока[мИдГруппы7+"ТрудКнижка"] 		= СтрокаПП.ПризнакНаличияТрудовойКнижки;
		
			Если НЕ СписокРаботниковСоСпецСтажем.НайтиПоЗначению(СтрокаПП.Сотрудник.ФизЛицо) = Неопределено Тогда
				ДобавленнаяСтрока[мИдГруппы7+"СпецСтаж"] = 1;
			КонецЕсли;

			
		КонецЕсли;
		
		Если СтрокаПП.Начислено2 <> 0 Тогда 
	
			Если НомСтроки <= ИсходноеКоличествоСтрокГруппы7 Тогда
				ДобавленнаяСтрока = СтруктураГруппы7[НомСтроки - 1];	
			Иначе
				ДобавленнаяСтрока = СтруктураГруппы7.Добавить();	
			КонецЕсли;
			НомСтроки = НомСтроки + 1;
			
			ДобавленнаяСтрока[мИдГруппы7+"МесяцНачисления"] 		= НачалоМесяца(СтрокаПП.ПериодДействия);
			ДобавленнаяСтрока[мИдГруппы7+"ТипНачисления"] 			= 2;
			ДобавленнаяСтрока[мИдГруппы7+"СуммаНачислено"]			= МАКС(СтрокаПП.Начислено2,- СтрокаПП.Начислено2);
			ДобавленнаяСтрока[мИдГруппы7+"СуммаНачисленоМаксБаза"] 	= МАКС(СтрокаПП.Учтено2, - СтрокаПП.Учтено2);
			ДобавленнаяСтрока[мИдГруппы7+"СуммаВзносов"]  			= 0;
			
			ДобавленнаяСтрока[мИдГруппы7+"ДРФО"] 			= СтрокаПП.ДРФО;
			ДобавленнаяСтрока[мИдГруппы7+"ФИО"] 			= СтрокаПП.ФизЛицоФио;
			ДобавленнаяСтрока[мИдГруппы7+"Имя"] 			= СтрокаПП.ФизЛицоИмя;		
			ДобавленнаяСтрока[мИдГруппы7+"Отчество"]        = СтрокаПП.ФизЛицоОтчество;		
			ДобавленнаяСтрока[мИдГруппы7+"Категория"] 		= СтрокаПП.КодКатегории;
			ДобавленнаяСтрока[мИдГруппы7+"ТипСтавки"] 		= СтрокаПП.КодТипаСтавки;
			ДобавленнаяСтрока[мИдГруппы7+"ТрудКнижка"] 		= СтрокаПП.ПризнакНаличияТрудовойКнижки;
			
			Если НЕ СписокРаботниковСоСпецСтажем.НайтиПоЗначению(СтрокаПП.Сотрудник.ФизЛицо) = Неопределено Тогда
				ДобавленнаяСтрока[мИдГруппы7+"СпецСтаж"] = 1;
			КонецЕсли;
			
		КонецЕсли;
		
		Если СтрокаПП.Начислено6 <> 0 Тогда 
	
			Если НомСтроки <= ИсходноеКоличествоСтрокГруппы7 Тогда
				ДобавленнаяСтрока = СтруктураГруппы7[НомСтроки - 1];	
			Иначе
				ДобавленнаяСтрока = СтруктураГруппы7.Добавить();	
			КонецЕсли;
			НомСтроки = НомСтроки + 1;
			
			ДобавленнаяСтрока[мИдГруппы7+"МесяцНачисления"] 		= НачалоМесяца(СтрокаПП.ПериодДействия);
			ДобавленнаяСтрока[мИдГруппы7+"ТипНачисления"] 			= 6;
			ДобавленнаяСтрока[мИдГруппы7+"СуммаНачислено"]			= МАКС(СтрокаПП.Начислено6,- СтрокаПП.Начислено6);
			ДобавленнаяСтрока[мИдГруппы7+"СуммаНачисленоМаксБаза"] 	= МАКС(СтрокаПП.Учтено6, - СтрокаПП.Учтено6);
			ДобавленнаяСтрока[мИдГруппы7+"СуммаВзносов"]  			= 0;
			
			ДобавленнаяСтрока[мИдГруппы7+"ДРФО"] 			= СтрокаПП.ДРФО;
			ДобавленнаяСтрока[мИдГруппы7+"ФИО"] 			= СтрокаПП.ФизЛицоФио;
			ДобавленнаяСтрока[мИдГруппы7+"Имя"] 			= СтрокаПП.ФизЛицоИмя;		
			ДобавленнаяСтрока[мИдГруппы7+"Отчество"]        = СтрокаПП.ФизЛицоОтчество;		
			ДобавленнаяСтрока[мИдГруппы7+"Категория"] 		= СтрокаПП.КодКатегории;
			ДобавленнаяСтрока[мИдГруппы7+"ТипСтавки"] 		= СтрокаПП.КодТипаСтавки;
			ДобавленнаяСтрока[мИдГруппы7+"ТрудКнижка"] 		= СтрокаПП.ПризнакНаличияТрудовойКнижки;
			
			Если НЕ СписокРаботниковСоСпецСтажем.НайтиПоЗначению(СтрокаПП.Сотрудник.ФизЛицо) = Неопределено Тогда
				ДобавленнаяСтрока[мИдГруппы7+"СпецСтаж"] = 1;
			КонецЕсли;
			
		КонецЕсли;
		
		Если СтрокаПП.Начислено45 <> 0 Тогда 
			
			Отбор = Новый Структура();
			Отбор.Вставить("Сотрудник",СтрокаПП.Сотрудник);
			Отбор.Вставить("ПериодДействия",СтрокаПП.ПериодДействия);
			
			// определим взносы ФОТ По корректировкам
			НалогБольничныеФОТ = 0;
			СуммаВзносовФОТ = 0;
			Строки = БольничныеФОТ.НайтиСтроки(Отбор);
			Если Строки.Количество() > 0 Тогда
				НалогБольничныеФОТ = Макс(Строки[0].НалогБольничные, Строки[0].НалогБольничные);
			КонецЕсли;

			Строки = КорректировкиФОТ.НайтиСтроки(Отбор);
			Для каждого Строка Из Строки Цикл
				СуммаВзносовФОТ	= СуммаВзносовФОТ + Макс(Строка.Результат, -Строка.Результат);
			КонецЦикла;
			СуммаВзносовФОТ = СуммаВзносовФОТ  - НалогБольничныеФОТ;

			Если НомСтроки <= ИсходноеКоличествоСтрокГруппы7 Тогда
				ДобавленнаяСтрока = СтруктураГруппы7[НомСтроки - 1];	
			Иначе
				ДобавленнаяСтрока = СтруктураГруппы7.Добавить();	
			КонецЕсли;
			НомСтроки = НомСтроки + 1;
			
			ДобавленнаяСтрока[мИдГруппы7+"МесяцНачисления"] 		= НачалоМесяца(СтрокаПП.ПериодДействия);
			ДобавленнаяСтрока[мИдГруппы7+"ТипНачисления"] 			= ?(СтрокаПП.Начислено45 >= 0, 4, 5);
			ДобавленнаяСтрока[мИдГруппы7+"СуммаНачислено"]			= МАКС(СтрокаПП.Начислено45,- СтрокаПП.Начислено45);
			ДобавленнаяСтрока[мИдГруппы7+"СуммаНачисленоМаксБаза"] 	= МАКС(СтрокаПП.Учтено45, - СтрокаПП.Учтено45);
			ДобавленнаяСтрока[мИдГруппы7+"СуммаВзносов"]  			= МАКС(СтрокаПП.Налог-СтрокаПП.НалогБольничные, - (СтрокаПП.Налог-СтрокаПП.НалогБольничные));
			
			ДобавленнаяСтрока[мИдГруппы7+"ДРФО"] 			= СтрокаПП.ДРФО;
			ДобавленнаяСтрока[мИдГруппы7+"ФИО"] 			= СтрокаПП.ФизЛицоФио;
			ДобавленнаяСтрока[мИдГруппы7+"Имя"] 			= СтрокаПП.ФизЛицоИмя;		
			ДобавленнаяСтрока[мИдГруппы7+"Отчество"]        = СтрокаПП.ФизЛицоОтчество;		
			ДобавленнаяСтрока[мИдГруппы7+"Категория"] 		= СтрокаПП.КодКатегории;
			ДобавленнаяСтрока[мИдГруппы7+"ТипСтавки"] 		= СтрокаПП.КодТипаСтавки;
			ДобавленнаяСтрока[мИдГруппы7+"ТрудКнижка"] 		= СтрокаПП.ПризнакНаличияТрудовойКнижки;
			
			Если НЕ СписокРаботниковСоСпецСтажем.НайтиПоЗначению(СтрокаПП.Сотрудник.ФизЛицо) = Неопределено Тогда
				ДобавленнаяСтрока[мИдГруппы7+"СпецСтаж"] = 1;
			КонецЕсли;
			
			// Внесем коррективы в первую таблицу отчета по корректировкам (типы начислений 4 и 5)
			Если СтрокаПП.Начислено45 >= 0 Тогда
				//начислние 4
				мТаблица1.Области.П1_1.Значение = мТаблица1.Области.П1_1.Значение - ДобавленнаяСтрока[мИдГруппы7+"СуммаНачислено"];	
				мТаблица1.Области.П4.Значение   = мТаблица1.Области.П4.Значение  - ДобавленнаяСтрока[мИдГруппы7+"СуммаНачисленоМаксБаза"];	
				мТаблица1.Области.П5.Значение   = мТаблица1.Области.П5.Значение   - ДобавленнаяСтрока[мИдГруппы7+"СуммаВзносов"];	
				
				Если ДобавленнаяСтрока[мИдГруппы7+"Категория"] = 3 Тогда
					//42%
					мТаблица1.Области.П2_3.Значение = мТаблица1.Области.П2_3.Значение - ДобавленнаяСтрока[мИдГруппы7+"СуммаНачисленоМаксБаза"];	
					мТаблица1.Области.П3_3.Значение = мТаблица1.Области.П3_3.Значение - СуммаВзносовФОТ;	
				ИначеЕсли ДобавленнаяСтрока[мИдГруппы7+"Категория"] = 2 Тогда
					//4%
					мТаблица1.Области.П2_2.Значение = мТаблица1.Области.П2_2.Значение - ДобавленнаяСтрока[мИдГруппы7+"СуммаНачисленоМаксБаза"];	
					мТаблица1.Области.П3_2.Значение = мТаблица1.Области.П3_2.Значение - СуммаВзносовФОТ;	
				Иначе
					мТаблица1.Области.П2_1.Значение = мТаблица1.Области.П2_1.Значение - ДобавленнаяСтрока[мИдГруппы7+"СуммаНачисленоМаксБаза"];	
					мТаблица1.Области.П3_1.Значение = мТаблица1.Области.П3_1.Значение - СуммаВзносовФОТ;	
				КонецЕсли;
				
				мТаблица1.Области.П6_1.Значение = мТаблица1.Области.П6_1.Значение + СуммаВзносовФОТ;
				мТаблица1.Области.П6_2.Значение = мТаблица1.Области.П6_2.Значение + ДобавленнаяСтрока[мИдГруппы7+"СуммаВзносов"];	
				мТаблица1.Области.П6_а.Значение = мТаблица1.Области.П6_а.Значение + ДобавленнаяСтрока[мИдГруппы7+"СуммаНачисленоМаксБаза"];	
				
			Иначе // начисление 5	
				
				мТаблица1.Области.П1_1.Значение = мТаблица1.Области.П1_1.Значение + ДобавленнаяСтрока[мИдГруппы7+"СуммаНачислено"];	
				мТаблица1.Области.П4.Значение   = мТаблица1.Области.П4.Значение   + ДобавленнаяСтрока[мИдГруппы7+"СуммаНачисленоМаксБаза"];	
				мТаблица1.Области.П5.Значение   = мТаблица1.Области.П5.Значение   + ДобавленнаяСтрока[мИдГруппы7+"СуммаВзносов"];	
				
				Если ДобавленнаяСтрока[мИдГруппы7+"Категория"] = 3 Тогда
					//42%
					мТаблица1.Области.П2_3.Значение = мТаблица1.Области.П2_3.Значение + ДобавленнаяСтрока[мИдГруппы7+"СуммаНачисленоМаксБаза"];	
					мТаблица1.Области.П3_3.Значение = мТаблица1.Области.П3_3.Значение + СуммаВзносовФОТ;	
				ИначеЕсли ДобавленнаяСтрока[мИдГруппы7+"Категория"] = 2 Тогда
					//4%
					мТаблица1.Области.П2_2.Значение = мТаблица1.Области.П2_2.Значение + ДобавленнаяСтрока[мИдГруппы7+"СуммаНачисленоМаксБаза"];	
					мТаблица1.Области.П3_2.Значение = мТаблица1.Области.П3_2.Значение + СуммаВзносовФОТ;	
				Иначе
					мТаблица1.Области.П2_1.Значение = мТаблица1.Области.П2_1.Значение + ДобавленнаяСтрока[мИдГруппы7+"СуммаНачисленоМаксБаза"];	
					мТаблица1.Области.П3_1.Значение = мТаблица1.Области.П3_1.Значение + СуммаВзносовФОТ;	
				КонецЕсли;
				
				мТаблица1.Области.П7_1.Значение = мТаблица1.Области.П7_1.Значение + СуммаВзносовФОТ;
				мТаблица1.Области.П7_2.Значение = мТаблица1.Области.П7_2.Значение + ДобавленнаяСтрока[мИдГруппы7+"СуммаВзносов"];	
				мТаблица1.Области.П7_а.Значение = мТаблица1.Области.П7_а.Значение + ДобавленнаяСтрока[мИдГруппы7+"СуммаНачисленоМаксБаза"];	
				
			КонецЕсли;
			
			Если    СтрокаПП.Начислено1 <> 0 
				ИЛИ СтрокаПП.Начислено2 <> 0 Тогда
				
				СтрокаСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'По сотруднику %1 (код: %2) за прошлый период (%3) имеется как начисление больничного, так и корректировки начислений!
                                                              |    Необходимо проверить значение суммы взносов и суммы макс. базы в таблицах 6 и 7
                                                              |    за указанный период по этому сотруднику, а также значение в строках 2, 4 и 6 (7) Таблицы 1 отчета!
                                                              |														 |	 '; uk = 'По співробітнику %1 (код: %2) за попередній період (%3) присутнє як нарахування лікарняного так і коригування нарахувань!
                                                              |    Необхідно перевірити значення  суми внесків та суми макс. бази в таблицях 6 та 7
                                                              |    за вказаний період по цьому співробітнику, а також значення в рядках 2, 4 та 6 (7) Таблиці 1 звіту!'"),
														 СтрокаПП.Сотрудник,
														 СтрокаПП.ДРФО,
														 Формат(СтрокаПП.ПериодДействия,"ДФ=MM.yyyy"));				
				Сообщить(СтрокаСообщения);
				
				
			КонецЕсли;
			
		КонецЕсли;
			
	КонецЦикла;	
	
	СтруктураГруппы7.Сортировать(мИдГруппы7+"ФИО," + мИдГруппы7+"Имя,"+ мИдГруппы7+"Отчество,"+ мИдГруппы7+"ТипНачисления,"+ мИдГруппы7+"МесяцНачисления");
	ВывестиРазделВТабличныйДокумент(мИдГруппы7, СтруктураГруппы7);

КонецПроцедуры

Функция СписокОтпусков()
	
	Если РегламентированнаяОтчетность.ИДКонфигурации() = "БП" Тогда
		Результат = Новый Массив();
		Для каждого СтрокаОтпусков Из ТаблицаВРОтпускные Цикл
			Результат.Добавить(СтрокаОтпусков.ВидРасчета);
		КонецЦикла;
		Возврат Результат;
	Иначе
		Если РегламентированнаяОтчетность.ИДКонфигурации() = "УТП" Тогда
			ИмяПланаВидовРасчета = "Начисления";
			Признак = "ЭтоОтпускные";
		Иначе
			ИмяПланаВидовРасчета = "ОсновныеНачисленияОрганизаций";
			Признак = "ЭтоОтпуск";
		КонецЕсли;	
		Запрос = Новый Запрос();
	    Запрос.Текст = "ВЫБРАТЬ
		  |	ОсновныеНачисленияОрганизаций.Ссылка,
		  |	ОсновныеНачисленияОрганизаций.СпособРасчета
		  |ИЗ
		  |	ПланВидовРасчета."+ИмяПланаВидовРасчета+" КАК ОсновныеНачисленияОрганизаций
		  |ГДЕ
		  | ОсновныеНачисленияОрганизаций."+Признак+"
		  | И ОсновныеНачисленияОрганизаций.СпособРасчета <> ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.НулеваяСумма)";
		 Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	КонецЕсли;	 
	
 КонецФункции
 
Функция СписокБольничных(ЗаСчетФСС = Ложь)
	
	Если РегламентированнаяОтчетность.ИДКонфигурации() = "БП" Тогда
		
		Результат = Новый Массив();
		
		Для каждого СтрокаБольничных Из ТаблицаВРБольничные Цикл
			
			Если ЗаСчетФСС = СтрокаБольничных.ЗаСчетПредприятия Тогда
				Продолжить;	
			КонецЕсли;
			
			Результат.Добавить(СтрокаБольничных.ВидРасчета);
		КонецЦикла;
		
		Возврат Результат;
		
	Иначе		
		МассивБольничных = Новый Массив();
		Если РегламентированнаяОтчетность.ИДКонфигурации() = "УТП" Тогда
			ИмяПланаВидовРасчета = "Начисления";
			Если ЗаСчетФСС Тогда
				МассивБольничных.Добавить(ПланыВидовРасчета[ИмяПланаВидовРасчета].ОплатаПоСреднемуБЛ);
				МассивБольничных.Добавить(ПланыВидовРасчета[ИмяПланаВидовРасчета].ОплатаПоСреднемуБЛТравмаНаПроизводстве);
			Иначе	
				МассивБольничных.Добавить(ПланыВидовРасчета[ИмяПланаВидовРасчета].ОплатаПоСреднемуБЛОрганизации);
			КонецЕсли;	
		Иначе
			ИмяПланаВидовРасчета = "ОсновныеНачисленияОрганизаций";
			Если ЗаСчетФСС Тогда
				МассивБольничных.Добавить(ПланыВидовРасчета[ИмяПланаВидовРасчета].ОплатаПоСреднемуБЛ);
				МассивБольничных.Добавить(ПланыВидовРасчета[ИмяПланаВидовРасчета].ОплатаБЛПоТравмеНаПроизводстве);
			Иначе	
				МассивБольничных.Добавить(ПланыВидовРасчета[ИмяПланаВидовРасчета].ОплатаПоСреднемуБЛОрганизации);
			КонецЕсли;	
		КонецЕсли;
		Возврат  МассивБольничных;
	КонецЕсли;

	
 КонецФункции

Функция  ПолучитьСписокЛиц()
	
	// Текст запроса: работники организации за период 
	Запрос = Новый Запрос;
	// Установим параметры запроса
	Запрос.УстановитьПараметр("ДатаНач", мДатаНачалаПериодаОтчета - 1);
	Запрос.УстановитьПараметр("ДатаКон", мДатаКонцаПериодаОтчета +  1);
	Запрос.УстановитьПараметр("ДатаКонНеВключая", мДатаКонцаПериодаОтчета);
	Запрос.УстановитьПараметр("ДатаНачВключая", Новый Граница(мДатаНачалаПериодаОтчета, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("ДатаКонВключая", Новый Граница(мДатаКонцаПериодаОтчета + 1, ВидГраницы.Включая));
	
	Запрос.УстановитьПараметр("Организация" , Организация);
	
	ТекстЗапросаРаботавшие =
	"ВЫБРАТЬ
	|	РаботникиОрганизаций.Сотрудник.Физлицо КАК ФизЛицо,
	|	РаботникиОрганизаций.ЗанимаемыхСтавок КАК СтавокНаНачало,
	|	0 КАК СтавокНаКонец,
	|	NULL КАК ДатаПриема,
	|	NULL КАК ДатаУвольнения
	|ПОМЕСТИТЬ СписокРаботников
	|ИЗ
	|	РегистрСведений.РаботникиОрганизаций.СрезПоследних(&ДатаНач, Организация = &Организация) КАК РаботникиОрганизаций
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РаботникиОрганизаций.Сотрудник.Физлицо,
	|	0,
	|	РаботникиОрганизаций.ЗанимаемыхСтавок,
	|	NULL,
	|	NULL
	|ИЗ
	|	РегистрСведений.РаботникиОрганизаций.СрезПоследних(&ДатаКонВключая, Организация = &Организация) КАК РаботникиОрганизаций
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РаботникиОрганизаций.Сотрудник.Физлицо,
	|	0,
	|	0,
	|	РаботникиОрганизаций.Период,
	|	NULL
	|ИЗ
	|	РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
	|ГДЕ
	|	РаботникиОрганизаций.Период МЕЖДУ &ДатаНач И &ДатаКон
	|	И РаботникиОрганизаций.ПричинаИзмененияСостояния = ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.ПриемНаРаботу)
	|	И РаботникиОрганизаций.Организация = &Организация
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РаботникиОрганизаций.Сотрудник.Физлицо,
	|	0,
	|	0,
	|	NULL,
	|	РаботникиОрганизаций.Период
	|ИЗ
	|	РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
	|ГДЕ
	|	РаботникиОрганизаций.Период МЕЖДУ &ДатаНач И &ДатаКон
	|	И РаботникиОрганизаций.ПричинаИзмененияСостояния = ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
	|	И РаботникиОрганизаций.Организация = &Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СписокРаботников.ФизЛицо,
	|	СписокРаботников.ФизЛицо.КодПоДРФО КАК КодПоДРФО,
	|	СУММА(СписокРаботников.СтавокНаНачало) КАК СтавокНаНачало,
	|	СУММА(СписокРаботников.СтавокНаКонец) КАК СтавокНаКонец,
	|	МИНИМУМ(СписокРаботников.ДатаПриема) КАК ДатаПриема,
	|	МАКСИМУМ(СписокРаботников.ДатаУвольнения) КАК ДатаУвольнения,
	|	МАКСИМУМ(ФИОФизЛицСрезПоследних.Фамилия) КАК Фамилия,
	|	МАКСИМУМ(ФИОФизЛицСрезПоследних.Имя) КАК Имя,
	|	МАКСИМУМ(ФИОФизЛицСрезПоследних.Отчество) КАК Отчество,
	|	ВЫБОР
	|		КОГДА (НЕ ФИОФизЛицСрезПоследних.Фамилия = ФИОФизЛицСрезНач.Фамилия)
	|				ИЛИ (НЕ ФИОФизЛицСрезПоследних.Имя = ФИОФизЛицСрезНач.Имя)
	|				ИЛИ (НЕ ФИОФизЛицСрезПоследних.Отчество = ФИОФизЛицСрезНач.Отчество)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ИзменилосьФИО
	|ИЗ
	|	СписокРаботников КАК СписокРаботников
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних(&ДатаКонНеВключая, ) КАК ФИОФизЛицСрезПоследних
	|		ПО СписокРаботников.ФизЛицо = ФИОФизЛицСрезПоследних.ФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних(&ДатаНач, ) КАК ФИОФизЛицСрезНач
	|		ПО СписокРаботников.ФизЛицо = ФИОФизЛицСрезНач.ФизЛицо
	|
	|СГРУППИРОВАТЬ ПО
	|	СписокРаботников.ФизЛицо,
	|	ВЫБОР
	|		КОГДА (НЕ ФИОФизЛицСрезПоследних.Фамилия = ФИОФизЛицСрезНач.Фамилия)
	|				ИЛИ (НЕ ФИОФизЛицСрезПоследних.Имя = ФИОФизЛицСрезНач.Имя)
	|				ИЛИ (НЕ ФИОФизЛицСрезПоследних.Отчество = ФИОФизЛицСрезНач.Отчество)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ";
	
	Запрос.Текст = ТекстЗапросаРаботавшие;
	
	РаботавшиеВОрганизации = Запрос.Выполнить().Выгрузить();
	РаботавшиеВОрганизации.Сортировать("Физлицо");
	Возврат РаботавшиеВОрганизации;
	
КонецФункции	

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ УПРАВЛЕНИЯ ВНЕШНИМ ВИДОМ ФОРМЫ

// Процедура управляет доступностью полей указания параметров заполнения ячеек,
// которые могут быть заполнены при автозаполнении отчета.
//
// Параметры:
//  Вариант         - число, вариант заполнения ячейки;
//  Текущая область - область ячеек табличного документа, ссылка на ячейку.
//
Процедура ДоступностьЭлементовВариантаЗаполнения(Вариант = Неопределено, ТекущаяОбласть = Неопределено)
	
	//ТекущаяСтраницаПанели    = ЭлементыФормы.ОсновнаяПанель.ТекущаяСтраница;
	ИмяТекущейСтраницыПанели = "Таблица1";

	Если Не мСтруктураВариантыЗаполнения.Свойство(ИмяТекущейСтраницыПанели) Тогда
		Возврат;
	КонецЕсли;

	ДоступностьПолеВыбораВариантЗаполнения    = Ложь;
	ДоступностьПолеВводаЗначениеКорректировки = Ложь;
	ДоступностьПолеВводаКомментарий           = Ложь;

	Если Вариант <> Неопределено Тогда
		ДоступностьПолеВыбораВариантЗаполнения            = Истина;
		Если Вариант <> 3 Тогда
			ДоступностьПолеВводаКомментарий               = Истина;
			Если Вариант = 2 Тогда
				ДоступностьПолеВводаЗначениеКорректировки = Истина;
			КонецЕсли;
		КонецЕсли;

	Иначе
		ОписаниеЯчейки = "";
		Если ТекущаяОбласть.ЦветФона = Новый Цвет(192, 220, 192) Тогда
			ОписаниеЯчейки    = НСтр("ru='Значение вычисляется автоматически';uk='Значення обчислюється автоматично'");
		ИначеЕсли ТекущаяОбласть.ЦветФона = Новый Цвет(255, 255, 192) Тогда
			ОписаниеЯчейки    = НСтр("ru='Значение вводится вручную';uk='Значення вводиться вручну'");
		КонецЕсли;

		ЭлементыФормы["ПолеВыбораВариантЗаполнения"    + ИмяТекущейСтраницыПанели].Значение = "";
		ЭлементыФормы["ПолеВводаЗначениеКорректировки" + ИмяТекущейСтраницыПанели].Значение = 0;
		ЭлементыФормы["ПолеВводаКомментарий"           + ИмяТекущейСтраницыПанели].Значение = ОписаниеЯчейки;

	КонецЕсли;

	ЭлементыФормы["ПолеВыбораВариантЗаполнения"    + ИмяТекущейСтраницыПанели].Доступность = ДоступностьПолеВыбораВариантЗаполнения;
	ЭлементыФормы["ПолеВводаЗначениеКорректировки" + ИмяТекущейСтраницыПанели].Доступность = ДоступностьПолеВводаЗначениеКорректировки;
	ЭлементыФормы["ПолеВводаКомментарий"           + ИмяТекущейСтраницыПанели].Доступность = ДоступностьПолеВводаКомментарий;

КонецПроцедуры // ДоступностьЭлементовВариантаЗаполнения()


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

// Процедура - обработчик события "ПередОткрытием" формы.
//
Процедура ПередОткрытием(Отказ, СтандартнаяОбработка)
	
	// выполняем начальные настройки
	ЗаполнитьНачальныеНастройки();

	// формируем список элементов подменю, связанное с кнопкой <Печать>
	ЭлементМеню = ЭлементыФормы.КоманднаяПанельДействий.Кнопки.ПодменюПечати;
	
	Если ЭлементМеню.Кнопки.Количество() = 0 Тогда

		ЭлементМеню.Кнопки.Добавить("ПечататьСразу", ТипКнопкиКоманднойПанели.Действие,
		                            НСтр("ru='Печатать сразу';uk='Друкувати відразу'"), Новый Действие("КоманднаяПанельДействийДействиеВыбратьПечатнуюФормы"));

		ЭлементМеню.Кнопки.Добавить("ПоказатьБланк", ТипКнопкиКоманднойПанели.Действие,
		                            НСтр("ru='Предварительный просмотр';uk='Попередній перегляд'"), Новый Действие("КоманднаяПанельДействийДействиеВыбратьПечатнуюФормы"));
									
		ЭлементМеню.Кнопки.Добавить("Разделитель1", ТипКнопкиКоманднойПанели.Разделитель);

		ЭлементМеню.Кнопки.Добавить("ЕстьДуплекс", ТипКнопкиКоманднойПанели.Действие,
		                            НСтр("ru='Принтер поддерживает автом. дуплекс';uk='Принтер підтримує автом. дуплекс'"), Новый Действие("КоманднаяПанельДействийДействиеВыбратьПечатнуюФормы"));
									
		ЭлементМеню.Кнопки.ЕстьДуплекс.Пометка = ЕстьДуплекс;

	КонецЕсли;
	
	ЛинияСнизу = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная, 2);
	ЛинияПусто = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.НетЛинии);


	мМассивТиповЛиний = Новый Массив();
	мМассивТиповЛиний.Вставить(0, ЛинияПусто);
	мМассивТиповЛиний.Вставить(1, ЛинияСнизу);
	
	Если РегламентированнаяОтчетность.ИДКонфигурации() = "БП" Тогда
		ТаблицаВРБольничные.Колонки.Добавить("ВидРасчета", Новый ОписаниеТипов("ПланВидовРасчетаСсылка.ОсновныеНачисленияОрганизаций"), "",10);
		КолонкаВидРасчета 		 = ЭлементыФормы.ТаблицаВРБольничные.Колонки.Вставить(0,НСтр("ru = 'Вид расчета'; uk = 'Вид розрахунку'"));
		КолонкаВидРасчета.Имя    = "ВидРасчета";
		КолонкаВидРасчета.Данные = "ВидРасчета";
		
		ТаблицаВРОтпускные.Колонки.Добавить("ВидРасчета", Новый ОписаниеТипов("ПланВидовРасчетаСсылка.ОсновныеНачисленияОрганизаций"), "",10);
		КолонкаВидРасчета 		 = ЭлементыФормы.ТаблицаВРОтпускные.Колонки.Вставить(0,НСтр("ru = 'Вид расчета'; uk = 'Вид розрахунку'"));
		КолонкаВидРасчета.Имя    = "ВидРасчета";
		КолонкаВидРасчета.Данные = "ВидРасчета";
		
		ЭлементыФормы.ОсновнаяПанель.Страницы.ВидыРасчетов.Видимость = Истина;
	Иначе	
		ЭлементыФормы.ОсновнаяПанель.Страницы.ВидыРасчетов.Видимость = Ложь;	
	КонецЕсли;
	
КонецПроцедуры // ПередОткрытием()

// Процедура - обработчик события "ПриОткрытии" формы.
//
Процедура ПриОткрытии()
	Перем ИсходноеКоличествоСтрокГруппы;
	
	ЭтаФорма.АвтоЗаголовок = Ложь;

	мПереченьТаблиц = ЭлементыФормы.ПолеТабличногоДокументаПереченьТаблиц;
	мТаблица1       = ЭлементыФормы.ПолеТабличногоДокументаТаблица1;
	мТаблица5       = ЭлементыФормы.ПолеТабличногоДокументаТаблица5;
	мТаблица6       = ЭлементыФормы.ПолеТабличногоДокументаТаблица6;
	мТаблица7       = ЭлементыФормы.ПолеТабличногоДокументаТаблица7;
	мТаблица8       = ЭлементыФормы.ПолеТабличногоДокументаТаблица8;
	мСлужебныеДанные       = ЭлементыФормы.ПолеТабличногоДокументаСлужебныеДанные;
	
	Если мСохраненныйДок = Неопределено Тогда

		Для Каждого ЭлементСтруктуры Из мСтруктураМногострочныхРазделов Цикл
			
			ИмяГруппы = ЭлементСтруктуры.Ключ;
			СтруктураГруппы = ЭлементСтруктуры.Значение;
			
			ТекТабличноеПоле = ОпределитьТабличноеПолеПоИдМногострочногоРаздела(ИмяГруппы);
			
			мСтруктураИсхКолвоСтрокРазделов.Свойство(ИмяГруппы, ИсходноеКоличествоСтрокГруппы);
			
			Для НСтр = 1 По  ИсходноеКоличествоСтрокГруппы Цикл
				
				СтрокаГруппы = СтруктураГруппы.Добавить();
				
				Для Каждого Колонка Из СтруктураГруппы.Колонки Цикл
					
					ИмяКолонки    = Колонка.Имя;
					
					КодПоказателя = Сред(ИмяКолонки,1,3) + Формат(НСтр,"ЧЦ=4;ЧВН=0;ЧГ=;") + Сред(ИмяКолонки,4);
					ОбластьЯчейки = ТекТабличноеПоле.Области[КодПоказателя];
						
					Если ОбластьЯчейки.СодержитЗначение Тогда
						ЗначениеЯчейки = ОбластьЯчейки.Значение;
					Иначе
						ЗначениеЯчейки = ОбластьЯчейки.Текст;
					КонецЕсли;
					
					СтрокаГруппы[ИмяКолонки] = ЗначениеЯчейки;
					
				КонецЦикла;
			КонецЦикла;
		
		КонецЦикла;

		
		Если мСкопированаФорма <> Неопределено Тогда
			// документ скопирован
			ВосстановитьСохраненныеДанные();
			
		Иначе
			// Это новый документ.
			// Установим реквизиты формы по умолчанию
			ЕдиницаИзмерения         = Перечисления.ПорядкиОкругленияОтчетности.Окр1;
			ТочностьЕдиницыИзмерения = 2;
			
			мДеревоВыбранныхСтраниц = мДеревоСтраницОтчета.Скопировать();

			ЭлементыФормы.НадписьНазваниеОрганизации.Заголовок = Организация.Наименование;
			
			УстановитьФорматВывода();
			
		    Если РегламентированнаяОтчетность.ИДКонфигурации() = "БП" Тогда
				// только для бухгалтерии
				мТаблицаВРБольничные 					  = ВосстановитьЗначение("РегламентированнаяОтчетность_ТаблицаВРБольничные");	
				Если НЕ мТаблицаВРБольничные = Неопределено Тогда
					
					мСоостветствиеБольничныеЗаСчетПредприятия = ВосстановитьЗначение("РегламентированнаяОтчетность_СоостветствиеБольничныеЗаСчетПредприятия");	
					Если мСоостветствиеБольничныеЗаСчетПредприятия = Неопределено Тогда
						мСоостветствиеБольничныеЗаСчетПредприятия = Новый Соответствие();
					КонецЕсли;
					
					ТаблицаВРБольничные.Очистить();
					Для каждого ВР Из мТаблицаВРБольничные Цикл
						СтрокаВР = ТаблицаВРБольничные.Добавить();
						СтрокаВР.ВидРасчета = ВР;
						Если мСоостветствиеБольничныеЗаСчетПредприятия[ВР] = Истина Тогда
							СтрокаВР.ЗаСчетПредприятия = Истина;
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;
				
				мТаблицаВРОтпускные = ВосстановитьЗначение("РегламентированнаяОтчетность_ТаблицаВРОтпускные");	
				Если НЕ мТаблицаВРОтпускные = Неопределено Тогда
					
					ТаблицаВРОтпускные.Очистить();
					Для каждого ВР Из мТаблицаВРОтпускные Цикл
						СтрокаВР = ТаблицаВРОтпускные.Добавить();
						СтрокаВР.ВидРасчета = ВР;
					КонецЦикла;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
		ЗаполнитьСведенияОбОрганизации();

		ИсхНомер = ВосстановитьЗначение("РегламентированнаяОтчетность_ПенсионныйФонд_ИсхНомер");
		Если ЗначениеЗаполнено(ИсхНомер) Тогда
			Попытка
				ИсхНомер = Число(ИсхНомер) + 1;
			Исключение
			    ИсхНомер = 1;
			КонецПопытки;
		Иначе
			 ИсхНомер = 1;
		КонецЕсли;
		мПереченьТаблиц.Области.ИсхНомер.Значение = ИсхНомер;
		
	Иначе
		// При открытии или при копировании сохраненного
		// отчета восстанавливаем сохраненные данные.
		ВосстановитьСохраненныеДанные();

	КонецЕсли;

	КаталогДанных = ВосстановитьЗначение("КаталогДанных");
	
	ПоказатьПериод();
	
	мПереченьТаблиц.ТолькоПросмотр = Истина;
	мТаблица1.ТолькоПросмотр = Истина;
	мТаблица5.ТолькоПросмотр = Истина;
	мТаблица6.ТолькоПросмотр = Истина;
	мТаблица7.ТолькоПросмотр = Истина;
	мТаблица8.ТолькоПросмотр = Истина;
	мСлужебныеДанные.ТолькоПросмотр = Истина;
	
	УстановитьЦветФонаЯчейки(,,"ПереченьТаблиц");
	УстановитьЦветФонаЯчейки(,,"Таблица1");
	УстановитьЦветФонаЯчейки(,,"Таблица6");
	УстановитьЦветФонаЯчейки(,,"Таблица7");
	
	ЗаполнитьОтображениеДанныхВТаблицах();
	
КонецПроцедуры // ПриОткрытии()

// Процедура - обработчик события "ПередЗакрытием" формы.
//
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)

	Если Модифицированность = Истина Тогда

		Ответ = Вопрос(НСтр("ru='Данные были изменены. Сохранить изменения ?';uk='Дані були змінені. Зберегти зміни ?'"), РежимДиалогаВопрос.ДаНетОтмена, , КодВозвратаДиалога.Да);

		Если Ответ = КодВозвратаДиалога.Да Тогда
			Если НЕ Сохранить() Тогда
				Отказ = Истина;
			КонецЕсли;
		ИначеЕсли Ответ = КодВозвратаДиалога.Отмена Тогда
			Отказ = Истина;
		КонецЕсли;

	КонецЕсли;
	
	СохранитьЗначение("РегламентированныеОтчеты_ЕстьДуплекс", ЕстьДуплекс);
	
	СохранитьЗначение("КаталогДанных",КаталогДанных); 

КонецПроцедуры // ПередЗакрытием()

Процедура СохранитьДеревоСтраницОтчета()
	
	Если мСохраненныйДок <> Неопределено Тогда
		
		Если Не мСохраненныйДок.ЭтоНовый() Тогда
			// Сохраняем выбранные листы для печати в хранилище
			ХранилищеДанных = Новый ХранилищеЗначения(мДеревоСтраницОтчета);
			мСохраненныйДок.ДеревоНастройкиСтраниц = ХранилищеДанных;
			
			мСохраненныйДок.Записать();
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ДЕЙСТВИЯ КОМАНДНЫХ ПАНЕЛЕЙ ФОРМЫ

// Процедура вызывается при нажатии кнопки "Заполнить" 
// командной панели формы.
//
Процедура КоманднаяПанельФормыЗаполнить(Кнопка)

	Очистить();
	
	ЗаполнитьСведенияОбОрганизации();
	
	ЗаполнитьАвто();

КонецПроцедуры // КоманднаяПанельФормыЗаполнить

// Процедура вызывается при нажатии кнопки "Очистить".
//
Процедура КоманднаяПанельФормыОчистить(Кнопка)

	Очистить();

КонецПроцедуры // КоманднаяПанельФормыОчистить()

// Процедура вызывается при нажатии кнопки "Настройка страниц"  командной панели
// действий формы.
//
// Вызывает диалог настройки вывода на печать, показа и выгрузки.страниц отчета,
// а также процедуру управления видимостью страниц.
//
Процедура КоманднаяПанельФормыКнопкаНастройкаСтраниц(Кнопка)

	ОткрытьФормуВыбораСтраниц("ВыбратьДляНастройки");

	// Управляем видимостью страниц основной панели формы
	ПоказатьСтраницыОтчета();

	Модифицированность = Истина;

КонецПроцедуры // КоманднаяПанельФормыКнопкаНастройкаСтраниц()


// Процедура вызывается при выборе пункта подменю "Печать" командной панели
// действий формы. 
// Отрабатывает выбор печатной формы.
//
Процедура КоманднаяПанельДействийДействиеВыбратьПечатнуюФормы(Кнопка)

	Если Кнопка <> Неопределено Тогда
		Если Найти(Кнопка.Имя, "Дуплекс") >0 Тогда
		     ЕстьДуплекс    = НЕ Кнопка.Пометка;
			 Кнопка.Пометка = НЕ Кнопка.Пометка;
		Иначе
			 Печать(Кнопка.Имя);
		КонецЕсли; 
	КонецЕсли;

КонецПроцедуры // КоманднаяПанельДействийДействиеВыбратьПечатнуюФормы()

// Процедура вызывается нажатием кнопки "ОК" командной панели действий формы.
// Выполняет сохранение данных отчета и закрывает текущую форму.
//
Процедура КоманднаяПанельДействийДействиеСохранитьИЗакрыть(Кнопка)

	Если Сохранить() Тогда
		ЭтаФорма.Закрыть();
	КонецЕсли;

КонецПроцедуры // КоманднаяПанельДействийДействиеСохранитьИЗакрыть()

// Процедура вызывается нажатием кнопки "Записать" командной панели действий формы.
// Выполняет сохранение данных отчета.
//
Процедура КоманднаяПанельДействийДействиеЗаписать(Кнопка)

	Сохранить();

КонецПроцедуры // КоманднаяПанельДействийДействиеЗаписать()


///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ДИАЛОГА

// Процедура - обработчик события "ПриИзменении" поля ввода даты
// представления отчета.
//
Процедура ПолеВводаДатаСдачиПриИзменении(Элемент)
	
	мПереченьТаблиц.Области.ИсхДата.Значение = ДатаПодписи;
	
	ЗаполнитьОтображениеДанныхВТаблицах();
	
	Модифицированность = Истина;

КонецПроцедуры // ПолеВводаДатаСдачиПриИзменении()

// Процедура - обработчик события "ПриИзменении" поля ввода точности
// единицы измерения.
//
Процедура ПолеВводаТочностьЕдиницыИзмеренияПриИзменении(Элемент)

	ПроверитьТочность();
	УстановитьФорматВывода();

	// Итоговые поля надо пересчитывать, потому что при расчете они округлются
	// в соответствии с установленноой единицей изменения и точностью.
	Расчет();

	Модифицированность = Истина;

КонецПроцедуры // ПолеВводаТочностьЕдиницыИзмеренияПриИзменении()

// Процедура - обработчик события при изменении значения единицы измерения.
//
Процедура ПолеВыбораЕдиницаИзмеренияПриИзменении(Элемент)

	ПроверитьТочность();
	УстановитьФорматВывода();

	// Итоговые поля надо пересчитывать, потому что при расчете они округлются
	// в соответствии с установленноой единицей изменения и точностью.
	Расчет();

	Модифицированность = Истина;

КонецПроцедуры // ПолеВыбораЕдиницаИзмеренияПриИзменении()

// Процедура вызывается при активизации поля табличного документа.
//   Определяет текущую область табличного документа и вызывает процедуру 
// управления доступностью кнопок "Добавить" и "Удалить" на странице формы.
//
Процедура ПолеТабличногоДокументаОтчетПФПриАктивизацииОбласти(Элемент)

	ТекущаяОбласть = Элемент.ТекущаяОбласть;
	ВывестиЭлементыВариантаЗаполнения(Элемент.ТекущаяОбласть);

КонецПроцедуры // ПолеТабличногоДокументаОтчетПФПриАктивизацииОбласти()


// Процедура - обработчик события "ПриИзменении" поля выбора варианта заполнения
// активной ячейка табличного документа.
//
Процедура ПолеВыбораВариантЗаполненияОтчетПФПриИзменении(Элемент)

	ИзменитьВариантЗаполненияЯчейки(Элемент.Значение);

КонецПроцедуры // ПолеВыбораВариантЗаполненияЛист2ПриИзменении()

// Процедура - обработчик события "ПриИзменении" значения в поле ввода
// величины автокорректировки.
//
Процедура ПолеВводаЗначениеКорректировкиОтчетПФПриИзменении(Элемент)

	Дельта = Элемент.Значение;
	ИзменитьЗначениеАвтокорректировки(Дельта);

	Модифицированность = Истина;

КонецПроцедуры // ПолеВводаЗначениеКорректировкиПриИзменении

// Процедура - обработчик события "ПриИзменении" значения в поле ввода
// "Комментарий" по ячейке, для которой установлен алгоритм автозаполнения 
// [автоматически с ручной корректирорвкой].
//
Процедура ПолеВводаКомментарийОтчетПФПриИзменении(Элемент)

	Коммент = Элемент.Значение;
	ИзменитьКомментарийПоЯчейке(Коммент);

КонецПроцедуры // ПолеВводаКомментарийПриИзменении()

Процедура КоманднаяПанельФормыРасширитьПолеБланка(Кнопка)
	
	РегламентированнаяОтчетность.ПриНажатииНаКнопкуПереходаВРежимВводаДанных(ЭтаФорма);
	
КонецПроцедуры

Процедура КнопкаДобавитьДопСтрокиНажатие(Элемент)
	
	ВставитьДополнительнуюСтроку(); 
	
КонецПроцедуры

Процедура КнопкаУдалитьДопСтрокиНажатие(Элемент)
	
	УдалитьДополнительнуюСтроку();
		
КонецПроцедуры

Процедура ЗначениеВКлетку(Знач Значение, ВыводитьНули, Размер, ИмяПараметра, ТекущаяОбластьМакета, ЗаполнятьПараметр = Ложь)
	
	Пустышка = ?(ВыводитьНули, "0", " ");
	
	ЗначСтр = "";
	
	Если ТипЗнч(Значение) = Тип("Число") Тогда
		ЗначСтр = Формат(Значение, "ЧГ=");
	Иначе	
		ЗначСтр = Строка(Значение);
	КонецЕсли;
	
	ДлинаЗнач = СтрДлина(ЗначСтр);
	Пока ДлинаЗнач < Размер Цикл
		Если (Размер = 27) или (Размер = 25) или (Размер = 18) или (Размер = 16) или (Размер = 15) или (Размер = 17)  Тогда
			ЗначСтр = ЗначСтр + Пустышка;
		Иначе  
			// дозаполним значение пустышками (слева!!!)
			ЗначСтр = Пустышка + ЗначСтр;
		КонецЕсли;
		ДлинаЗнач = ДлинаЗнач + 1;
	КонецЦикла;
	
	// заполним массив
	Для Ном = 1 По Размер Цикл
		Если ЗаполнятьПараметр Тогда
			ТекущаяОбластьМакета.Параметры[ИмяПараметра + Строка(Ном)] = Сред(ЗначСтр,Ном,1) 
		Иначе	
		    ТекущаяОбластьМакета.Области[ИмяПараметра + Строка(Ном)].Значение = Сред(ЗначСтр,Ном,1) 
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьОтображениеДанныхВТаблицах()

	ЕДРПОУ = мПереченьТаблиц.Области.ЕДРПОУ.Значение + "          ";
	Филиал = мПереченьТаблиц.Области.Филиал.Значение + "     ";
	
	НазваниеОрганизации = мПереченьТаблиц.Области.НазваниеОрганизации.Значение;
	
	КодОрганаПФУ = мПереченьТаблиц.Области.КодОрганаПФУ.Значение; 	
	
	ИсхНомер = мПереченьТаблиц.Области.ИсхНомер.Значение; 
	ИсхДата = мПереченьТаблиц.Области.ИсхДата.Значение; 
	
	мес = Месяц(мДатаНачалаПериодаОтчета);
	год = Год(мДатаНачалаПериодаОтчета);
	
	деньПодписи = День(ДатаПодписи);
	месПодписи = Месяц(ДатаПодписи);
	годПодписи = Год(ДатаПодписи);
	
	РуководительИНН = мПереченьТаблиц.Области.РуководительИНН.Значение;
	РуководительФИО = мПереченьТаблиц.Области.РуководительФИО.Значение;
	
	БухгалтерИНН = мПереченьТаблиц.Области.БухгалтерИНН.Значение + "          ";
	БухгалтерФИО = мПереченьТаблиц.Области.БухгалтерФИО.Значение + "          ";

	ЗначениеВКлетку(ЕДРПОУ, Ложь,   10, "ЕДРПОУ", мПереченьТаблиц);
	ЗначениеВКлетку(Филиал, Ложь,    5, "Филиал", мПереченьТаблиц);
	
	ЗначениеВКлетку(Мес, Истина,    2, "Мес", мПереченьТаблиц);
	ЗначениеВКлетку(Год, ЛОЖЬ,      4, "Год", мПереченьТаблиц);
	
	Если ЗначениеЗаполнено(ИсхДата) Тогда
	
		мПереченьТаблиц.Области.ИсхДатаЧисло.Значение = День(ИсхДата);
		// нужно получить название меясца в определенном падеже. Поэтому отобразим дату "01.месяца" и обрежем число с точной слева.
		мПереченьТаблиц.Области.ИсхДатаМесяц.Значение = Сред(Формат(НачалоМесяца(ИсхДата),"Л=uk_UA; ДФ=дд.ММММ"), 4);
		мПереченьТаблиц.Области.ИсхДатаГод.Значение = Сред(Формат(Год(ИсхДата),"ЧГ=0"), 3);
		
	иначе
		
		мПереченьТаблиц.Области.ИсхДатаЧисло.Значение = "";
		мПереченьТаблиц.Области.ИсхДатаМесяц.Значение = "";
		мПереченьТаблиц.Области.ИсхДатаГод.Значение = "";
	
	КонецЕсли;
		
	мПереченьТаблиц.Области.Месяц.Значение = Мес;
	мПереченьТаблиц.Области.Год.Значение = Сред(Формат(Год,"ЧГ=0"), 3);
	
	мТаблица1.Области.ИсхНомер.Значение = ИсхНомер;
	ЗначениеВКлетку(Мес, Истина,    2, "Мес", мТаблица1);
	ЗначениеВКлетку(Год, ЛОЖЬ,      4, "Год", мТаблица1);
	
	ЗначениеВКлетку(ЕДРПОУ, Ложь,   10, "ЕДРПОУ", мТаблица1);
	ЗначениеВКлетку(Филиал, Ложь,    5, "Филиал", мТаблица1);
	
	мТаблица1.Области.НазваниеОрганизации.Значение = НазваниеОрганизации;
	
	ЗначениеВКлетку(деньПодписи,  Истина,    2, "деньПодписи",   мТаблица1);
	ЗначениеВКлетку(месПодписи, Истина,      2, "месПодписи",    мТаблица1);
	ЗначениеВКлетку(годПодписи,   Истина,    4, "годПодписи",    мТаблица1);
	
	ЗначениеВКлетку(РуководительИНН, Ложь, 10, "РуководительИНН", мТаблица1);
	ЗначениеВКлетку(БухгалтерИНН,    Ложь, 10, "БухгалтерИНН",    мТаблица1);
	
	мТаблица1.Области.РуководительФИО.Значение = РуководительФИО;
	мТаблица1.Области.БухгалтерФИО.Значение = БухгалтерФИО;
	
	мТаблица1.Области.ИсхНомер_1.Значение = ИсхНомер;
	ЗначениеВКлетку(Мес, Истина,    2, "Мес_", мТаблица1);
	ЗначениеВКлетку(Год, ЛОЖЬ,      4, "Год_", мТаблица1);
	
	ЗначениеВКлетку(ЕДРПОУ, Ложь,   10, "ЕДРПОУ_", мТаблица1);
	ЗначениеВКлетку(Филиал, Ложь,    5, "Филиал_", мТаблица1);
	
	ЗначениеВКлетку(БухгалтерИНН,    Ложь, 10, "БухгалтерИНН_",    мТаблица1);
	
	мТаблица1.Области.БухгалтерФИО_.Значение = БухгалтерФИО;
	
	мТаблица1.Области.ДопОперацииНеБыли.Шрифт = Новый Шрифт(мТаблица1.Области.ДопОперацииНеБыли.Шрифт,,,,,мСлужебныеДанные.Области.OPERADD.Значение = 0);
	мТаблица1.Области.ДопОперацииБыли.Шрифт   = Новый Шрифт(мТаблица1.Области.ДопОперацииБыли.Шрифт,,,,,  мСлужебныеДанные.Области.OPERADD.Значение = 1);
	
КонецПроцедуры

Процедура ПолеТабличногоДокументаПереченьТаблицВыбор(Элемент, Область, СтандартнаяОбработка)
	
	Если    Область.Имя = "ИсхДатаЧисло"
		ИЛИ Область.Имя = "ИсхДатаМесяц"
		ИЛИ Область.Имя = "ИсхДатаГод" Тогда
		
		ИсхДата = мПереченьТаблиц.Области.ИсхДата.Значение;
		
		Если ВвестиДату(ИсхДата,  НСтр("ru = 'Укажите дату регистрации'; uk = 'Введіть дату реєстрації'"), ЧастиДаты.Дата) Тогда
			
			мПереченьТаблиц.Области.ИсхДата.Значение = ИсхДата;
			ЗаполнитьОтображениеДанныхВТаблицах();
		
		КонецЕсли;
		
		СтандартнаяОбработка = Ложь;
		
	ИначеЕсли ЛЕВ(Область.Имя, 6) = "ЕДРПОУ" Тогда
		
		ЕДРПОУ = мПереченьТаблиц.Области.ЕДРПОУ.Значение;	
		
		Если ВвестиСтроку(ЕДРПОУ,  НСтр("ru = 'Укажите код за ЕГРПОУ'; uk = 'Введіть код за ЄДРПОУ'"), 10, Ложь) Тогда
			мПереченьТаблиц.Области.ЕДРПОУ.Значение = ЕДРПОУ;
			ЗаполнитьОтображениеДанныхВТаблицах();
		КонецЕсли;
		
		СтандартнаяОбработка = Ложь;
		
	ИначеЕсли ЛЕВ(Область.Имя, 6) = "Филиал" Тогда
		
		Филиал = мПереченьТаблиц.Области.Филиал.Значение;	
		
		Если ВвестиСтроку(Филиал,  НСтр("ru = 'Укажите код филиала'; uk = 'Введіть код філії'"), 5, Ложь) Тогда
			мПереченьТаблиц.Области.Филиал.Значение = Филиал;
			ЗаполнитьОтображениеДанныхВТаблицах();
		КонецЕсли;
		
		СтандартнаяОбработка = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПолеТабличногоДокументаПереченьТаблицПриИзмененииСодержимогоОбласти(Элемент, Область)
	
	Если    Область.Имя = "НазваниеОрганизации" 
		ИЛИ Прав(Область.Имя, 3) = "ФИО" 
		ИЛИ Прав(Область.Имя, 3) = "ИНН" 
		ИЛИ Область.Имя = "НазваниеОрганизации"
		ИЛИ Область.Имя = "ИсхНомер"
		ИЛИ Область.Имя = "КодОрганаПФУ" Тогда
		
		ЗаполнитьОтображениеДанныхВТаблицах();
		
	Иначе
		
		Расчет();	
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПолеТабличногоДокументаТаблица1ПриИзмененииСодержимогоОбласти(Элемент, Область)
	
	ОбновитьСтруктуруМногострочныхРазделов();
	
 	Расчет();
	ОбновитьПараметрыАвтозаполненияЯчейки();

	Модифицированность = Истина;
	
КонецПроцедуры

Процедура ПолеТабличногоДокументаТаблица5ПриИзмененииСодержимогоОбласти(Элемент, Область)
	
	ОбновитьСтруктуруМногострочныхРазделов();
	
 	Расчет();

	Модифицированность = Истина;

КонецПроцедуры


Процедура ПолеТабличногоДокументаТаблица6ПриИзмененииСодержимогоОбласти(Элемент, Область)
	
	ОбновитьСтруктуруМногострочныхРазделов();
	
 	Расчет();

	Модифицированность = Истина;
	
КонецПроцедуры

Процедура ПолеТабличногоДокументаТаблица7ПриИзмененииСодержимогоОбласти(Элемент, Область)
	
	ОбновитьСтруктуруМногострочныхРазделов();
	
 	Расчет();

	Модифицированность = Истина;

КонецПроцедуры

Процедура ПолеТабличногоДокументаТаблица8ПриИзмененииСодержимогоОбласти(Элемент, Область)
	
	ОбновитьСтруктуруМногострочныхРазделов();
	
 	Расчет();

	Модифицированность = Истина;

КонецПроцедуры

Процедура ПолеТабличногоДокументаТаблица5Выбор(Элемент, Область, СтандартнаяОбработка)
	
	Если    Область.Имя = "Начальная" Тогда
		СтандартнаяОбработка = Ложь;
		мТаблица5.Области.Начальная.Значение = "Х";
		мТаблица5.Области.Корректирующая.Значение = "";
		мТаблица5.Области.Отменяющая.Значение = "";
	ИначеЕсли Область.Имя = "Корректирующая" Тогда
		СтандартнаяОбработка = Ложь;
		мТаблица5.Области.Начальная.Значение = "";
		мТаблица5.Области.Корректирующая.Значение = "Х";
		мТаблица5.Области.Отменяющая.Значение = "";
	ИначеЕсли Область.Имя = "Отменяющая" Тогда
		СтандартнаяОбработка = Ложь;
		мТаблица5.Области.Начальная.Значение = "";
		мТаблица5.Области.Корректирующая.Значение = "";
		мТаблица5.Области.Отменяющая.Значение = "Х";
	КонецЕсли;
	
КонецПроцедуры

Процедура ПолеТабличногоДокументаТаблица6Выбор(Элемент, Область, СтандартнаяОбработка)
	
	Если    Область.Имя = "Начальная" Тогда
		СтандартнаяОбработка = Ложь;
		мТаблица6.Области.Начальная.Значение = "Х";
		мТаблица6.Области.Отменяющая.Значение = "";
	ИначеЕсли Область.Имя = "Отменяющая" Тогда
		СтандартнаяОбработка = Ложь;
		мТаблица6.Области.Начальная.Значение = "";
		мТаблица6.Области.Отменяющая.Значение = "Х";
	КонецЕсли;
	
КонецПроцедуры

Процедура ПолеТабличногоДокументаТаблица7Выбор(Элемент, Область, СтандартнаяОбработка)
	
	Если    Область.Имя = "Начальная" Тогда
		СтандартнаяОбработка = Ложь;
		мТаблица7.Области.Начальная.Значение = "Х";
		мТаблица7.Области.Отменяющая.Значение = "";
	ИначеЕсли Область.Имя = "Отменяющая" Тогда
		СтандартнаяОбработка = Ложь;
		мТаблица7.Области.Начальная.Значение = "";
		мТаблица7.Области.Отменяющая.Значение = "Х";
	КонецЕсли;
	
КонецПроцедуры

Процедура ПолеТабличногоДокументаТаблица8Выбор(Элемент, Область, СтандартнаяОбработка)
	
	Если    Область.Имя = "Начальная" Тогда
		СтандартнаяОбработка = Ложь;
		мТаблица8.Области.Начальная.Значение = "Х";
		мТаблица8.Области.Отменяющая.Значение = "";
	ИначеЕсли Область.Имя = "Отменяющая" Тогда
		СтандартнаяОбработка = Ложь;
		мТаблица8.Области.Начальная.Значение = "";
		мТаблица8.Области.Отменяющая.Значение = "Х";
	КонецЕсли;
	
КонецПроцедуры

Функция ТаблицаМногострочнойЧастиПуста(СтруктураГруппы, ИдГруппы)
	
	Если СтруктураГруппы.Количество() > мСтруктураИсхКолвоСтрокРазделов[ИдГруппы] Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Для Инд = 1 По мСтруктураИсхКолвоСтрокРазделов[ИдГруппы] Цикл
		СтрокаГруппы = СтруктураГруппы[Инд - 1];
		Для каждого Колонка Из СтруктураГруппы.Колонки Цикл
			
			Если ЗначениеЗаполнено(СтрокаГруппы[Колонка.Имя]) Тогда
				Возврат Ложь;
			КонецЕсли;
			
		КонецЦикла;		
	
	КонецЦикла;

	Возврат Истина;
	
КонецФункции // ТаблицаМногострочнойЧастиПуста

Функция ПолучитьГривны(Число)
	
	Значение = Цел(Число);
	
	Если Значение = 0 Тогда
		Если Число = 0 Тогда
		    Значение = "";
		Иначе	
			Значение = "0";
		КонецЕсли;
	КонецЕсли;
	
	Возврат Значение;

КонецФункции // ПолучитьГривны()

Функция ПолучитьКопейки(Число)
	
	Модуль = ?(Число < 0, -Число, Число);
	
	Значение = (Модуль - Цел(Модуль)) * 100;
	
	Если Значение = 0 Тогда
		Если Число = 0 Тогда
		    Значение = " -";
		Иначе	
			Значение = "00";
		КонецЕсли;
	КонецЕсли;
	
	Возврат Значение;

КонецФункции // ПолучитьГривны()

Процедура КоманднаяПанельДействийpfz(Кнопка) Экспорт
	
	Перем ИмяФайла, ДокЭкспорт;
	
	Если Модифицированность И НЕ Сохранить() Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ПроверитьСуществованиеКаталога() Тогда
		Предупреждение(НСтр("ru='Необходимо указать существуюций каталог для сохранения файлов pfz!'; uk='Необхідно вказати каталог існуючий каталог для збереження файлів pfz!'"));
		Возврат;
	КонецЕсли;
	
	ОбновитьСтруктуруМногострочныхРазделов();
	
	Если ОтказПриПроверкеРеквизитовДляВыгрузкиPFZ() Тогда
		Если НЕ Вопрос(Нстр("ru = 'При проверке заполнения отчета обнаружены ошибки!
                             |Продолжить выгрузку отчета?'; uk = 'При перевірці заповнення звіту виявлені помилки!
                             |Продовжити вивантаження звіту?'"), РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
			Возврат;	
		КонецЕсли;
	КонецЕсли;
	
	// Иницилизация докумета сохранения выгрузки
	НовыйДок = Документы.ВыгрузкаРегламентированныхОтчетов.СоздатьДокумент();
	НовыйДок.Очистить = Истина;
	НовыйДок.Комментарий = Комментарий;	
	СпДокОсн = Новый СписокЗначений;
	СпДокОсн.Добавить(мСохраненныйДок);
	ГлобСтруктФайловВыгрузки = Новый Структура;
	ФормаВыгрузки = НовыйДок.ПолучитьФорму(, ЭтотОбъект);
	
	// инициализация PFZ файла-контейнера
	ИмяФайлаPFZ = ПолучитьИмяФайлаPFZ();
	PFZ = Новый ЗаписьZipФайла(КаталогДанных +"\"+ИмяФайлаPFZ);
	
	СтруктураПараметров = Новый Структура();
	СчетчикДокОсн = 0;
	Для Каждого СтрокаУровня1 Из мДеревоВыбранныхСтраниц.Строки Цикл
		
		СчетчикДокОсн = СчетчикДокОсн + 1;
		
		СтруктураПараметров.Вставить("ИмяФайла",   		  "");
		СтруктураПараметров.Вставить("ИмяТабличногоПоля", СтрокаУровня1.ИмяПоляТабличногоДокум);
		
		ВыгрузитьЛистВXML(СтруктураПараметров);
		
		СтруктураПараметров.Свойство("ИмяФайла",  ИмяФайла);
		
		Если НЕ ЗначениеЗаполнено(ИмяФайла) Тогда
			// таблица не выгружалась
			Продолжить;
		КонецЕсли;
		
		PFZ.Добавить(КаталогДанных +"\"+ИмяФайла);
		
		ФормаВыгрузки.СформироватьИЗаписать(СпДокОсн, КаталогДанных +"\"+ИмяФайла, СчетчикДокОсн, , ,"XML");	
		ГлобСтруктФайловВыгрузки.Вставить("FileName" + Лев(ИмяФайла, СтрДлина(ИмяФайла)-4), Новый ДвоичныеДанные(КаталогДанных +"\" + ИмяФайла));
		
	КонецЦикла;
	
	// сохранение файла выгрузки
	НовыйДок.ИсходныйФайл = ГлобСтруктФайловВыгрузки;
	Попытка
		НовыйДок.Записать();
	Исключение
	КонецПопытки;
	
	//сохранение PFZ файла
	Попытка
		PFZ.Записать();
		Сообщить(НСтр("ru = 'Записан файл: '; uk = 'Записаний файл: '") + ИмяФайлаPFZ);
		Предупреждение(Нстр("ru = 'Выгрузка выполнена успешно!
                             |   
                             |   Для загрузки в ""АРМ Звіт страхувальника"" используйте пункт меню:
                             |   Документ -> Імпорт -> Звіт в форматі XML
                             |
                             |   ВНИМАНИЕ: Файл допустимо загружать в  АРМ ЗС версии 8.85. Для корректной загрузки Таблицы 1 необходимо в АРМ ЗС предварительно отключить опцию автоматического расчета Таблицы 1: (в меню окна месячной персонификации снять флажок ""Налаштування -> Автоматичний розрахунок Таблиці 1"")!'; uk = 'Вивантаження виконане вдало!
                             |    
                             |   Для завантаження до  ""АРМ Звіт страхувальника"" використайте пункт меню
                             |   Документ -> Імпорт -> Звіт в форматі XML
                             |   
                             |   УВАГА: Файл припустимо завантажувати в  АРМ ЗС версії 8.85. Для коректного завантаження Таблиці 1 необхідно у АРМ ЗС попередньо відключити опцію автоматичного розрахунку Таблиці 1: (в меню вікна місячної персоніфікації зняти прапорець ""Налаштування -> Автоматичний розрахунок Таблиці 1"")!'"));
	Исключение	
		Сообщить(Нстр("ru = 'Выгрузка не выполнена!'; uk = 'Вивантаження не виконане!'"));
	КонецПопытки
	
КонецПроцедуры

Процедура КаталогДанныхНачалоВыбора(Элемент, СтандартнаяОбработка)

 	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	Диалог.Заголовок = НСтр("ru='Выберите каталог сохранения pfz файлов';uk='Виберіть каталог збереження pfz файлів'");

	Если Диалог.Выбрать() Тогда
		КаталогДанных = Диалог.Каталог;
	КонецЕсли;
	
КонецПроцедуры

Функция ПроверитьСуществованиеКаталога()
	
	Результат = Ложь;
	
	КаталогНаДиске = Новый Файл(КаталогДанных);
	Если (КаталогДанных <> Неопределено) И (КаталогДанных <> "") И (КаталогНаДиске.Существует()) Тогда
		Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ОтказПриПроверкеРеквизитовДляВыгрузкиPFZ()

	Отказ = Ложь;
	
	Если НЕ ЗначениеЗаполнено(мПереченьТаблиц.Области.КодОрганаПФУ.Значение) Тогда
		Отказ = Истина;
		Сообщить(НСТР("ru = 'Не указан Код органа ПФУ, куда подается отчет'; uk = 'Не вказаний код органу Пенсійного фонду, до якого подається звіт   '"));
	ИначеЕсли СтрДлина(СокрЛП(мПереченьТаблиц.Области.КодОрганаПФУ.Значение)) < 5 Тогда
		Отказ = Истина;
		Сообщить(НСТР("ru = 'Код органа ПФУ должен быть пятизначным!'; uk = 'Код органу Пенсійного фонду має бути п''ятизначним!'"));
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(мПереченьТаблиц.Области.ИсхНомер.Значение) Тогда
		Отказ = Истина;
		Сообщить(НСТР("ru = 'Не указан исходящий номер у страхователя'; uk = 'Не вказаний вихідний номер у страхувальника'"));
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ДатаПодписи) Тогда
		Отказ = Истина;
		Сообщить(НСТР("ru = 'Не указана дата подписи'; uk = 'Не вказана дата підпису'"));
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(мПереченьТаблиц.Области.ЕДРПОУ.Значение) Тогда
		Отказ = Истина;
		Сообщить(НСТР("ru = 'Не указан код по ЕГРПОУ'; uk = 'Не вказаний код за ЄДРПОУ'"));
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(мТаблица1.Области.НомерРегистрацииПФ.Значение) Тогда
		Отказ = Истина;
		Сообщить(НСТР("ru = 'Не указан Номер регистрации в органе Пенсионного фонда'; uk = 'Не вказаний Номер реєстрації в органі Пенсійного фонду '"));
	КонецЕсли;
	
	СтруктураГруппы = Неопределено;
	// проверка реквизитов Таблиц 5-8
	ТекИдГруппы = мИдГруппы5; 
	мСтруктураМногострочныхРазделов.Свойство(ТекИдГруппы, СтруктураГруппы);
	Если НЕ ТаблицаМногострочнойЧастиПуста(СтруктураГруппы, ТекИдГруппы) Тогда		
		Для каждого Строка Из СтруктураГруппы Цикл
			Если    Не ЗначениеЗаполнено(Строка[ТекИдГруппы + "ДРФО"])
				ИЛИ Не ЗначениеЗаполнено(Строка[ТекИдГруппы + "Фамилия"])
				ИЛИ Не ЗначениеЗаполнено(Строка[ТекИдГруппы + "Имя"]) Тогда
			
				Отказ = Истина;
				Сообщить(НСтр("ru = 'Таблица '; uk = 'Таблиця'") + Сред(ТекИдГруппы,2,1)                + ", "
				       + НСТР("ru = 'строка '; uk = 'рядок '")     + (СтруктураГруппы.Индекс(Строка) + 1) + ": " 
					   + НСТР("ru = 'не заполнен код ДРФО или фамилия или имя сотрудника!'; uk = 'не заповнений код ДРФО або призвище або ім''я співробітника!'"));
			
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	ТекИдГруппы = мИдГруппы6; 
	мСтруктураМногострочныхРазделов.Свойство(ТекИдГруппы, СтруктураГруппы);
	Если НЕ ТаблицаМногострочнойЧастиПуста(СтруктураГруппы, ТекИдГруппы) Тогда		
		Для каждого Строка Из СтруктураГруппы Цикл
			Если    Не ЗначениеЗаполнено(Строка[ТекИдГруппы + "ДРФО"])
				ИЛИ Не ЗначениеЗаполнено(Строка[ТекИдГруппы + "ФИО"])
				ИЛИ Не ЗначениеЗаполнено(Строка[ТекИдГруппы + "Имя"]) Тогда
			
				Отказ = Истина;
				Сообщить(НСтр("ru = 'Таблица '; uk = 'Таблиця'") + Сред(ТекИдГруппы,2,1)                + ", "
				       + НСТР("ru = 'строка '; uk = 'рядок '")     + (СтруктураГруппы.Индекс(Строка) + 1) + ": " 
					   + НСТР("ru = 'не заполнен код ДРФО или фамилия или имя сотрудника!'; uk = 'не заповнений код ДРФО або призвище або ім''я співробітника!'"));
			
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	ТекИдГруппы = мИдГруппы7; 
	мСтруктураМногострочныхРазделов.Свойство(ТекИдГруппы, СтруктураГруппы);
	Если НЕ ТаблицаМногострочнойЧастиПуста(СтруктураГруппы, ТекИдГруппы) Тогда		
		Для каждого Строка Из СтруктураГруппы Цикл
			Если    Не ЗначениеЗаполнено(Строка[ТекИдГруппы + "ДРФО"])
				ИЛИ Не ЗначениеЗаполнено(Строка[ТекИдГруппы + "ФИО"])
				ИЛИ Не ЗначениеЗаполнено(Строка[ТекИдГруппы + "Имя"]) Тогда
			
				Отказ = Истина;
				Сообщить(НСтр("ru = 'Таблица '; uk = 'Таблиця'") + Сред(ТекИдГруппы,2,1)                + ", "
				       + НСТР("ru = 'строка '; uk = 'рядок '")     + (СтруктураГруппы.Индекс(Строка) + 1) + ": " 
					   + НСТР("ru = 'не заполнен код ДРФО или фамилия или имя сотрудника!'; uk = 'не заповнений код ДРФО або призвище або ім''я співробітника!'"));
			
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	ТекИдГруппы = мИдГруппы8; 
	мСтруктураМногострочныхРазделов.Свойство(ТекИдГруппы, СтруктураГруппы);
	Если НЕ ТаблицаМногострочнойЧастиПуста(СтруктураГруппы, ТекИдГруппы) Тогда		
		Для каждого Строка Из СтруктураГруппы Цикл
			Если    Не ЗначениеЗаполнено(Строка[ТекИдГруппы + "ДРФО"])
				ИЛИ Не ЗначениеЗаполнено(Строка[ТекИдГруппы + "ФИО"])
				ИЛИ Не ЗначениеЗаполнено(Строка[ТекИдГруппы + "Имя"])
				ИЛИ Не ЗначениеЗаполнено(Строка[ТекИдГруппы + "КодОснования"]) Тогда
			
				Отказ = Истина;
				Сообщить(НСтр("ru = 'Таблица '; uk = 'Таблиця'") + Сред(ТекИдГруппы,2,1)                + ", "
				       + НСТР("ru = 'строка '; uk = 'рядок '")     + (СтруктураГруппы.Индекс(Строка) + 1) + ": " 
					   + НСТР("ru = 'не заполнен код ДРФО или фамилия или имя сотрудника; или код основания учета спецстажа!'; uk = 'не заповнений код ДРФО або призвище або ім''я співробітника; або код підстави обліку спецстажу!'"));
			
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат Отказ;

КонецФункции // ()

Функция ПолучитьИмяФайлаPFZ()

	Результат = "";
	
	// код органа ПФУ
	КодОргана = мПереченьТаблиц.Области.КодОрганаПФУ.Значение;
	КодОргана = ЛЕВ(СокрЛП(КодОргана) + "     ", 5);
    Результат = Результат + КодОргана;
	
	// код едрпоу, дополненный справа "Z"
	КодЕДРПОУ = мПереченьТаблиц.Области.ЕДРПОУ.Значение;
	КодЕДРПОУ = ЛЕВ(СокрЛП(КодЕДРПОУ) + "ZZZZZZZZZZ", 10);
    Результат = Результат + КодЕДРПОУ;
	
	// код филии, дополненный справа "Z"
	Филиал = мПереченьТаблиц.Области.Филиал.Значение;
	Филиал = ЛЕВ(СокрЛП(Филиал) + "ZZZZZ", 5);
    Результат = Результат + Филиал;
	
	//Дата формирования
	Дата = Формат(ДатаПодписи, "ДФ=ddMMyyyy");
	Результат = Результат + Дата;
	
	//Дата формирования
	Время = Формат(ТекущаяДата() , "ДФ=ЧЧммсс");
	Результат = Результат + Время;
	
	//ТипДокумента
	Результат = Результат + "P04";
	
	//версия док
	Результат = Результат + ВерсияВыгрузкиPFZ;
	
	// код центра сертификации ключей
	КодЦентраКлючей = мСлужебныеДанные.Области.КодЦентраКлючей.Значение;
	Если НЕ ЗначениеЗаполнено(КодЦентраКлючей) Тогда
		КодЦентраКлючей = "0";
	КонецЕсли;
	Результат = Результат + КодЦентраКлючей; 
	
	// расширение
	Результат = Результат + ".pfz";
	
    Возврат Результат; 
КонецФункции // ()

Процедура ВыгрузитьЛистВXML(СтруктураПараметровЛиста)
	
	Перем ИмяТабличногоПоля;
	Перем ИмяФайла;
	
	СтруктураПараметровЛиста.Свойство("ИмяТабличногоПоля",  ИмяТабличногоПоля);
	
	ДокЭкспорт = Новый ЗаписьXML;
	
	Если ИмяТабличногоПоля = "ПолеТабличногоДокументаПереченьТаблиц" Тогда
		
		ИмяФайлаБезРасширения = "P04T00" + ВерсияВыгрузкиPFZ;
		ИмяФайла              = ИмяФайлаБезРасширения+ ".xml";
		
		ДокЭкспорт.ОткрытьФайл(КаталогДанных + "\" + ИмяФайла, "windows-1251");
		ДокЭкспорт.ЗаписатьОбъявлениеXML();
		ДокЭкспорт.ЗаписатьНачалоЭлемента("DECLAR");
		
			ДокЭкспорт.ЗаписатьАтрибут("xmlns:xsi", "http://www.w3.org/2001/XMLSchema-instance");
			ДокЭкспорт.ЗаписатьАтрибут("xsi:noNamespaceSchemaLocation",ИмяФайлаБезРасширения+".xsd");

			ЗаписатьDeclarHead(ДокЭкспорт, ИмяФайла);
			
			ДокЭкспорт.ЗаписатьНачалоЭлемента("DECLARBODY");
			
				ДокЭкспорт.ЗаписатьНачалоЭлемента("PAGE");

				    ///////////////////////////////////////////
					ДокЭкспорт.ЗаписатьНачалоЭлемента("HEADER");
						ЗаписатьЭлементXML(ДокЭкспорт, "FIRM_EDRPOU", мПереченьТаблиц.Области.ЕДРПОУ.Значение, "строка");
						ЗаписатьЭлементXML(ДокЭкспорт, "FIRM_FIL",    мПереченьТаблиц.Области.Филиал.Значение, "числоЦел", 1);
						ЗаписатьЭлементXML(ДокЭкспорт, "FIRM_NAME",   мПереченьТаблиц.Области.НазваниеОрганизации.Значение, "строка");
					ДокЭкспорт.ЗаписатьКонецЭлемента();//HEADER
					
					///////////////////////////////////////////
					ДокЭкспорт.ЗаписатьНачалоЭлемента("TABLE");
						ЗаписатьЭлементXML(ДокЭкспорт, "N1_0", мПереченьТаблиц.Области.СтраницТаб1.Значение, "числоЦел");
						ЗаписатьЭлементXML(ДокЭкспорт, "N2_0", мПереченьТаблиц.Области.СтраницТаб2.Значение, "числоЦел");
						ЗаписатьЭлементXML(ДокЭкспорт, "N3_0", мПереченьТаблиц.Области.СтраницТаб3.Значение, "числоЦел");
						ЗаписатьЭлементXML(ДокЭкспорт, "N4_0", мПереченьТаблиц.Области.СтраницТаб4.Значение, "числоЦел");
						ЗаписатьЭлементXML(ДокЭкспорт, "N5_0", мПереченьТаблиц.Области.СтраницТаб5.Значение, "числоЦел");
						ЗаписатьЭлементXML(ДокЭкспорт, "N5_1", мПереченьТаблиц.Области.СтрокТаб5.Значение, 	 "числоЦел");
						ЗаписатьЭлементXML(ДокЭкспорт, "N6_0", мПереченьТаблиц.Области.СтраницТаб6.Значение, "числоЦел");
						ЗаписатьЭлементXML(ДокЭкспорт, "N6_1", мПереченьТаблиц.Области.СтрокТаб6.Значение, 	 "числоЦел");
						ЗаписатьЭлементXML(ДокЭкспорт, "N7_0", мПереченьТаблиц.Области.СтраницТаб7.Значение, "числоЦел");
						ЗаписатьЭлементXML(ДокЭкспорт, "N7_1", мПереченьТаблиц.Области.СтрокТаб7.Значение, 	 "числоЦел");
						ЗаписатьЭлементXML(ДокЭкспорт, "N8_0", мПереченьТаблиц.Области.СтраницТаб8.Значение, "числоЦел");
						ЗаписатьЭлементXML(ДокЭкспорт, "N8_1", мПереченьТаблиц.Области.СтрокТаб8.Значение, 	 "числоЦел");
						ЗаписатьЭлементXML(ДокЭкспорт, "N9_0", мПереченьТаблиц.Области.СтраницТаб9.Значение, "числоЦел");
						ЗаписатьЭлементXML(ДокЭкспорт, "N9_1", мПереченьТаблиц.Области.СтрокТаб9.Значение, 	 "числоЦел");
						ЗаписатьЭлементXML(ДокЭкспорт, "N10_0", мПереченьТаблиц.Области.СтраницТаб10.Значение, "числоЦел");
						ЗаписатьЭлементXML(ДокЭкспорт, "N10_1", мПереченьТаблиц.Области.СтрокТаб10.Значение, "числоЦел");
						ЗаписатьЭлементXML(ДокЭкспорт, "N11_0", мПереченьТаблиц.Области.СтраницВсего.Значение, "числоЦел");
						ЗаписатьЭлементXML(ДокЭкспорт, "N11_1", мПереченьТаблиц.Области.СтрокВсего.Значение, "числоЦел");
					ДокЭкспорт.ЗаписатьКонецЭлемента();//TABLE
				
					
					///////////////////////////////////////////
					ДокЭкспорт.ЗаписатьНачалоЭлемента("FOOTER");
						ЗаписатьЭлементXML(ДокЭкспорт, "BOSS_NUMIDENT", мПереченьТаблиц.Области.РуководительИНН.Значение);
						ЗаписатьЭлементXML(ДокЭкспорт, "FIRM_BOSS", 	мПереченьТаблиц.Области.РуководительФИО.Значение);
						ЗаписатьЭлементXML(ДокЭкспорт, "BUH_NUMIDENT", 	мПереченьТаблиц.Области.БухгалтерИНН.Значение);
						ЗаписатьЭлементXML(ДокЭкспорт, "FIRM_BUH", 		мПереченьТаблиц.Области.БухгалтерФИО.Значение);
					ДокЭкспорт.ЗаписатьКонецЭлемента();//FOOTER
				
				
				ДокЭкспорт.ЗаписатьКонецЭлемента();//PAGE
			
			ДокЭкспорт.ЗаписатьКонецЭлемента();//DECLARBODY
			
		ДокЭкспорт.ЗаписатьКонецЭлемента();//DECLAR
		
	ИначеЕсли ИмяТабличногоПоля = "ПолеТабличногоДокументаТаблица1" Тогда
		
		ИмяФайлаБезРасширения = "P04T01" + ВерсияВыгрузкиPFZ;
		ИмяФайла              = ИмяФайлаБезРасширения+ ".xml";
		
		ДокЭкспорт.ОткрытьФайл(КаталогДанных + "\" + ИмяФайла, "windows-1251");
		ДокЭкспорт.ЗаписатьОбъявлениеXML();
		ДокЭкспорт.ЗаписатьНачалоЭлемента("DECLAR");
		
			ДокЭкспорт.ЗаписатьАтрибут("xmlns:xsi", "http://www.w3.org/2001/XMLSchema-instance");
			ДокЭкспорт.ЗаписатьАтрибут("xsi:noNamespaceSchemaLocation",ИмяФайлаБезРасширения+".xsd");

			ЗаписатьDeclarHead(ДокЭкспорт, ИмяФайла);
			
			ДокЭкспорт.ЗаписатьНачалоЭлемента("DECLARBODY");
			
				ДокЭкспорт.ЗаписатьНачалоЭлемента("PAGE");

				    ///////////////////////////////////////////
					ДокЭкспорт.ЗаписатьНачалоЭлемента("HEADER");
						ЗаписатьЭлементXML(ДокЭкспорт, "FIRM_FIL",     мПереченьТаблиц.Области.Филиал.Значение, "числоЦел", 1);
						ЗаписатьЭлементXML(ДокЭкспорт, "FIRM_MIN",     мТаблица1.Области.Министерство.Значение, "строка");
						ЗаписатьЭлементXML(ДокЭкспорт, "FIRM_ADR",     мТаблица1.Области.Адрес.Значение, "строка");
						ЗаписатьЭлементXML(ДокЭкспорт, "FIRM_PHON",    мТаблица1.Области.Телефон.Значение, "строка");
						ЗаписатьЭлементXML(ДокЭкспорт, "FIRM_VLAS",    мТаблица1.Области.ОргФормаСобственности.Значение, "строка");
						ЗаписатьЭлементXML(ДокЭкспорт, "FIRM_EDRPOU",  мПереченьТаблиц.Области.ЕДРПОУ.Значение, "строка");
						ЗаписатьЭлементXML(ДокЭкспорт, "FIRM_PENS",    мТаблица1.Области.НомерРегистрацииПФ.Значение, "строка");
						ЗаписатьЭлементXML(ДокЭкспорт, "FIRM_NMBANK",  мТаблица1.Области.Банк.Значение, "строка");
						ЗаписатьЭлементXML(ДокЭкспорт, "FIRM_CBANK",   мТаблица1.Области.МФО.Значение, "строка");
						ЗаписатьЭлементXML(ДокЭкспорт, "FIRM_RS",      мТаблица1.Области.РС.Значение, "числоЦел");
						ЗаписатьЭлементXML(ДокЭкспорт, "ID_1012",      мТаблица1.Области.Сотрудников.Значение, "числоЦел");
						ЗаписатьЭлементXML(ДокЭкспорт, "ID_1121",      мТаблица1.Области.Инвалидов.Значение, "числоЦел");
						
						//ЗаписатьЭлементXML(ДокЭкспорт, "ID_1013",      мТаблица1.Области.ЗастрЛиц.Значение, "числоЦел");
						//ЗаписатьЭлементXML(ДокЭкспорт, "ID_1014",      мТаблица1.Области.Сотр_по_ГПХ.Значение, "числоЦел");
						ЗаписатьЭлементXML(ДокЭкспорт, "ID_1013",      мТаблица1.Области.Сотр_по_ГПХ.Значение, "числоЦел");
						ЗаписатьЭлементXML(ДокЭкспорт, "ID_1014",      мТаблица1.Области.ЗастрЛиц.Значение, "числоЦел");
						
						ЗаписатьЭлементXML(ДокЭкспорт, "POD_STATUS",   мТаблица1.Области.СистНалОблож.Значение, "строка");
						ЗаписатьЭлементXML(ДокЭкспорт, "FIRM_NAME",    мПереченьТаблиц.Области.НазваниеОрганизации.Значение, "строка");
						ЗаписатьЭлементXML(ДокЭкспорт, "PAGE_NUM",     1, "числоЦел");
					ДокЭкспорт.ЗаписатьКонецЭлемента();//HEADER
					
					///////////////////////////////////////////
					ДокЭкспорт.ЗаписатьНачалоЭлемента("TABLE");
					
						///////////////////////////////////////////
						ДокЭкспорт.ЗаписатьНачалоЭлемента("ROZDIL_1");
							ЗаписатьЭлементXML(ДокЭкспорт, "ID_1018", мТаблица1.Области.П1.Значение, "ЧислоДес2");
							ЗаписатьЭлементXML(ДокЭкспорт, "ID_1019", мТаблица1.Области.П1_1.Значение, "ЧислоДес2");
							ЗаписатьЭлементXML(ДокЭкспорт, "ID_1020", мТаблица1.Области.П1_1_1.Значение, "ЧислоДес2");
							ЗаписатьЭлементXML(ДокЭкспорт, "ID_1021", мТаблица1.Области.П1_1_2.Значение, "ЧислоДес2");
							ЗаписатьЭлементXML(ДокЭкспорт, "ID_1022", мТаблица1.Области.П1_2.Значение, "ЧислоДес2");
							ЗаписатьЭлементXML(ДокЭкспорт, "ID_1023", мТаблица1.Области.П2.Значение, "ЧислоДес2");
							ЗаписатьЭлементXML(ДокЭкспорт, "ID_1024", мТаблица1.Области.П2_1.Значение, "ЧислоДес2");
							ЗаписатьЭлементXML(ДокЭкспорт, "ID_1026", мТаблица1.Области.П2_2.Значение, "ЧислоДес2");
							ЗаписатьЭлементXML(ДокЭкспорт, "ID_1027", мТаблица1.Области.П2_3.Значение, "ЧислоДес2");
							ЗаписатьЭлементXML(ДокЭкспорт, "ID_1028", мТаблица1.Области.П3.Значение, "ЧислоДес2");
							ЗаписатьЭлементXML(ДокЭкспорт, "ID_1030", мТаблица1.Области.П3_1.Значение, "ЧислоДес2");
							ЗаписатьЭлементXML(ДокЭкспорт, "ID_1031", мТаблица1.Области.П3_2.Значение, "ЧислоДес2");
							ЗаписатьЭлементXML(ДокЭкспорт, "ID_1032", мТаблица1.Области.П3_3.Значение, "ЧислоДес2");
							ЗаписатьЭлементXML(ДокЭкспорт, "ID_1037", мТаблица1.Области.П4.Значение, "ЧислоДес2");
							ЗаписатьЭлементXML(ДокЭкспорт, "ID_1038", мТаблица1.Области.П5.Значение, "ЧислоДес2");
							ЗаписатьЭлементXML(ДокЭкспорт, "ID_1039", мТаблица1.Области.П6.Значение, "ЧислоДес2");
							ЗаписатьЭлементXML(ДокЭкспорт, "ID_1040", мТаблица1.Области.П6_1.Значение, "ЧислоДес2");
							ЗаписатьЭлементXML(ДокЭкспорт, "ID_1041", мТаблица1.Области.П6_2.Значение, "ЧислоДес2");
							ЗаписатьЭлементXML(ДокЭкспорт, "ID_1060", мТаблица1.Области.П6_а.Значение, "ЧислоДес2");
							ЗаписатьЭлементXML(ДокЭкспорт, "ID_1042", мТаблица1.Области.П7.Значение, "ЧислоДес2");
							ЗаписатьЭлементXML(ДокЭкспорт, "ID_1043", мТаблица1.Области.П7_1.Значение, "ЧислоДес2");
							ЗаписатьЭлементXML(ДокЭкспорт, "ID_1044", мТаблица1.Области.П7_2.Значение, "ЧислоДес2");
							ЗаписатьЭлементXML(ДокЭкспорт, "ID_1061", мТаблица1.Области.П7_а.Значение, "ЧислоДес2");
							ЗаписатьЭлементXML(ДокЭкспорт, "ID_1058", мТаблица1.Области.СодержаниеОшибки.Значение, "ЧислоДес2");
							ЗаписатьЭлементXML(ДокЭкспорт, "ID_1046", мТаблица1.Области.П8.Значение, "ЧислоДес2");
							ЗаписатьЭлементXML(ДокЭкспорт, "ID_1047", мТаблица1.Области.П8_1.Значение, "ЧислоДес2");
							ЗаписатьЭлементXML(ДокЭкспорт, "ID_1048", мТаблица1.Области.П8_2.Значение, "ЧислоДес2");
						ДокЭкспорт.ЗаписатьКонецЭлемента();//ROZDIL_1
						
						///////////////////////////////////////////
						ДокЭкспорт.ЗаписатьНачалоЭлемента("ROZDIL_2");
							ЗаписатьЭлементXML(ДокЭкспорт, "ID_1049", мТаблица1.Области.ПР2_1.Значение, "ЧислоДес2");
							ЗаписатьЭлементXML(ДокЭкспорт, "ID_1050", мТаблица1.Области.ПР2_2.Значение, "ЧислоДес2");
							ЗаписатьЭлементXML(ДокЭкспорт, "ID_1051", мТаблица1.Области.ПР2_2_1.Значение, "ЧислоДес2");
							ЗаписатьЭлементXML(ДокЭкспорт, "ID_1052", мТаблица1.Области.ПР2_2_2.Значение, "ЧислоДес2");
							ЗаписатьЭлементXML(ДокЭкспорт, "ID_1053", мТаблица1.Области.ПР2_2_3.Значение, "ЧислоДес2");
							ЗаписатьЭлементXML(ДокЭкспорт, "ID_1054", мТаблица1.Области.ПР2_2_4.Значение, "ЧислоДес2");
							ЗаписатьЭлементXML(ДокЭкспорт, "ID_1055", мТаблица1.Области.ПР2_3.Значение, "ЧислоДес2");
							ЗаписатьЭлементXML(ДокЭкспорт, "ID_1056", мТаблица1.Области.ПР2_4.Значение, "ЧислоДес2");
							ЗаписатьЭлементXML(ДокЭкспорт, "ID_1059", мТаблица1.Области.СодержаниеОшибки1.Значение, "ЧислоДес2");
							ЗаписатьЭлементXML(ДокЭкспорт, "ID_1057", мТаблица1.Области.ПР2_5.Значение, "ЧислоДес2");
						ДокЭкспорт.ЗаписатьКонецЭлемента();//ROZDIL_2
						
						///////////////////////////////////////////
						ДокЭкспорт.ЗаписатьНачалоЭлемента("ROZDIL_3");
						СтруктураГруппы = Неопределено;
						мСтруктураМногострочныхРазделов.Свойство(мИдГруппы1А, СтруктураГруппы);
						//Если НЕ ТаблицаМногострочнойЧастиПуста(СтруктураГруппы, мИдГруппы1А)  Тогда
							Для каждого СтрокаГруппы Из СтруктураГруппы Цикл
							
								///////////////////////////////////////////
								ДокЭкспорт.ЗаписатьНачалоЭлемента("ROW");
									ЗаписатьЭлементXML(ДокЭкспорт, "REP_MONTH", СтрокаГруппы.Т1АМес,  "строка");
									ЗаписатьЭлементXML(ДокЭкспорт, "SUM_PREV",  СтрокаГруппы.Т1АСУМП, "ЧислоДес2");
									ЗаписатьЭлементXML(ДокЭкспорт, "SUM_NEXT",  СтрокаГруппы.Т1АСУМБ, "ЧислоДес2");
								ДокЭкспорт.ЗаписатьКонецЭлемента();//ROW
								
							КонецЦикла;
						//КонецЕсли;
						ДокЭкспорт.ЗаписатьКонецЭлемента();//ROZDIL_3
						ЗаписатьЭлементXML(ДокЭкспорт, "OPERADD", мСлужебныеДанные.Области.OPERADD.Значение, "числоЦел");
						
						///////////////////////////////////////////
						ДокЭкспорт.ЗаписатьНачалоЭлемента("ROZDIL_1DOD");
							ЗаписатьЭлементXML(ДокЭкспорт, "ID_1103", мТаблица1.Области.ЗадолжНач.Значение, "ЧислоДес2");
							ЗаписатьЭлементXML(ДокЭкспорт, "ID_1104", мТаблица1.Области.ЗадолжКон.Значение, "ЧислоДес2");
							ЗаписатьЭлементXML(ДокЭкспорт, "ID_1105", мТаблица1.Области.ПенсНачДт.Значение, "ЧислоДес2");
							ЗаписатьЭлементXML(ДокЭкспорт, "ID_1106", мТаблица1.Области.ПенсНачКт.Значение, "ЧислоДес2");
							ЗаписатьЭлементXML(ДокЭкспорт, "ID_1107", мТаблица1.Области.ДостПенсНач.Значение, "ЧислоДес2");
							ЗаписатьЭлементXML(ДокЭкспорт, "ID_1119", мТаблица1.Области.ДостПенсНач1а.Значение, "ЧислоДес2");
							ЗаписатьЭлементXML(ДокЭкспорт, "ID_1108", мТаблица1.Области.ПеняНач.Значение, "ЧислоДес2");
							ЗаписатьЭлементXML(ДокЭкспорт, "ID_1109", мТаблица1.Области.ШтрафНач.Значение, "ЧислоДес2");
							ЗаписатьЭлементXML(ДокЭкспорт, "ID_1110", мТаблица1.Области.ДрНач.Значение, "ЧислоДес2");
							ЗаписатьЭлементXML(ДокЭкспорт, "ID_1111", мТаблица1.Области.ПенсКонДт.Значение, "ЧислоДес2");
							ЗаписатьЭлементXML(ДокЭкспорт, "ID_1112", мТаблица1.Области.ПенсКонКт.Значение, "ЧислоДес2");
							ЗаписатьЭлементXML(ДокЭкспорт, "ID_1113", мТаблица1.Области.ДостПенсКон.Значение, "ЧислоДес2");
							ЗаписатьЭлементXML(ДокЭкспорт, "ID_1120", мТаблица1.Области.ДостПенсКон1а.Значение, "ЧислоДес2");
							ЗаписатьЭлементXML(ДокЭкспорт, "ID_1114", мТаблица1.Области.ПеняКон.Значение, "ЧислоДес2");
							ЗаписатьЭлементXML(ДокЭкспорт, "ID_1115", мТаблица1.Области.ФинСанкКон.Значение, "ЧислоДес2");
							ЗаписатьЭлементXML(ДокЭкспорт, "ID_1116", мТаблица1.Области.ДругиеКон.Значение, "ЧислоДес2");
							ЗаписатьЭлементXML(ДокЭкспорт, "ID_1117", мТаблица1.Области.СправочноВыплач.Значение, "ЧислоДес2");
							ЗаписатьЭлементXML(ДокЭкспорт, "ID_1118", мТаблица1.Области.НатурФорма.Значение, "ЧислоДес2");
						ДокЭкспорт.ЗаписатьКонецЭлемента();//ROZDIL_1DOD
						
						///////////////////////////////////////////
						ДокЭкспорт.ЗаписатьНачалоЭлемента("ROZDIL_2DOD");
							СтруктураГруппы = Неопределено;
							мСтруктураМногострочныхРазделов.Свойство(мИдГруппы1Б, СтруктураГруппы);
							//Если НЕ ТаблицаМногострочнойЧастиПуста(СтруктураГруппы, мИдГруппы1Б)  Тогда
								Для каждого СтрокаГруппы Из СтруктураГруппы Цикл
								
									///////////////////////////////////////////
									ДокЭкспорт.ЗаписатьНачалоЭлемента("ROW");
			                        	ЗаписатьЭлементXML(ДокЭкспорт, "MONTH", 		 СтрокаГруппы.Т1БМес, "строка");
										ЗаписатьЭлементXML(ДокЭкспорт, "WAGESFUND_PURE", СтрокаГруппы.Т1БФОП, "ЧислоДес2");
										ЗаписатьЭлементXML(ДокЭкспорт, "FACTOR_K",  	 СтрокаГруппы.Т1БКоэф, "ЧислоДес");
										ЗаписатьЭлементXML(ДокЭкспорт, "SUM",  			 СтрокаГруппы.Т1БКВыпл, "ЧислоДес2");
										ЗаписатьЭлементXML(ДокЭкспорт, "RATE_32",  		 СтрокаГруппы.Т1БКВыпл32, "ЧислоДес");
										ЗаписатьЭлементXML(ДокЭкспорт, "RATE_4",  		 СтрокаГруппы.Т1БКВыпл4, "ЧислоДес");
										ЗаписатьЭлементXML(ДокЭкспорт, "RATE_42",  		 СтрокаГруппы.Т1БКВыпл42, "ЧислоДес");
										ЗаписатьЭлементXML(ДокЭкспорт, "RATE_1_5",  	 СтрокаГруппы.Т1БКВыпл15, "ЧислоДес");
										ЗаписатьЭлементXML(ДокЭкспорт, "WAGESFUND_COUNT",СтрокаГруппы.Т1БФОПП, "ЧислоДес2");
								    ДокЭкспорт.ЗаписатьКонецЭлемента();//ROW
									
								КонецЦикла;
							//КонецЕсли;	
						ДокЭкспорт.ЗаписатьКонецЭлемента();//ROZDIL_2DOD
						
					ДокЭкспорт.ЗаписатьКонецЭлемента();//TABLE
						
					///////////////////////////////////////////
					ДокЭкспорт.ЗаписатьНачалоЭлемента("FOOTER");
						ЗаписатьЭлементXML(ДокЭкспорт, "BOSS_NUMIDENT", мПереченьТаблиц.Области.РуководительИНН.Значение);
						ЗаписатьЭлементXML(ДокЭкспорт, "FIRM_BOSS", 	мПереченьТаблиц.Области.РуководительФИО.Значение);
						ЗаписатьЭлементXML(ДокЭкспорт, "BUH_NUMIDENT", 	мПереченьТаблиц.Области.БухгалтерИНН.Значение);
						ЗаписатьЭлементXML(ДокЭкспорт, "FIRM_BUH", 		мПереченьТаблиц.Области.БухгалтерФИО.Значение);
					ДокЭкспорт.ЗаписатьКонецЭлемента();//FOOTER
				
				
				ДокЭкспорт.ЗаписатьКонецЭлемента();//PAGE
			
			ДокЭкспорт.ЗаписатьКонецЭлемента();//DECLARBODY
			
		ДокЭкспорт.ЗаписатьКонецЭлемента();//DECLAR
		
	ИначеЕсли ИмяТабличногоПоля = "ПолеТабличногоДокументаТаблица5" Тогда
		
		СтруктураГруппы = Неопределено;
		
		мСтруктураМногострочныхРазделов.Свойство(мИдГруппы5, СтруктураГруппы);
	
		Если ТаблицаМногострочнойЧастиПуста(СтруктураГруппы, мИдГруппы5) Тогда		
			ДокЭкспорт.Закрыть();
			СтруктураПараметровЛиста.Вставить("ИмяФайла", ИмяФайла);
			Возврат;
		КонецЕсли;
		
		НомерЛиста =  мПереченьТаблиц.Области.СтраницТаб1.Значение
				   + мПереченьТаблиц.Области.СтраницТаб2.Значение
				   + мПереченьТаблиц.Области.СтраницТаб3.Значение
				   + мПереченьТаблиц.Области.СтраницТаб4.Значение;
		
		ИмяФайлаБезРасширения = "P04T05" + ВерсияВыгрузкиPFZ;
		ИмяФайла              = ИмяФайлаБезРасширения+ ".xml";
		
		ДокЭкспорт.ОткрытьФайл(КаталогДанных + "\" + ИмяФайла, "windows-1251");
		ДокЭкспорт.ЗаписатьОбъявлениеXML();
		ДокЭкспорт.ЗаписатьНачалоЭлемента("DECLAR");
		
			ДокЭкспорт.ЗаписатьАтрибут("xmlns:xsi", "http://www.w3.org/2001/XMLSchema-instance");
			ДокЭкспорт.ЗаписатьАтрибут("xsi:noNamespaceSchemaLocation",ИмяФайлаБезРасширения+".xsd");

			ЗаписатьDeclarHead(ДокЭкспорт, ИмяФайла);
			
			ДокЭкспорт.ЗаписатьНачалоЭлемента("DECLARBODY");
			
			НоваяСтраница = Истина;
			КоличествоСтрок = 1;
			Для каждого СтрокаГруппы Из СтруктураГруппы Цикл
				
				Если НоваяСтраница Тогда
					НомерЛиста = НомерЛиста + 1;

					ДокЭкспорт.ЗаписатьНачалоЭлемента("PAGE");

					    ///////////////////////////////////////////
						ДокЭкспорт.ЗаписатьНачалоЭлемента("HEADER");                  					
							ЗаписатьЭлементXML(ДокЭкспорт, "PAGE_NUM",    НомерЛиста,							   "числоЦел");
							ЗаписатьЭлементXML(ДокЭкспорт, "FIRM_EDRPOU", мПереченьТаблиц.Области.ЕДРПОУ.Значение, "строка");
							ЗаписатьЭлементXML(ДокЭкспорт, "FIRM_FIL",    мПереченьТаблиц.Области.Филиал.Значение, "числоЦел", 1);
							ЗаписатьЭлементXML(ДокЭкспорт, "FORM_TYPE",   ПолучитьТипОтчетаДляВыгрузки(мТаблица5.Области.Начальная.Значение,
																									   мТаблица5.Области.Корректирующая.Значение,
																									   мТаблица5.Области.Отменяющая.Значение));
							ЗаписатьЭлементXML(ДокЭкспорт, "FIRM_NAME",    мПереченьТаблиц.Области.НазваниеОрганизации.Значение, "строка");
						ДокЭкспорт.ЗаписатьКонецЭлемента();//HEADER
						
						
						///////////////////////////////////////////
						ДокЭкспорт.ЗаписатьНачалоЭлемента("TABLE");
						
					КоличествоСтрок = 1;
					НоваяСтраница = Ложь;
				КонецЕсли;
				
							///////////////////////////////////////////
							ДокЭкспорт.ЗаписатьНачалоЭлемента("ROW");
								ЗаписатьЭлементXML(ДокЭкспорт, "ROWNUM", КоличествоСтрок, "числоЦел");
								ЗаписатьЭлементXML(ДокЭкспорт, "NUMIDENT", СтрокаГруппы.Т5_ДРФО, "строка");
								ЗаписатьЭлементXML(ДокЭкспорт, "LN", СтрокаГруппы.Т5_Фамилия, "строка");
								ЗаписатьЭлементXML(ДокЭкспорт, "NM", СтрокаГруппы.Т5_Имя, "строка");
								ЗаписатьЭлементXML(ДокЭкспорт, "FTN", СтрокаГруппы.Т5_Отчество, "строка");
								ЗаписатьЭлементXML(ДокЭкспорт, "START_DT", ?(ЗначениеЗаполнено(СтрокаГруппы.Т5_ДатаНач), День(СтрокаГруппы.Т5_ДатаНач),0), "числоЦел",Истина);
								ЗаписатьЭлементXML(ДокЭкспорт, "END_DT",   ?(ЗначениеЗаполнено(СтрокаГруппы.Т5_ДатаКон), День(СтрокаГруппы.Т5_ДатаКон),0), "числоЦел",Истина);
							ДокЭкспорт.ЗаписатьКонецЭлемента();//ROW
				
				Если КоличествоСтрок = 15 Тогда
					НоваяСтраница = Истина;
					
						ДокЭкспорт.ЗаписатьКонецЭлемента();//TABLE
						
						///////////////////////////////////////////
						ДокЭкспорт.ЗаписатьНачалоЭлемента("FOOTER");
							ЗаписатьЭлементXML(ДокЭкспорт, "ROWS", КоличествоСтрок, "числоЦел");
							ЗаписатьЭлементXML(ДокЭкспорт, "BOSS_NUMIDENT", мПереченьТаблиц.Области.РуководительИНН.Значение);
							ЗаписатьЭлементXML(ДокЭкспорт, "FIRM_BOSS", 	мПереченьТаблиц.Области.РуководительФИО.Значение);
							ЗаписатьЭлементXML(ДокЭкспорт, "BUH_NUMIDENT", 	мПереченьТаблиц.Области.БухгалтерИНН.Значение);
							ЗаписатьЭлементXML(ДокЭкспорт, "FIRM_BUH", 		мПереченьТаблиц.Области.БухгалтерФИО.Значение);
						ДокЭкспорт.ЗаписатьКонецЭлемента();//FOOTER
					
					ДокЭкспорт.ЗаписатьКонецЭлемента();//PAGE

				Иначе
					КоличествоСтрок = КоличествоСтрок + 1;
				КонецЕсли;
			
			КонецЦикла;
			
			Если НЕ НоваяСтраница Тогда
				
					ДокЭкспорт.ЗаписатьКонецЭлемента();//TABLE
					
					///////////////////////////////////////////
					ДокЭкспорт.ЗаписатьНачалоЭлемента("FOOTER");
							ЗаписатьЭлементXML(ДокЭкспорт, "ROWS", КоличествоСтрок - 1, "числоЦел");
							ЗаписатьЭлементXML(ДокЭкспорт, "BOSS_NUMIDENT", мПереченьТаблиц.Области.РуководительИНН.Значение);
							ЗаписатьЭлементXML(ДокЭкспорт, "FIRM_BOSS", 	мПереченьТаблиц.Области.РуководительФИО.Значение);
							ЗаписатьЭлементXML(ДокЭкспорт, "BUH_NUMIDENT", 	мПереченьТаблиц.Области.БухгалтерИНН.Значение);
							ЗаписатьЭлементXML(ДокЭкспорт, "FIRM_BUH", 		мПереченьТаблиц.Области.БухгалтерФИО.Значение);
					ДокЭкспорт.ЗаписатьКонецЭлемента();//FOOTER
				
				ДокЭкспорт.ЗаписатьКонецЭлемента();//PAGE
				
			КонецЕсли;			
			
			ДокЭкспорт.ЗаписатьКонецЭлемента();//DECLARBODY
			
		ДокЭкспорт.ЗаписатьКонецЭлемента();//DECLAR
		
	ИначеЕсли ИмяТабличногоПоля = "ПолеТабличногоДокументаТаблица6" Тогда
		
		СтруктураГруппы = Неопределено;
		
		мСтруктураМногострочныхРазделов.Свойство(мИдГруппы6, СтруктураГруппы);
	
		Если ТаблицаМногострочнойЧастиПуста(СтруктураГруппы, мИдГруппы6) Тогда		
			ДокЭкспорт.Закрыть();
			СтруктураПараметровЛиста.Вставить("ИмяФайла", ИмяФайла);
			Возврат;
		КонецЕсли;
		
		НомерЛиста = мПереченьТаблиц.Области.СтраницТаб1.Значение
				   + мПереченьТаблиц.Области.СтраницТаб2.Значение
				   + мПереченьТаблиц.Области.СтраницТаб3.Значение
				   + мПереченьТаблиц.Области.СтраницТаб4.Значение
				   + мПереченьТаблиц.Области.СтраницТаб5.Значение;
		
		ИмяФайлаБезРасширения = "P04T06" + ВерсияВыгрузкиPFZ;
		ИмяФайла              = ИмяФайлаБезРасширения+ ".xml";
		
		ДокЭкспорт.ОткрытьФайл(КаталогДанных + "\" + ИмяФайла, "windows-1251");
		ДокЭкспорт.ЗаписатьОбъявлениеXML();
		ДокЭкспорт.ЗаписатьНачалоЭлемента("DECLAR");
		
			ДокЭкспорт.ЗаписатьАтрибут("xmlns:xsi", "http://www.w3.org/2001/XMLSchema-instance");
			ДокЭкспорт.ЗаписатьАтрибут("xsi:noNamespaceSchemaLocation",ИмяФайлаБезРасширения+".xsd");

			ЗаписатьDeclarHead(ДокЭкспорт, ИмяФайла);
			
			ДокЭкспорт.ЗаписатьНачалоЭлемента("DECLARBODY");
			
			НоваяСтраница = Истина;
			КоличествоСтрок = 1;
			ИтогоНачислено = 0;
			ИтогоНачисленоМаксБаза = 0;
			ИтогоВзносы = 0;
			
			Для каждого СтрокаГруппы Из СтруктураГруппы Цикл
				
				Если НоваяСтраница Тогда
					НомерЛиста = НомерЛиста + 1;

					ДокЭкспорт.ЗаписатьНачалоЭлемента("PAGE");

					    ///////////////////////////////////////////
						ДокЭкспорт.ЗаписатьНачалоЭлемента("HEADER");                  					
							ЗаписатьЭлементXML(ДокЭкспорт, "FIRM_EDRPOU", мПереченьТаблиц.Области.ЕДРПОУ.Значение, "строка");
							ЗаписатьЭлементXML(ДокЭкспорт, "FIRM_FIL",    мПереченьТаблиц.Области.Филиал.Значение, "числоЦел", 1);
							ЗаписатьЭлементXML(ДокЭкспорт, "FORM_TYPE",   ПолучитьТипОтчетаДляВыгрузки(мТаблица6.Области.Начальная.Значение,
																									   ,
																									   мТаблица6.Области.Отменяющая.Значение));
							ЗаписатьЭлементXML(ДокЭкспорт, "FIRM_NAME",   мПереченьТаблиц.Области.НазваниеОрганизации.Значение, "строка");
							ЗаписатьЭлементXML(ДокЭкспорт, "PAGE_NUM",    НомерЛиста,							   "числоЦел");
						ДокЭкспорт.ЗаписатьКонецЭлемента();//HEADER
						
						
						///////////////////////////////////////////
						ДокЭкспорт.ЗаписатьНачалоЭлемента("TABLE");
						
					КоличествоСтрок = 1;
					НоваяСтраница = Ложь;
				КонецЕсли;
				
							///////////////////////////////////////////
							ДокЭкспорт.ЗаписатьНачалоЭлемента("ROW");
								ЗаписатьЭлементXML(ДокЭкспорт, "ROWNUM", 	КоличествоСтрок, 		 	"числоЦел");
								ЗаписатьЭлементXML(ДокЭкспорт, "NUMIDENT", 	СтрокаГруппы.Т6_ДРФО, 		"строка");
								ЗаписатьЭлементXML(ДокЭкспорт, "ZO", 		СтрокаГруппы.Т6_Категория,  "числоЦел");
								ЗаписатьЭлементXML(ДокЭкспорт, "ZIC", 		СтрокаГруппы.Т6_ТипСтавки, 	"числоЦел");
								
								//ЗаписатьЭлементXML(ДокЭкспорт, "LN_NM_FTN", СтрокаГруппы.Т6_ФИО
								//										+ ?(ЗначениеЗаполнено(СтрокаГруппы.Т6_Имя),       " " + Лев(СтрокаГруппы.Т6_Имя,1) + ".",      "")
								//										+ ?(ЗначениеЗаполнено(СтрокаГруппы.Т6_Отчество),  " " + Лев(СтрокаГруппы.Т6_Отчество,1)+ ".", "")
								//							 , "Строка");
								
								ЗаписатьЭлементXML(ДокЭкспорт, "LN",  СтрокаГруппы.Т6_ФИО, 		"строка");
								ЗаписатьЭлементXML(ДокЭкспорт, "NM",  СтрокаГруппы.Т6_Имя, 		"строка");
								ЗаписатьЭлементXML(ДокЭкспорт, "FTN", СтрокаГруппы.Т6_Отчество, "строка");
								
								ЗаписатьЭлементXML(ДокЭкспорт, "SUM_TOTAL", СтрокаГруппы.Т6_СуммаНачислено, 	  	"числоДес2");
								ЗаписатьЭлементXML(ДокЭкспорт, "SUM_MAX", 	СтрокаГруппы.Т6_СуммаНачисленоМаксБаза, "числоДес2");
								ЗаписатьЭлементXML(ДокЭкспорт, "SUM_INS", 	СтрокаГруппы.Т6_СуммаВзносов, 		  	"числоДес2");
								ЗаписатьЭлементXML(ДокЭкспорт, "OTK", 		СтрокаГруппы.Т6_ТрудКнижка, 			"числоЦел");
								ЗаписатьЭлементXML(ДокЭкспорт, "EXP", 		СтрокаГруппы.Т6_СпецСтаж,				"числоЦел");
							ДокЭкспорт.ЗаписатьКонецЭлемента();//ROW
							
							ИтогоНачислено 			= ИтогоНачислено 		 + СтрокаГруппы.Т6_СуммаНачислено;
							ИтогоНачисленоМаксБаза  = ИтогоНачисленоМаксБаза + СтрокаГруппы.Т6_СуммаНачисленоМаксБаза;
							ИтогоВзносы 			= ИтогоВзносы 			 + СтрокаГруппы.Т6_СуммаВзносов;
							
							
				Если КоличествоСтрок = 10 Тогда
					НоваяСтраница = Истина;
					
						ДокЭкспорт.ЗаписатьКонецЭлемента();//TABLE
						
						///////////////////////////////////////////
						ДокЭкспорт.ЗаписатьНачалоЭлемента("FOOTER");
							ЗаписатьЭлементXML(ДокЭкспорт, "PAGE_SUM_TOTAL", ИтогоНачислено, 	     "числоДес2");
							ЗаписатьЭлементXML(ДокЭкспорт, "PAGE_SUM_MAX",   ИтогоНачисленоМаксБаза, "числоДес2");
							ЗаписатьЭлементXML(ДокЭкспорт, "PAGE_SUM_INS",   ИтогоВзносы, 		     "числоДес2");
							ЗаписатьЭлементXML(ДокЭкспорт, "ROWS", КоличествоСтрок, "числоЦел");
							ЗаписатьЭлементXML(ДокЭкспорт, "BOSS_NUMIDENT", мПереченьТаблиц.Области.РуководительИНН.Значение);
							ЗаписатьЭлементXML(ДокЭкспорт, "FIRM_BOSS", 	мПереченьТаблиц.Области.РуководительФИО.Значение);
							ЗаписатьЭлементXML(ДокЭкспорт, "BUH_NUMIDENT", 	мПереченьТаблиц.Области.БухгалтерИНН.Значение);
							ЗаписатьЭлементXML(ДокЭкспорт, "FIRM_BUH", 		мПереченьТаблиц.Области.БухгалтерФИО.Значение);
						ДокЭкспорт.ЗаписатьКонецЭлемента();//FOOTER
					
					ДокЭкспорт.ЗаписатьКонецЭлемента();//PAGE
					
					ИтогоНачислено = 0;
					ИтогоНачисленоМаксБаза = 0;
					ИтогоВзносы = 0;

				Иначе
					КоличествоСтрок = КоличествоСтрок + 1;
				КонецЕсли;
			
			КонецЦикла;
			
			Если НЕ НоваяСтраница Тогда
				
					ДокЭкспорт.ЗаписатьКонецЭлемента();//TABLE
					
					///////////////////////////////////////////
					ДокЭкспорт.ЗаписатьНачалоЭлемента("FOOTER");
							ЗаписатьЭлементXML(ДокЭкспорт, "PAGE_SUM_TOTAL", ИтогоНачислено, 	     "числоДес2");
							ЗаписатьЭлементXML(ДокЭкспорт, "PAGE_SUM_MAX",   ИтогоНачисленоМаксБаза, "числоДес2");
							ЗаписатьЭлементXML(ДокЭкспорт, "PAGE_SUM_INS",   ИтогоВзносы, 		     "числоДес2");
							ЗаписатьЭлементXML(ДокЭкспорт, "ROWS", КоличествоСтрок - 1, "числоЦел");
							ЗаписатьЭлементXML(ДокЭкспорт, "BOSS_NUMIDENT", мПереченьТаблиц.Области.РуководительИНН.Значение);
							ЗаписатьЭлементXML(ДокЭкспорт, "FIRM_BOSS", 	мПереченьТаблиц.Области.РуководительФИО.Значение);
							ЗаписатьЭлементXML(ДокЭкспорт, "BUH_NUMIDENT", 	мПереченьТаблиц.Области.БухгалтерИНН.Значение);
							ЗаписатьЭлементXML(ДокЭкспорт, "FIRM_BUH", 		мПереченьТаблиц.Области.БухгалтерФИО.Значение);
					ДокЭкспорт.ЗаписатьКонецЭлемента();//FOOTER
				
				ДокЭкспорт.ЗаписатьКонецЭлемента();//PAGE
				
			КонецЕсли;			
			
			ДокЭкспорт.ЗаписатьКонецЭлемента();//DECLARBODY
			
		ДокЭкспорт.ЗаписатьКонецЭлемента();//DECLAR
		
	ИначеЕсли ИмяТабличногоПоля = "ПолеТабличногоДокументаТаблица7" Тогда
		
		СтруктураГруппы = Неопределено;
		
		мСтруктураМногострочныхРазделов.Свойство(мИдГруппы7, СтруктураГруппы);
	
		Если ТаблицаМногострочнойЧастиПуста(СтруктураГруппы, мИдГруппы7) Тогда		
			ДокЭкспорт.Закрыть();
			СтруктураПараметровЛиста.Вставить("ИмяФайла", ИмяФайла);
			Возврат;
		КонецЕсли;
		
		НомерЛиста = мПереченьТаблиц.Области.СтраницТаб1.Значение
				   + мПереченьТаблиц.Области.СтраницТаб2.Значение
				   + мПереченьТаблиц.Области.СтраницТаб3.Значение
				   + мПереченьТаблиц.Области.СтраницТаб4.Значение
				   + мПереченьТаблиц.Области.СтраницТаб5.Значение
				   + мПереченьТаблиц.Области.СтраницТаб6.Значение;
		
		ИмяФайлаБезРасширения = "P04T07" + ВерсияВыгрузкиPFZ;
		ИмяФайла              = ИмяФайлаБезРасширения+ ".xml";
		
		ДокЭкспорт.ОткрытьФайл(КаталогДанных + "\" + ИмяФайла, "windows-1251");
		ДокЭкспорт.ЗаписатьОбъявлениеXML();
		ДокЭкспорт.ЗаписатьНачалоЭлемента("DECLAR");
		
			ДокЭкспорт.ЗаписатьАтрибут("xmlns:xsi", "http://www.w3.org/2001/XMLSchema-instance");
			ДокЭкспорт.ЗаписатьАтрибут("xsi:noNamespaceSchemaLocation",ИмяФайлаБезРасширения+".xsd");

			ЗаписатьDeclarHead(ДокЭкспорт, ИмяФайла);
			
			ДокЭкспорт.ЗаписатьНачалоЭлемента("DECLARBODY");
			
			НоваяСтраница = Истина;
			КоличествоСтрок = 1;
			ИтогоНачислено = 0;
			ИтогоНачисленоМаксБаза = 0;
			ИтогоВзносы = 0;
			
			Для каждого СтрокаГруппы Из СтруктураГруппы Цикл
				
				Если НоваяСтраница Тогда
					НомерЛиста = НомерЛиста + 1;

					ДокЭкспорт.ЗаписатьНачалоЭлемента("PAGE");

					    ///////////////////////////////////////////
						ДокЭкспорт.ЗаписатьНачалоЭлемента("HEADER");                  					
							ЗаписатьЭлементXML(ДокЭкспорт, "FIRM_EDRPOU", мПереченьТаблиц.Области.ЕДРПОУ.Значение, "строка");
							ЗаписатьЭлементXML(ДокЭкспорт, "FIRM_FIL",    мПереченьТаблиц.Области.Филиал.Значение, "числоЦел", 1);
							ЗаписатьЭлементXML(ДокЭкспорт, "FORM_TYPE",   ПолучитьТипОтчетаДляВыгрузки(мТаблица7.Области.Начальная.Значение,
																									   ,
																									   мТаблица7.Области.Отменяющая.Значение));
							ЗаписатьЭлементXML(ДокЭкспорт, "FIRM_NAME",   мПереченьТаблиц.Области.НазваниеОрганизации.Значение, "строка");
							ЗаписатьЭлементXML(ДокЭкспорт, "PAGE_NUM",    НомерЛиста,							   "числоЦел");
						ДокЭкспорт.ЗаписатьКонецЭлемента();//HEADER
						
						
						///////////////////////////////////////////
						ДокЭкспорт.ЗаписатьНачалоЭлемента("TABLE");
						
					КоличествоСтрок = 1;
					НоваяСтраница = Ложь;
				КонецЕсли;
				
							///////////////////////////////////////////
							ДокЭкспорт.ЗаписатьНачалоЭлемента("ROW");
								ЗаписатьЭлементXML(ДокЭкспорт, "ROWNUM", 	КоличествоСтрок, 		 	"числоЦел");
								ЗаписатьЭлементXML(ДокЭкспорт, "NUMIDENT", 	СтрокаГруппы.Т7_ДРФО, 		"строка");
								ЗаписатьЭлементXML(ДокЭкспорт, "ZO", 		СтрокаГруппы.Т7_Категория,  "числоЦел");
								ЗаписатьЭлементXML(ДокЭкспорт, "ZIC", 		СтрокаГруппы.Т7_ТипСтавки, 	"числоЦел");
								
								ЗаписатьЭлементXML(ДокЭкспорт, "PAY_MNTH", 		Месяц(СтрокаГруппы.Т7_МесяцНачисления), "числоЦел");
								ЗаписатьЭлементXML(ДокЭкспорт, "PAY_YEAR", 		Год(СтрокаГруппы.Т7_МесяцНачисления), 	"числоЦел");
								ЗаписатьЭлементXML(ДокЭкспорт, "PAY_TP", 		СтрокаГруппы.Т7_ТипНачисления, 	"числоЦел");
								
								//ЗаписатьЭлементXML(ДокЭкспорт, "LN_NM_FTN", СтрокаГруппы.Т7_ФИО
								//										+ ?(ЗначениеЗаполнено(СтрокаГруппы.Т7_Имя),       " " + Лев(СтрокаГруппы.Т7_Имя,1) + ".",      "")
								//										+ ?(ЗначениеЗаполнено(СтрокаГруппы.Т7_Отчество),  " " + Лев(СтрокаГруппы.Т7_Отчество,1)+ ".", "")
								//							,"строка");
								
								ЗаписатьЭлементXML(ДокЭкспорт, "LN",  СтрокаГруппы.Т7_ФИО, 		"строка");
								ЗаписатьЭлементXML(ДокЭкспорт, "NM",  СтрокаГруппы.Т7_Имя, 		"строка");
								ЗаписатьЭлементXML(ДокЭкспорт, "FTN", СтрокаГруппы.Т7_Отчество, "строка");
								
								ЗаписатьЭлементXML(ДокЭкспорт, "SUM_TOTAL", СтрокаГруппы.Т7_СуммаНачислено, 	  	"числоДес2");
								ЗаписатьЭлементXML(ДокЭкспорт, "SUM_MAX", 	СтрокаГруппы.Т7_СуммаНачисленоМаксБаза, "числоДес2");
								ЗаписатьЭлементXML(ДокЭкспорт, "SUM_INS", 	СтрокаГруппы.Т7_СуммаВзносов, 		  	"числоДес2");
								ЗаписатьЭлементXML(ДокЭкспорт, "OTK", 		СтрокаГруппы.Т7_ТрудКнижка, 			"числоЦел");
								ЗаписатьЭлементXML(ДокЭкспорт, "EXP", 		СтрокаГруппы.Т7_СпецСтаж,				"числоЦел");
							ДокЭкспорт.ЗаписатьКонецЭлемента();//ROW
							
							ИтогоНачислено 			= ИтогоНачислено 		 + СтрокаГруппы.Т7_СуммаНачислено;
							ИтогоНачисленоМаксБаза  = ИтогоНачисленоМаксБаза + СтрокаГруппы.Т7_СуммаНачисленоМаксБаза;
							ИтогоВзносы 			= ИтогоВзносы 			 + СтрокаГруппы.Т7_СуммаВзносов;
							
							
				Если КоличествоСтрок = 10 Тогда
					НоваяСтраница = Истина;
	
						ЗаписатьЭлементXML(ДокЭкспорт, "PAGE_SUM_TOTAL", ИтогоНачислено, 	     "числоДес2");
						ЗаписатьЭлементXML(ДокЭкспорт, "PAGE_SUM_MAX",   ИтогоНачисленоМаксБаза, "числоДес2");
						ЗаписатьЭлементXML(ДокЭкспорт, "PAGE_SUM_INS",   ИтогоВзносы, 		     "числоДес2");
						ЗаписатьЭлементXML(ДокЭкспорт, "ROWS", КоличествоСтрок, "числоЦел");

						ДокЭкспорт.ЗаписатьКонецЭлемента();//TABLE
						
						///////////////////////////////////////////
						ДокЭкспорт.ЗаписатьНачалоЭлемента("FOOTER");
							ЗаписатьЭлементXML(ДокЭкспорт, "BOSS_NUMIDENT", мПереченьТаблиц.Области.РуководительИНН.Значение);
							ЗаписатьЭлементXML(ДокЭкспорт, "FIRM_BOSS", 	мПереченьТаблиц.Области.РуководительФИО.Значение);
							ЗаписатьЭлементXML(ДокЭкспорт, "BUH_NUMIDENT", 	мПереченьТаблиц.Области.БухгалтерИНН.Значение);
							ЗаписатьЭлементXML(ДокЭкспорт, "FIRM_BUH", 		мПереченьТаблиц.Области.БухгалтерФИО.Значение);
						ДокЭкспорт.ЗаписатьКонецЭлемента();//FOOTER
					
					ДокЭкспорт.ЗаписатьКонецЭлемента();//PAGE
					
					ИтогоНачислено = 0;
					ИтогоНачисленоМаксБаза = 0;
					ИтогоВзносы = 0;

				Иначе
					КоличествоСтрок = КоличествоСтрок + 1;
				КонецЕсли;
			
			КонецЦикла;
			
			Если НЕ НоваяСтраница Тогда
				
					ЗаписатьЭлементXML(ДокЭкспорт, "PAGE_SUM_TOTAL", ИтогоНачислено, 	     "числоДес2");
					ЗаписатьЭлементXML(ДокЭкспорт, "PAGE_SUM_MAX",   ИтогоНачисленоМаксБаза, "числоДес2");
					ЗаписатьЭлементXML(ДокЭкспорт, "PAGE_SUM_INS",   ИтогоВзносы, 		     "числоДес2");
					ЗаписатьЭлементXML(ДокЭкспорт, "ROWS", КоличествоСтрок - 1, "числоЦел");
					ДокЭкспорт.ЗаписатьКонецЭлемента();//TABLE
					
					///////////////////////////////////////////
					ДокЭкспорт.ЗаписатьНачалоЭлемента("FOOTER");
							ЗаписатьЭлементXML(ДокЭкспорт, "BOSS_NUMIDENT", мПереченьТаблиц.Области.РуководительИНН.Значение);
							ЗаписатьЭлементXML(ДокЭкспорт, "FIRM_BOSS", 	мПереченьТаблиц.Области.РуководительФИО.Значение);
							ЗаписатьЭлементXML(ДокЭкспорт, "BUH_NUMIDENT", 	мПереченьТаблиц.Области.БухгалтерИНН.Значение);
							ЗаписатьЭлементXML(ДокЭкспорт, "FIRM_BUH", 		мПереченьТаблиц.Области.БухгалтерФИО.Значение);
					ДокЭкспорт.ЗаписатьКонецЭлемента();//FOOTER
				
				ДокЭкспорт.ЗаписатьКонецЭлемента();//PAGE
				
			КонецЕсли;			
			
			ДокЭкспорт.ЗаписатьКонецЭлемента();//DECLARBODY
			
		ДокЭкспорт.ЗаписатьКонецЭлемента();//DECLAR
		
	ИначеЕсли ИмяТабличногоПоля = "ПолеТабличногоДокументаТаблица8" Тогда
		
		СтруктураГруппы = Неопределено;
		
		мСтруктураМногострочныхРазделов.Свойство(мИдГруппы8, СтруктураГруппы);
	
		Если ТаблицаМногострочнойЧастиПуста(СтруктураГруппы, мИдГруппы8) Тогда		
			ДокЭкспорт.Закрыть();
			СтруктураПараметровЛиста.Вставить("ИмяФайла", ИмяФайла);
			Возврат;
		КонецЕсли;
		
		НомерЛиста =  мПереченьТаблиц.Области.СтраницТаб1.Значение
				   + мПереченьТаблиц.Области.СтраницТаб2.Значение
				   + мПереченьТаблиц.Области.СтраницТаб3.Значение
				   + мПереченьТаблиц.Области.СтраницТаб4.Значение
				   + мПереченьТаблиц.Области.СтраницТаб5.Значение
				   + мПереченьТаблиц.Области.СтраницТаб6.Значение
				   + мПереченьТаблиц.Области.СтраницТаб7.Значение;
		
		ИмяФайлаБезРасширения = "P04T08" + ВерсияВыгрузкиPFZ;
		ИмяФайла              = ИмяФайлаБезРасширения+ ".xml";
		
		ДокЭкспорт.ОткрытьФайл(КаталогДанных + "\" + ИмяФайла, "windows-1251");
		ДокЭкспорт.ЗаписатьОбъявлениеXML();
		ДокЭкспорт.ЗаписатьНачалоЭлемента("DECLAR");
		
			ДокЭкспорт.ЗаписатьАтрибут("xmlns:xsi", "http://www.w3.org/2001/XMLSchema-instance");
			ДокЭкспорт.ЗаписатьАтрибут("xsi:noNamespaceSchemaLocation",ИмяФайлаБезРасширения+".xsd");

			ЗаписатьDeclarHead(ДокЭкспорт, ИмяФайла);
			
			ДокЭкспорт.ЗаписатьНачалоЭлемента("DECLARBODY");
			
			НоваяСтраница = Истина;
			КоличествоСтрок = 1;
			Для каждого СтрокаГруппы Из СтруктураГруппы Цикл
				
				Если НоваяСтраница Тогда
					НомерЛиста = НомерЛиста + 1;

					ДокЭкспорт.ЗаписатьНачалоЭлемента("PAGE");

					    ///////////////////////////////////////////
						ДокЭкспорт.ЗаписатьНачалоЭлемента("HEADER");                  					
							ЗаписатьЭлементXML(ДокЭкспорт, "FIRM_EDRPOU", мПереченьТаблиц.Области.ЕДРПОУ.Значение, "строка");
							ЗаписатьЭлементXML(ДокЭкспорт, "FIRM_FIL",    мПереченьТаблиц.Области.Филиал.Значение, "числоЦел",1);
							ЗаписатьЭлементXML(ДокЭкспорт, "FORM_TYPE",   ПолучитьТипОтчетаДляВыгрузки(мТаблица8.Области.Начальная.Значение,
																									   ,
																									   мТаблица8.Области.Отменяющая.Значение));
							ЗаписатьЭлементXML(ДокЭкспорт, "FIRM_NAME",   мПереченьТаблиц.Области.НазваниеОрганизации.Значение, "строка");
							ЗаписатьЭлементXML(ДокЭкспорт, "PAGE_NUM",    НомерЛиста,							   "числоЦел");
						ДокЭкспорт.ЗаписатьКонецЭлемента();//HEADER
						
						
						///////////////////////////////////////////
						ДокЭкспорт.ЗаписатьНачалоЭлемента("TABLE");
						
					КоличествоСтрок = 1;
					НоваяСтраница = Ложь;
				КонецЕсли;
				
							///////////////////////////////////////////
							ДокЭкспорт.ЗаписатьНачалоЭлемента("ROW");
								ЗаписатьЭлементXML(ДокЭкспорт, "ROWNUM", КоличествоСтрок, "числоЦел");
								ЗаписатьЭлементXML(ДокЭкспорт, "NUMIDENT", СтрокаГруппы.Т8_ДРФО, "строка");
								ЗаписатьЭлементXML(ДокЭкспорт, "C_PID", СтрокаГруппы.Т8_КодОснования, "строка");
								
								ЗаписатьЭлементXML(ДокЭкспорт, "START_DT", День(СтрокаГруппы.Т8_ДатаНач), "числоЦел");
								ЗаписатьЭлементXML(ДокЭкспорт, "STOP_DT",  День(СтрокаГруппы.Т8_ДатаКон), "числоЦел");
								
								ЗаписатьЭлементXML(ДокЭкспорт, "DAYS", СтрокаГруппы.Т8_Дней, "числоЦел");
								ЗаписатьЭлементXML(ДокЭкспорт, "NORMZ", СтрокаГруппы.Т8_НормоСмен, 	"числоЦел");
								ЗаписатьЭлементXML(ДокЭкспорт, "HH", СтрокаГруппы.Т8_Часов, 	"числоЦел");
								ЗаписатьЭлементXML(ДокЭкспорт, "MM", СтрокаГруппы.Т8_Минут, 	"числоЦел");
								ЗаписатьЭлементXML(ДокЭкспорт, "NORMA", СтрокаГруппы.Т8_Норма,  "строка");
								ЗаписатьЭлементXML(ДокЭкспорт, "SEASON", СтрокаГруппы.Т8_Сезон, "строка");
								
								//ЗаписатьЭлементXML(ДокЭкспорт, "LN_NM_FTN", СтрокаГруппы.Т8_ФИО
								//										+ ?(ЗначениеЗаполнено(СтрокаГруппы.Т8_Имя),       " " + Лев(СтрокаГруппы.Т8_Имя,1) + ".",      "")
								//										+ ?(ЗначениеЗаполнено(СтрокаГруппы.Т8_Отчество),  " " + Лев(СтрокаГруппы.Т8_Отчество,1)+ ".", "")
								//							,"строка");
								
								ЗаписатьЭлементXML(ДокЭкспорт, "LN",  СтрокаГруппы.Т8_ФИО, 		"строка");
								ЗаписатьЭлементXML(ДокЭкспорт, "NM",  СтрокаГруппы.Т8_Имя, 		"строка");
								ЗаписатьЭлементXML(ДокЭкспорт, "FTN", СтрокаГруппы.Т8_Отчество, "строка");
								
							ДокЭкспорт.ЗаписатьКонецЭлемента();//ROW
				
				Если КоличествоСтрок = 10 Тогда
					НоваяСтраница = Истина;
						ЗаписатьЭлементXML(ДокЭкспорт, "ROWS", КоличествоСтрок, "числоЦел");
						ДокЭкспорт.ЗаписатьКонецЭлемента();//TABLE
						
						///////////////////////////////////////////
						ДокЭкспорт.ЗаписатьНачалоЭлемента("FOOTER");
							ЗаписатьЭлементXML(ДокЭкспорт, "BOSS_NUMIDENT", мПереченьТаблиц.Области.РуководительИНН.Значение);
							ЗаписатьЭлементXML(ДокЭкспорт, "FIRM_BOSS", 	мПереченьТаблиц.Области.РуководительФИО.Значение);
							ЗаписатьЭлементXML(ДокЭкспорт, "BUH_NUMIDENT", 	мПереченьТаблиц.Области.БухгалтерИНН.Значение);
							ЗаписатьЭлементXML(ДокЭкспорт, "FIRM_BUH", 		мПереченьТаблиц.Области.БухгалтерФИО.Значение);
						ДокЭкспорт.ЗаписатьКонецЭлемента();//FOOTER
					
					ДокЭкспорт.ЗаписатьКонецЭлемента();//PAGE

				Иначе
					КоличествоСтрок = КоличествоСтрок + 1;
				КонецЕсли;
			
			КонецЦикла;
			
			Если НЕ НоваяСтраница Тогда
				
					ЗаписатьЭлементXML(ДокЭкспорт, "ROWS", КоличествоСтрок - 1, "числоЦел");
					ДокЭкспорт.ЗаписатьКонецЭлемента();//TABLE
					
					///////////////////////////////////////////
					ДокЭкспорт.ЗаписатьНачалоЭлемента("FOOTER");
							ЗаписатьЭлементXML(ДокЭкспорт, "BOSS_NUMIDENT", мПереченьТаблиц.Области.РуководительИНН.Значение);
							ЗаписатьЭлементXML(ДокЭкспорт, "FIRM_BOSS", 	мПереченьТаблиц.Области.РуководительФИО.Значение);
							ЗаписатьЭлементXML(ДокЭкспорт, "BUH_NUMIDENT", 	мПереченьТаблиц.Области.БухгалтерИНН.Значение);
							ЗаписатьЭлементXML(ДокЭкспорт, "FIRM_BUH", 		мПереченьТаблиц.Области.БухгалтерФИО.Значение);
					ДокЭкспорт.ЗаписатьКонецЭлемента();//FOOTER
				
				ДокЭкспорт.ЗаписатьКонецЭлемента();//PAGE
				
			КонецЕсли;			
			
			ДокЭкспорт.ЗаписатьКонецЭлемента();//DECLARBODY
			
		ДокЭкспорт.ЗаписатьКонецЭлемента();//DECLAR
		
	КонецЕсли;	

	ДокЭкспорт.Закрыть();
	СтруктураПараметровЛиста.Вставить("ИмяФайла", ИмяФайла);
	
КонецПроцедуры // ВывестиНаПечатьЛист()

Функция ПолучитьТипОтчетаДляВыгрузки(Начальная = "", Корректирующая = "", Отменяющая = "")

	Если ЗначениеЗаполнено(Отменяющая) Тогда
		Возврат 3;
	ИначеЕсли ЗначениеЗаполнено(Корректирующая) Тогда	
		Возврат 2;
	Иначе
		Возврат 1;
	КонецЕсли;	
	
КонецФункции

Процедура ЗаписатьЭлементXML(XML, ИмяЭлементы, Значение, Тип = "строка", НеВыгружатьПустое = Ложь);
	
	Если НеВыгружатьПустое И Не ЗначениеЗаполнено(Значение) Тогда
		Результат = "";
	ИначеЕсли ВРЕГ(Тип) = "ЧИСЛОЦЕЛ" Тогда	
	    Результат = Формат(Значение,"ЧДЦ=0; ЧН=; ЧГ=");
	ИначеЕсли ВРЕГ(Тип) = "ЧИСЛОДЕС2" Тогда	
	    Результат = Формат(Значение,"ЧДЦ=2; ЧРД=.; ЧН=; ЧГ=");
	ИначеЕсли ВРЕГ(Тип) = "ЧИСЛОДЕС" Тогда	
	    Результат = Формат(Значение,"ЧН=; ЧРД=.; ЧГ=");
	ИначеЕсли ВРЕГ(Тип) = "ДАТА" Тогда	
	    Результат = Формат(Значение,"ЧГ=; ДФ=ddMMyyyy");
	Иначе// "строка"
		Результат = СокрЛП(Строка(Значение));
	КонецЕсли;
	
	XML.ЗаписатьНачалоЭлемента(ИмяЭлементы);
	XML.ЗаписатьТекст(XMLСтрока(Результат));	
	XML.ЗаписатьКонецЭлемента();	
	
КонецПроцедуры

Процедура ЗаписатьDeclarHead(XML, ИмяФайла)
	
	XML.ЗаписатьНачалоЭлемента("DECLARHEAD");
		ЗаписатьЭлементXML(XML, "VER",      	"1.1");//ВерсияВыгрузкиPFZ);
		ЗаписатьЭлементXML(XML, "C_DOC",    	"P04");
		ЗаписатьЭлементXML(XML, "C_PFU",     	мПереченьТаблиц.Области.КодОрганаПФУ.Значение, "числоЦел");
		ЗаписатьЭлементXML(XML, "SOFTWARE",  	"");
		ЗаписатьЭлементXML(XML, "TIN",   		мПереченьТаблиц.Области.ЕДРПОУ.Значение, "числоЦел");
		ЗаписатьЭлементXML(XML, "PERIOD_MONTH", Месяц(мДатаНачалаПериодаОтчета), "числоЦел");
		ЗаписатьЭлементXML(XML, "PERIOD_YEAR",  ГОД(мДатаНачалаПериодаОтчета), "числоЦел");
		ЗаписатьЭлементXML(XML, "DATA_FILL",   	ДатаПодписи, "дата");
		ЗаписатьЭлементXML(XML, "ID_OUT",  		мПереченьТаблиц.Области.ИсхНомер.Значение, "строка");
	XML.ЗаписатьКонецЭлемента();//DECLARHEAD
	
КонецПроцедуры

Функция ОтказПриПроверкеРеквизитовДляВыгрузкиDBF()

	Отказ = Ложь;
	СтруктураГруппы = Неопределено;
	// проверка реквизитов Таблиц 5-8
	ТекИдГруппы = мИдГруппы5; 
	мСтруктураМногострочныхРазделов.Свойство(ТекИдГруппы, СтруктураГруппы);
	Если НЕ ТаблицаМногострочнойЧастиПуста(СтруктураГруппы, ТекИдГруппы) Тогда		
		Для каждого Строка Из СтруктураГруппы Цикл
			Если    Не ЗначениеЗаполнено(Строка[ТекИдГруппы + "ДРФО"])
				ИЛИ Не ЗначениеЗаполнено(Строка[ТекИдГруппы + "Фамилия"])
				ИЛИ Не ЗначениеЗаполнено(Строка[ТекИдГруппы + "Имя"]) Тогда
			
				Отказ = Истина;
				Сообщить(НСтр("ru = 'Таблица '; uk = 'Таблиця'") + Сред(ТекИдГруппы,2,1)                + ", "
				       + НСТР("ru = 'строка '; uk = 'рядок '")     + (СтруктураГруппы.Индекс(Строка) + 1) + ": " 
					   + НСТР("ru = 'не заполнен код ДРФО или фамилия или имя сотрудника!'; uk = 'не заповнений код ДРФО або призвище або ім''я співробітника!'"));
			
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	ТекИдГруппы = мИдГруппы6; 
	мСтруктураМногострочныхРазделов.Свойство(ТекИдГруппы, СтруктураГруппы);
	Если НЕ ТаблицаМногострочнойЧастиПуста(СтруктураГруппы, ТекИдГруппы) Тогда		
		Для каждого Строка Из СтруктураГруппы Цикл
			Если    Не ЗначениеЗаполнено(Строка[ТекИдГруппы + "ДРФО"])
				ИЛИ Не ЗначениеЗаполнено(Строка[ТекИдГруппы + "ФИО"])
				ИЛИ Не ЗначениеЗаполнено(Строка[ТекИдГруппы + "Имя"]) Тогда
			
				Отказ = Истина;
				Сообщить(НСтр("ru = 'Таблица '; uk = 'Таблиця'") + Сред(ТекИдГруппы,2,1)                + ", "
				       + НСТР("ru = 'строка '; uk = 'рядок '")     + (СтруктураГруппы.Индекс(Строка) + 1) + ": " 
					   + НСТР("ru = 'не заполнен код ДРФО или фамилия или имя сотрудника!'; uk = 'не заповнений код ДРФО або призвище або ім''я співробітника!'"));
			
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	ТекИдГруппы = мИдГруппы7; 
	мСтруктураМногострочныхРазделов.Свойство(ТекИдГруппы, СтруктураГруппы);
	Если НЕ ТаблицаМногострочнойЧастиПуста(СтруктураГруппы, ТекИдГруппы) Тогда		
		Для каждого Строка Из СтруктураГруппы Цикл
			Если    Не ЗначениеЗаполнено(Строка[ТекИдГруппы + "ДРФО"])
				ИЛИ Не ЗначениеЗаполнено(Строка[ТекИдГруппы + "ФИО"])
				ИЛИ Не ЗначениеЗаполнено(Строка[ТекИдГруппы + "Имя"]) Тогда
			
				Отказ = Истина;
				Сообщить(НСтр("ru = 'Таблица '; uk = 'Таблиця'") + Сред(ТекИдГруппы,2,1)                + ", "
				       + НСТР("ru = 'строка '; uk = 'рядок '")     + (СтруктураГруппы.Индекс(Строка) + 1) + ": " 
					   + НСТР("ru = 'не заполнен код ДРФО или фамилия или имя сотрудника!'; uk = 'не заповнений код ДРФО або призвище або ім''я співробітника!'"));
			
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	ТекИдГруппы = мИдГруппы8; 
	мСтруктураМногострочныхРазделов.Свойство(ТекИдГруппы, СтруктураГруппы);
	Если НЕ ТаблицаМногострочнойЧастиПуста(СтруктураГруппы, ТекИдГруппы) Тогда		
		Для каждого Строка Из СтруктураГруппы Цикл
			Если    Не ЗначениеЗаполнено(Строка[ТекИдГруппы + "ДРФО"])
				ИЛИ Не ЗначениеЗаполнено(Строка[ТекИдГруппы + "ФИО"])
				ИЛИ Не ЗначениеЗаполнено(Строка[ТекИдГруппы + "Имя"])
				ИЛИ Не ЗначениеЗаполнено(Строка[ТекИдГруппы + "КодОснования"]) Тогда
			
				Отказ = Истина;
				Сообщить(НСтр("ru = 'Таблица '; uk = 'Таблиця'") + Сред(ТекИдГруппы,2,1)                + ", "
				       + НСТР("ru = 'строка '; uk = 'рядок '")     + (СтруктураГруппы.Индекс(Строка) + 1) + ": " 
					   + НСТР("ru = 'не заполнен код ДРФО или фамилия или имя сотрудника; или код основания учета спецстажа!'; uk = 'не заповнений код ДРФО або призвище або ім''я співробітника; або код підстави обліку спецстажу!'"));
			
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат Отказ;

КонецФункции // ()

Процедура ВыгрузитьЛистВDBF(СтруктураПараметровЛиста)
	
	Перем ИмяТабличногоПоля;
	Перем ИмяФайла;
	
	СтруктураПараметровЛиста.Свойство("ИмяТабличногоПоля",  ИмяТабличногоПоля);
	
	ДокЭкспорт = Новый XBase;
	ДокЭкспорт.Кодировка = КодировкаXBase.ANSI; //windows
	
	Если ИмяТабличногоПоля = "ПолеТабличногоДокументаПереченьТаблиц" Тогда
		
		// не выгружаем
		СтруктураПараметровЛиста.Вставить("ИмяФайла", ИмяФайла);
		Возврат;
		
	ИначеЕсли ИмяТабличногоПоля = "ПолеТабличногоДокументаТаблица1" Тогда
		
		// не выгружаем
		СтруктураПараметровЛиста.Вставить("ИмяФайла", ИмяФайла);
		Возврат;
		
	ИначеЕсли ИмяТабличногоПоля = "ПолеТабличногоДокументаТаблица5" Тогда
		
		СтруктураГруппы = Неопределено;
		
		мСтруктураМногострочныхРазделов.Свойство(мИдГруппы5, СтруктураГруппы);
	
		Если ТаблицаМногострочнойЧастиПуста(СтруктураГруппы, мИдГруппы5) Тогда		
			ДокЭкспорт.ЗакрытьФайл();
			СтруктураПараметровЛиста.Вставить("ИмяФайла", ИмяФайла);
			Возврат;
		КонецЕсли;
		
		ИмяФайлаБезРасширения = "P04T05" + ВерсияВыгрузкиPFZ;
		ИмяФайла              = ИмяФайлаБезРасширения+ ".DBF";
		
		ДокЭкспорт.поля.Добавить("ROWNUM",		"N", 10);
		ДокЭкспорт.поля.Добавить("NUMIDENT",	"C", 10);
		ДокЭкспорт.поля.Добавить("LN",			"C", 100);
		ДокЭкспорт.поля.Добавить("NM",			"C", 100);
		ДокЭкспорт.поля.Добавить("FTN",			"C", 100);
		ДокЭкспорт.поля.Добавить("START_DT",	"N", 2);
		ДокЭкспорт.поля.Добавить("END_DT",		"N", 2);
		
		ДокЭкспорт.СоздатьФайл(КаталогДанных + "\" + ИмяФайла);
		ДокЭкспорт.АвтоСохранение = Истина;
		Если ДокЭкспорт.Первая() Тогда
			ДокЭкспорт.Очистить();
		КонецЕсли;
		
		КоличествоСтрок = 1;
		Для каждого СтрокаГруппы Из СтруктураГруппы Цикл
			
			ДокЭкспорт.Добавить();
			докЭкспорт.ROWNUM 	= КоличествоСтрок;
			докЭкспорт.NUMIDENT = СтрокаГруппы.Т5_ДРФО;
			докЭкспорт.LN		= СтрокаГруппы.Т5_Фамилия;
			докЭкспорт.NM		= СтрокаГруппы.Т5_Имя;
			докЭкспорт.FTN		= СтрокаГруппы.Т5_Отчество;
			докЭкспорт.START_DT = ?(ЗначениеЗаполнено(СтрокаГруппы.Т5_ДатаНач), День(СтрокаГруппы.Т5_ДатаНач),"");
			докЭкспорт.END_DT   = ?(ЗначениеЗаполнено(СтрокаГруппы.Т5_ДатаКон), День(СтрокаГруппы.Т5_ДатаКон),"");
			
			КоличествоСтрок = КоличествоСтрок + 1;

		КонецЦикла;
			
	ИначеЕсли ИмяТабличногоПоля = "ПолеТабличногоДокументаТаблица6" Тогда
		
		СтруктураГруппы = Неопределено;
		
		мСтруктураМногострочныхРазделов.Свойство(мИдГруппы6, СтруктураГруппы);
	
		Если ТаблицаМногострочнойЧастиПуста(СтруктураГруппы, мИдГруппы6) Тогда		
			ДокЭкспорт.ЗакрытьФайл();
			СтруктураПараметровЛиста.Вставить("ИмяФайла", ИмяФайла);
			Возврат;
		КонецЕсли;
		
		ИмяФайлаБезРасширения = "P04T06" + ВерсияВыгрузкиPFZ;
		ИмяФайла              = ИмяФайлаБезРасширения+ ".DBF";
		
		ДокЭкспорт.поля.Добавить("ROWNUM",		"N", 10);
		ДокЭкспорт.поля.Добавить("NUMIDENT",	"C", 10);
		ДокЭкспорт.поля.Добавить("LN",			"C", 251);
		ДокЭкспорт.поля.Добавить("NM",			"C", 251);
		ДокЭкспорт.поля.Добавить("FTN",			"C", 251);
		ДокЭкспорт.поля.Добавить("ZO",			"N", 1);
		ДокЭкспорт.поля.Добавить("ZIC",			"N", 2);
		ДокЭкспорт.поля.Добавить("SUM_TOTAL",	"N", 16,2);
		ДокЭкспорт.поля.Добавить("SUM_MAX",		"N", 16,2);
		ДокЭкспорт.поля.Добавить("SUM_INS",		"N", 16,2);
		ДокЭкспорт.поля.Добавить("OTK",			"N", 1);
		ДокЭкспорт.поля.Добавить("EXP",			"N", 1);
		
		ДокЭкспорт.СоздатьФайл(КаталогДанных + "\" + ИмяФайла);
		ДокЭкспорт.АвтоСохранение = Истина;
		Если ДокЭкспорт.Первая() Тогда
			ДокЭкспорт.Очистить();
		КонецЕсли;
		
		КоличествоСтрок = 1;
		Для каждого СтрокаГруппы Из СтруктураГруппы Цикл
			
			ДокЭкспорт.Добавить();
			докЭкспорт.ROWNUM 	= КоличествоСтрок;
			докЭкспорт.NUMIDENT = СтрокаГруппы.Т6_ДРФО;
			докЭкспорт.LN		= СтрокаГруппы.Т6_ФИО;
			докЭкспорт.NM		= СтрокаГруппы.Т6_Имя;
			докЭкспорт.FTN		= СтрокаГруппы.Т6_Отчество;
			докЭкспорт.ZO		= СтрокаГруппы.Т6_Категория;
			докЭкспорт.ZIC		= СтрокаГруппы.Т6_ТипСтавки;
			докЭкспорт.SUM_TOTAL= СтрокаГруппы.Т6_СуммаНачислено;
			докЭкспорт.SUM_MAX	= СтрокаГруппы.Т6_СуммаНачисленоМаксБаза;
			докЭкспорт.SUM_INS	= СтрокаГруппы.Т6_СуммаВзносов;
			докЭкспорт.OTK		= СтрокаГруппы.Т6_ТрудКнижка;
			докЭкспорт.EXP		= СтрокаГруппы.Т6_СпецСтаж;
			
			КоличествоСтрок = КоличествоСтрок + 1;

		КонецЦикла;
		
	ИначеЕсли ИмяТабличногоПоля = "ПолеТабличногоДокументаТаблица7" Тогда
		СтруктураГруппы = Неопределено;
		
		мСтруктураМногострочныхРазделов.Свойство(мИдГруппы7, СтруктураГруппы);
	
		Если ТаблицаМногострочнойЧастиПуста(СтруктураГруппы, мИдГруппы7) Тогда		
			ДокЭкспорт.ЗакрытьФайл();
			СтруктураПараметровЛиста.Вставить("ИмяФайла", ИмяФайла);
			Возврат;
		КонецЕсли;
		
		ИмяФайлаБезРасширения = "P04T07" + ВерсияВыгрузкиPFZ;
		ИмяФайла              = ИмяФайлаБезРасширения+ ".DBF";
		
		ДокЭкспорт.поля.Добавить("ROWNUM",		"N", 10);
		ДокЭкспорт.поля.Добавить("NUMIDENT",	"C", 10);
		ДокЭкспорт.поля.Добавить("LN",			"C", 251);
		ДокЭкспорт.поля.Добавить("NM",			"C", 251);
		ДокЭкспорт.поля.Добавить("FTN",			"C", 251);
		ДокЭкспорт.поля.Добавить("ZO",			"N", 1);
		ДокЭкспорт.поля.Добавить("ZIC",			"N", 2);
		
		ДокЭкспорт.поля.Добавить("PAY_MNTH",	"N", 2);
		ДокЭкспорт.поля.Добавить("PAY_YEAR",	"N", 4);
		ДокЭкспорт.поля.Добавить("PAY_TP",		"N", 1);

		ДокЭкспорт.поля.Добавить("SUM_TOTAL",	"N", 16,2);
		ДокЭкспорт.поля.Добавить("SUM_MAX",		"N", 16,2);
		ДокЭкспорт.поля.Добавить("SUM_INS",		"N", 16,2);
		ДокЭкспорт.поля.Добавить("OTK",			"N", 1);
		ДокЭкспорт.поля.Добавить("EXP",			"N", 1);
		
		ДокЭкспорт.СоздатьФайл(КаталогДанных + "\" + ИмяФайла);
		ДокЭкспорт.АвтоСохранение = Истина;
		Если ДокЭкспорт.Первая() Тогда
			ДокЭкспорт.Очистить();
		КонецЕсли;
		
		КоличествоСтрок = 1;
		Для каждого СтрокаГруппы Из СтруктураГруппы Цикл
			
			ДокЭкспорт.Добавить();
			докЭкспорт.ROWNUM 	= КоличествоСтрок;
			докЭкспорт.NUMIDENT = СтрокаГруппы.Т7_ДРФО;
			докЭкспорт.LN		= СтрокаГруппы.Т7_ФИО;
			докЭкспорт.NM		= СтрокаГруппы.Т7_Имя;
			докЭкспорт.FTN		= СтрокаГруппы.Т7_Отчество;
			докЭкспорт.ZO		= СтрокаГруппы.Т7_Категория;
			докЭкспорт.ZIC		= СтрокаГруппы.Т7_ТипСтавки;
			
			докЭкспорт.PAY_MNTH	= Месяц(СтрокаГруппы.Т7_МесяцНачисления);
			докЭкспорт.PAY_YEAR	= Год(СтрокаГруппы.Т7_МесяцНачисления);
			докЭкспорт.PAY_TP	= СтрокаГруппы.Т7_ТипНачисления;
			
			докЭкспорт.SUM_TOTAL= СтрокаГруппы.Т7_СуммаНачислено;
			докЭкспорт.SUM_MAX	= СтрокаГруппы.Т7_СуммаНачисленоМаксБаза;
			докЭкспорт.SUM_INS	= СтрокаГруппы.Т7_СуммаВзносов;
			докЭкспорт.OTK		= СтрокаГруппы.Т7_ТрудКнижка;
			докЭкспорт.EXP		= СтрокаГруппы.Т7_СпецСтаж;
			
			КоличествоСтрок = КоличествоСтрок + 1;

		КонецЦикла;

		
	ИначеЕсли ИмяТабличногоПоля = "ПолеТабличногоДокументаТаблица8" Тогда
		СтруктураГруппы = Неопределено;
		
		мСтруктураМногострочныхРазделов.Свойство(мИдГруппы8, СтруктураГруппы);
	
		Если ТаблицаМногострочнойЧастиПуста(СтруктураГруппы, мИдГруппы8) Тогда		
			ДокЭкспорт.ЗакрытьФайл();
			СтруктураПараметровЛиста.Вставить("ИмяФайла", ИмяФайла);
			Возврат;
		КонецЕсли;
		
		ИмяФайлаБезРасширения = "P04T08" + ВерсияВыгрузкиPFZ;
		ИмяФайла              = ИмяФайлаБезРасширения+ ".DBF";
		
		ДокЭкспорт.поля.Добавить("ROWNUM",		"N", 10);
		ДокЭкспорт.поля.Добавить("NUMIDENT",	"C", 10);
		ДокЭкспорт.поля.Добавить("LN",			"C", 251);
		ДокЭкспорт.поля.Добавить("NM",			"C", 251);
		ДокЭкспорт.поля.Добавить("FTN",			"C", 251);
		
		ДокЭкспорт.поля.Добавить("C_PID",		"C", 9);
		ДокЭкспорт.поля.Добавить("DAYS",		"N", 2);
		
		ДокЭкспорт.поля.Добавить("START_DT",	"N", 2);
		ДокЭкспорт.поля.Добавить("STOP_DT",		"N", 2);

		ДокЭкспорт.поля.Добавить("NORMZ",		"N", 3);
		ДокЭкспорт.поля.Добавить("HH",			"N", 3);
		ДокЭкспорт.поля.Добавить("MM",			"N", 2);
		ДокЭкспорт.поля.Добавить("SEASON",		"N", 1);
		ДокЭкспорт.поля.Добавить("NORMA",		"N", 3);
		
		ДокЭкспорт.СоздатьФайл(КаталогДанных + "\" + ИмяФайла);
		ДокЭкспорт.АвтоСохранение = Истина;
		Если ДокЭкспорт.Первая() Тогда
			ДокЭкспорт.Очистить();
		КонецЕсли;
		
		КоличествоСтрок = 1;
		Для каждого СтрокаГруппы Из СтруктураГруппы Цикл
			
			ДокЭкспорт.Добавить();
			докЭкспорт.ROWNUM 	= КоличествоСтрок;
			докЭкспорт.NUMIDENT = СтрокаГруппы.Т8_ДРФО;
			докЭкспорт.LN		= СтрокаГруппы.Т8_ФИО;
			докЭкспорт.NM		= СтрокаГруппы.Т8_Имя;
			докЭкспорт.FTN		= СтрокаГруппы.Т8_Отчество;
			докЭкспорт.C_PID	= СтрокаГруппы.Т8_КодОснования;
			докЭкспорт.DAYS		= СтрокаГруппы.Т8_Дней;
			докЭкспорт.START_DT	= День(СтрокаГруппы.Т8_ДатаНач);
			докЭкспорт.STOP_DT	= День(СтрокаГруппы.Т8_ДатаКон);
			докЭкспорт.NORMZ	= СтрокаГруппы.Т8_НормоСмен;
			докЭкспорт.HH		= СтрокаГруппы.Т8_Часов;
			докЭкспорт.MM		= СтрокаГруппы.Т8_Минут;
			докЭкспорт.SEASON	= СтрокаГруппы.Т8_Сезон;
			докЭкспорт.NORMA	= СтрокаГруппы.Т8_Норма;
			
			КоличествоСтрок = КоличествоСтрок + 1;

		КонецЦикла;
		
	КонецЕсли;	

	ДокЭкспорт.ЗакрытьФайл();
	СтруктураПараметровЛиста.Вставить("ИмяФайла", ИмяФайла);
	
КонецПроцедуры // ВывестиНаПечатьЛист()

Процедура КоманднаяПанельДействийdbf(Кнопка)
	
	Перем ИмяФайла, ДокЭкспорт;
	
	Если Модифицированность И НЕ Сохранить() Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ПроверитьСуществованиеКаталога() Тогда
		Предупреждение(НСтр("ru='Необходимо указать существуюций каталог для сохранения файлов DBF!'; uk='Необхідно вказати каталог існуючий каталог для збереження файлів DBF!'"));
		Возврат;
	КонецЕсли;
	
	Если НайтиФайлы(КаталогДанных, "P04T*.DBF").Количество() > 0 Тогда
		Если НЕ Вопрос(НСтр("ru = 'Все DBF-файлы в каталоге сохранения будут удалены! Продолжить?'; uk = 'Усі DBF-файли в каталозі збереження будут видалені! Продовжити?'"), РежимДиалогаВопрос.ДаНетОтмена) = КодВозвратаДиалога.Да Тогда
			Возврат;
		КонецЕсли;
		
		Попытка
			УдалитьФайлы(КаталогДанных, "P04T*.DBF");
		Исключение
			Сообщить(ОписаниеОшибки());
		КонецПопытки;
		 
	КонецЕсли;
	
	ОбновитьСтруктуруМногострочныхРазделов();
	
	Если ОтказПриПроверкеРеквизитовДляВыгрузкиDBF() Тогда
		Если НЕ Вопрос(Нстр("ru = 'При проверке заполнения отчета обнаружены ошибки!
                             |Продолжить выгрузку отчета?'; uk = 'При перевірці заповнення звіту виявлені помилки!
                             |Продовжити вивантаження звіту?'"), РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
			Возврат;	
		КонецЕсли;
	КонецЕсли;
	
	// Иницилизация докумета сохранения выгрузки
	НовыйДок = Документы.ВыгрузкаРегламентированныхОтчетов.СоздатьДокумент();
	НовыйДок.Очистить = Истина;
	НовыйДок.Комментарий = Комментарий;	
	СпДокОсн = Новый СписокЗначений;
	СпДокОсн.Добавить(мСохраненныйДок);
	ГлобСтруктФайловВыгрузки = Новый Структура;
	ФормаВыгрузки = НовыйДок.ПолучитьФорму(, ЭтотОбъект);
	
	СтруктураПараметров = Новый Структура();
	СчетчикДокОсн = 0;
	Для Каждого СтрокаУровня1 Из мДеревоВыбранныхСтраниц.Строки Цикл
		
		СчетчикДокОсн = СчетчикДокОсн + 1;
		
		СтруктураПараметров.Вставить("ИмяФайла",   		  "");
		СтруктураПараметров.Вставить("ИмяТабличногоПоля", СтрокаУровня1.ИмяПоляТабличногоДокум);
		
		ВыгрузитьЛистВDBF(СтруктураПараметров);
		
		СтруктураПараметров.Свойство("ИмяФайла",  ИмяФайла);
		
		Если НЕ ЗначениеЗаполнено(ИмяФайла) Тогда
			// таблица не выгружалась
			Продолжить;
		КонецЕсли;
		
		ФормаВыгрузки.СформироватьИЗаписать(СпДокОсн, КаталогДанных +"\"+ИмяФайла, СчетчикДокОсн, , ,"DBF");	
		ГлобСтруктФайловВыгрузки.Вставить("FileName" + Лев(ИмяФайла, СтрДлина(ИмяФайла)-4), Новый ДвоичныеДанные(КаталогДанных +"\" + ИмяФайла));
		
	КонецЦикла;
	
	// сохранение файла выгрузки
	//НовыйДок.ИсходныйФайл = ГлобСтруктФайловВыгрузки;
	//Попытка
	//	НовыйДок.Записать();
	//Исключение
	//КонецПопытки;
	
	Предупреждение(Нстр("ru = 'Выгрузка выполнена успешно!'; uk = 'Вивантаження виконане вдало!'"));
	
КонецПроцедуры

Процедура КаталогДанныхОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	КомандаСистемы("explorer " + КаталогДанных);
	
КонецПроцедуры

Процедура ПолеТабличногоДокументаТаблица1Выбор(Элемент, Область, СтандартнаяОбработка)
	
	Если Область.Имя = "ДопОперацииНеБыли" Тогда
		мСлужебныеДанные.Области.OPERADD.Значение = 0;
		ЗаполнитьОтображениеДанныхВТаблицах();		
	ИначеЕсли Область.Имя = "ДопОперацииБыли" Тогда
		мСлужебныеДанные.Области.OPERADD.Значение = 1;
		ЗаполнитьОтображениеДанныхВТаблицах();		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПолеТабличногоДокументаСлужебныеДанныеПриИзмененииСодержимогоОбласти(Элемент, Область)
	ЗаполнитьОтображениеДанныхВТаблицах();
КонецПроцедуры

Процедура ПолеТабличногоДокументаТаблица1R29C9НачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	
	ДопустимыеСтатусы = Новый СписокЗначений();
	ДопустимыеСтатусы.Добавить("Платник збору на загальних підставах");
	ДопустимыеСтатусы.Добавить("Платник єдиного податку");
	ДопустимыеСтатусы.Добавить("Платник спец. патенту");
	ДопустимыеСтатусы.Добавить("Платник фіксованого податку");
	ДопустимыеСтатусы.Добавить("Платник фіксованого сільськогосподарського податку");
	
	Элемент.СписокВыбора  = ДопустимыеСтатусы;
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ

// Список выбора поля выбора "Единица измерения"
ЭлементыФормы.ПолеВыбораЕдиницаИзмерения.СписокВыбора.Добавить(Перечисления.ПорядкиОкругленияОтчетности.Окр1,       НСтр("ru='в гривнях';uk='у гривнях'"));
ЭлементыФормы.ПолеВыбораЕдиницаИзмерения.СписокВыбора.Добавить(Перечисления.ПорядкиОкругленияОтчетности.Окр1000,    НСтр("ru='в тысячах гривень';uk='у тисячах гривень'"));
ЭлементыФормы.ПолеВыбораЕдиницаИзмерения.СписокВыбора.Добавить(Перечисления.ПорядкиОкругленияОтчетности.Окр1000000, НСтр("ru='в миллионах гривень';uk='у мільйонах гривень'"));


// Список выбора поля выбора "ВариантЗаполнения"
ЭлементыФормы.ПолеВыбораВариантЗаполненияТаблица1.СписокВыбора.Добавить(1, НСтр("ru='не заполнять автоматически';uk='не заповнювати автоматично'"));
ЭлементыФормы.ПолеВыбораВариантЗаполненияТаблица1.СписокВыбора.Добавить(2, НСтр("ru='заполнять автоматически с корректировкой';uk='заповнювати автоматично з коригуванням'"));
ЭлементыФормы.ПолеВыбораВариантЗаполненияТаблица1.СписокВыбора.Добавить(3, НСтр("ru='заполнять автоматически без корректировки';uk='заповнювати автоматично без коригування'"));

//Список выьбора для полей содержащих месяца 
СписокВыбораМесяца = Новый СписокЗначений;
СписокВыбораМесяца.Добавить("Січень","Січень");
СписокВыбораМесяца.Добавить("Лютий","Лютий");
СписокВыбораМесяца.Добавить("Березень","Березень");
СписокВыбораМесяца.Добавить("Квітень","Квітень");
СписокВыбораМесяца.Добавить("Травень","Травень");
СписокВыбораМесяца.Добавить("Червень","Червень");
СписокВыбораМесяца.Добавить("Липень","Липень");
СписокВыбораМесяца.Добавить("Серпень","Серпень");
СписокВыбораМесяца.Добавить("Вересень","Вересень");
СписокВыбораМесяца.Добавить("Жовтень","Жовтень");
СписокВыбораМесяца.Добавить("Листопад","Листопад");
СписокВыбораМесяца.Добавить("Грудень","Грудень");
ЭлементыФормы.ПолеТабличногоДокументаТаблица1.Области.Т1А0001Мес.ЭлементУправления.СписокВыбора = СписокВыбораМесяца;
ЭлементыФормы.ПолеТабличногоДокументаТаблица1.Области.Т1Б0001Мес.ЭлементУправления.СписокВыбора = СписокВыбораМесяца;


ОписаниеТиповЧисло = ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15,2);
ОписаниеТиповЧисло0 = ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(10,0);
ОписаниеТиповСтрока = ОбщегоНазначения.ПолучитьОписаниеТиповСтроки(254);
ОписаниеТиповСтрока10  = ОбщегоНазначения.ПолучитьОписаниеТиповСтроки(10);
МассивТипов = Новый Массив;
МассивТипов.Добавить(Тип("Дата"));
ОписаниеТиповДата = Новый ОписаниеТипов(МассивТипов, , Новый КвалификаторыДаты(ЧастиДаты.Дата));


мИдГруппы1А = "Т1А";
мИдГруппы1Б = "Т1Б";
мИдГруппы5  = "Т5_";
мИдГруппы6  = "Т6_";
мИдГруппы7  = "Т7_";
мИдГруппы8  = "Т8_";


КолИсхСтрокИдГруппы1А = 1;
КолИсхСтрокИдГруппы1Б = 1;
КолИсхСтрокИдГруппы5  = 1;
КолИсхСтрокИдГруппы6  = 1;
КолИсхСтрокИдГруппы7  = 1;
КолИсхСтрокИдГруппы8  = 1;

СтруктураГруппы1А = Новый ТаблицаЗначений;
СтруктураГруппы1А.Колонки.Добавить("Т1АМес",    ОписаниеТиповСтрока10);
СтруктураГруппы1А.Колонки.Добавить("Т1АСУМП",  ОписаниеТиповЧисло);
СтруктураГруппы1А.Колонки.Добавить("Т1АСУМБ",  ОписаниеТиповЧисло);

СтруктураГруппы1Б = Новый ТаблицаЗначений;
СтруктураГруппы1Б.Колонки.Добавить("Т1БМес",     ОписаниеТиповСтрока10);
СтруктураГруппы1Б.Колонки.Добавить("Т1БФОП",     ОписаниеТиповЧисло);
СтруктураГруппы1Б.Колонки.Добавить("Т1БКоэф",    ОписаниеТиповЧисло);
СтруктураГруппы1Б.Колонки.Добавить("Т1БКВыпл",   ОписаниеТиповЧисло);
СтруктураГруппы1Б.Колонки.Добавить("Т1БКВыпл32", ОписаниеТиповЧисло);
СтруктураГруппы1Б.Колонки.Добавить("Т1БКВыпл4",  ОписаниеТиповЧисло);
СтруктураГруппы1Б.Колонки.Добавить("Т1БКВыпл42", ОписаниеТиповЧисло);
СтруктураГруппы1Б.Колонки.Добавить("Т1БКВыпл15", ОписаниеТиповЧисло);
СтруктураГруппы1Б.Колонки.Добавить("Т1БФОПП",    ОписаниеТиповЧисло);

СтруктураГруппы5 = Новый ТаблицаЗначений;
СтруктураГруппы5.Колонки.Добавить("Т5_ДРФО",    ОписаниеТиповСтрока10);
СтруктураГруппы5.Колонки.Добавить("Т5_Фамилия", ОписаниеТиповСтрока);
СтруктураГруппы5.Колонки.Добавить("Т5_Имя",     ОписаниеТиповСтрока);
СтруктураГруппы5.Колонки.Добавить("Т5_Отчество",ОписаниеТиповСтрока);
СтруктураГруппы5.Колонки.Добавить("Т5_ДатаНач", ОписаниеТиповДата);
СтруктураГруппы5.Колонки.Добавить("Т5_ДатаКон", ОписаниеТиповДата);

СтруктураГруппы6 = Новый ТаблицаЗначений;
СтруктураГруппы6.Колонки.Добавить("Т6_ДРФО",               ОписаниеТиповСтрока10);
СтруктураГруппы6.Колонки.Добавить("Т6_ФИО", 			   ОписаниеТиповСтрока);;//ТОЛЬКО ФАМИЛИЯ!!!!
СтруктураГруппы6.Колонки.Добавить("Т6_Имя", 		   ОписаниеТиповСтрока);
СтруктураГруппы6.Колонки.Добавить("Т6_Отчество", 	   ОписаниеТиповСтрока);
СтруктураГруппы6.Колонки.Добавить("Т6_Категория",      ОписаниеТиповЧисло0);
СтруктураГруппы6.Колонки.Добавить("Т6_ТипСтавки",      ОписаниеТиповЧисло0);
СтруктураГруппы6.Колонки.Добавить("Т6_СуммаНачислено", ОписаниеТиповЧисло);
СтруктураГруппы6.Колонки.Добавить("Т6_СуммаНачисленоМаксБаза", ОписаниеТиповЧисло);
СтруктураГруппы6.Колонки.Добавить("Т6_СуммаВзносов",   ОписаниеТиповЧисло);
СтруктураГруппы6.Колонки.Добавить("Т6_ТрудКнижка",     ОписаниеТиповЧисло0);
СтруктураГруппы6.Колонки.Добавить("Т6_СпецСтаж",       ОписаниеТиповЧисло0);

СтруктураГруппы7 = Новый ТаблицаЗначений;
СтруктураГруппы7.Колонки.Добавить("Т7_ДРФО",           ОписаниеТиповСтрока10);
СтруктураГруппы7.Колонки.Добавить("Т7_ФИО", 		   ОписаниеТиповСтрока);//ТОЛЬКО ФАМИЛИЯ!!!!
СтруктураГруппы7.Колонки.Добавить("Т7_Имя", 		   ОписаниеТиповСтрока);
СтруктураГруппы7.Колонки.Добавить("Т7_Отчество", 	   ОписаниеТиповСтрока);
СтруктураГруппы7.Колонки.Добавить("Т7_Категория",      ОписаниеТиповЧисло0);
СтруктураГруппы7.Колонки.Добавить("Т7_ТипСтавки",      ОписаниеТиповЧисло0);
СтруктураГруппы7.Колонки.Добавить("Т7_МесяцНачисления",ОписаниеТиповДата);
СтруктураГруппы7.Колонки.Добавить("Т7_ТипНачисления",  ОписаниеТиповЧисло0);
СтруктураГруппы7.Колонки.Добавить("Т7_СуммаНачислено", ОписаниеТиповЧисло);
СтруктураГруппы7.Колонки.Добавить("Т7_СуммаНачисленоМаксБаза", ОписаниеТиповЧисло);
СтруктураГруппы7.Колонки.Добавить("Т7_СуммаВзносов",   ОписаниеТиповЧисло);
СтруктураГруппы7.Колонки.Добавить("Т7_ТрудКнижка",     ОписаниеТиповЧисло0);
СтруктураГруппы7.Колонки.Добавить("Т7_СпецСтаж",       ОписаниеТиповЧисло0);

СтруктураГруппы8 = Новый ТаблицаЗначений;
СтруктураГруппы8.Колонки.Добавить("Т8_ДРФО",         ОписаниеТиповСтрока10);
СтруктураГруппы8.Колонки.Добавить("Т8_ФИО", 		 ОписаниеТиповСтрока);;//ТОЛЬКО ФАМИЛИЯ!!!!
СтруктураГруппы8.Колонки.Добавить("Т8_Имя", 		 ОписаниеТиповСтрока);
СтруктураГруппы8.Колонки.Добавить("Т8_Отчество", 	 ОписаниеТиповСтрока);
СтруктураГруппы8.Колонки.Добавить("Т8_КодОснования", ОписаниеТиповСтрока);
СтруктураГруппы8.Колонки.Добавить("Т8_ДатаНач",   	 ОписаниеТиповДата);
СтруктураГруппы8.Колонки.Добавить("Т8_ДатаКон",   	 ОписаниеТиповДата);
СтруктураГруппы8.Колонки.Добавить("Т8_Дней",      	 ОписаниеТиповЧисло0);
СтруктураГруппы8.Колонки.Добавить("Т8_НормоСмен", 	 ОписаниеТиповЧисло0);
СтруктураГруппы8.Колонки.Добавить("Т8_Часов",     	 ОписаниеТиповЧисло0);
СтруктураГруппы8.Колонки.Добавить("Т8_Минут",     	 ОписаниеТиповЧисло0);
СтруктураГруппы8.Колонки.Добавить("Т8_Норма",     	 ОписаниеТиповЧисло0);
СтруктураГруппы8.Колонки.Добавить("Т8_Сезон",     	 ОписаниеТиповЧисло0);

// структура многострочных разделов формы
мСтруктураМногострочныхРазделов = Новый Структура;
мСтруктураМногострочныхРазделов.Вставить(мИдГруппы1А, СтруктураГруппы1А);
мСтруктураМногострочныхРазделов.Вставить(мИдГруппы1Б, СтруктураГруппы1Б);
мСтруктураМногострочныхРазделов.Вставить(мИдГруппы5, СтруктураГруппы5);
мСтруктураМногострочныхРазделов.Вставить(мИдГруппы6, СтруктураГруппы6);
мСтруктураМногострочныхРазделов.Вставить(мИдГруппы7, СтруктураГруппы7);
мСтруктураМногострочныхРазделов.Вставить(мИдГруппы8, СтруктураГруппы8);

// структура исходных строк (минимального кол-ва) многострочных разделов формы
мСтруктураИсхКолвоСтрокРазделов = Новый Структура;
мСтруктураИсхКолвоСтрокРазделов.Вставить(мИдГруппы1А, КолИсхСтрокИдГруппы1А);
мСтруктураИсхКолвоСтрокРазделов.Вставить(мИдГруппы1Б, КолИсхСтрокИдГруппы1Б);
мСтруктураИсхКолвоСтрокРазделов.Вставить(мИдГруппы5, КолИсхСтрокИдГруппы5);
мСтруктураИсхКолвоСтрокРазделов.Вставить(мИдГруппы6, КолИсхСтрокИдГруппы6);
мСтруктураИсхКолвоСтрокРазделов.Вставить(мИдГруппы7, КолИсхСтрокИдГруппы7);
мСтруктураИсхКолвоСтрокРазделов.Вставить(мИдГруппы8, КолИсхСтрокИдГруппы8);
 
ЦветЗаполняетсяТолькоВручную    = Новый Цвет(255, 255, 225);
ЦветЗаполняетсяАвтоКорректир    = Новый Цвет(255, 240, 200);
ЦветЗаполняетсяАвтоБезКорректир = Новый Цвет(230, 240, 220);

// структура цветов раскраски автозаполняемых ячеек
мСтруктураЦветовРаскраски = Новый Структура;
мСтруктураЦветовРаскраски.Вставить("_1", ЦветЗаполняетсяТолькоВручную);
мСтруктураЦветовРаскраски.Вставить("_2", ЦветЗаполняетсяАвтоКорректир);
мСтруктураЦветовРаскраски.Вставить("_3", ЦветЗаполняетсяАвтоБезКорректир);

мСоставПоказателей = "СоставПоказателей2010Янв";

// ОПИСАНИЕ ПАРМЕТРОВ ФОРМЫ
//
// Версия формы
//мВерсияФормы = "01/01/2010";
мВерсияФормы = "01/02/2010";
мПечатныеФормы = Новый СписокЗначений;

ЕстьДуплекс = ВосстановитьЗначение("РегламентированныеОтчеты_ЕстьДуплекс");
Если НЕ ТипЗнч(ЕстьДуплекс) = Тип("Булево") Тогда
	ЕстьДуплекс = Ложь;	
КонецЕсли;

ВерсияВыгрузкиPFZ = "B";