
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

// Готовит дерево значений, в котором будет храниться список регламентированных 
// отчетов, на основе списка, хранящегося в макете обработке. Показывает дерево
// для установи пользователем отметок - какие именно отчеты следует обновлять.
//   На основе подготовленого списка выполяет обновление списка отчетов в 
// справочнике регламентированные отчеты.
//
Процедура ОбновитьСписокОтчетов() Экспорт
	
	// Хранит дерево значений - список обновляемых отчетов с иерархией.
	Перем ДеревоОтчетов;
	
	// Заполним список отчетов
	ДеревоОтчетов = ПолучитьСписокОтчетов();

	Если ДеревоОтчетов.Строки.Количество() = 0 Тогда
		// нет обновлений
		Возврат;
	КонецЕсли;

	// Показываем форму пользователю для выбора отчетов, которые необходимо 
	// обновить.
	ФормаВыбораОтчетов = ПолучитьФорму("ФормаВыбораОтчетов", ЭтаФорма, "дляВыбораРегламОтчетов");

	Если ФормаВыбораОтчетов.Открыта() Тогда
		ФормаВыбораОтчетов.Активизировать();
		Если Вопрос(НСтр("ru='Предыдущая операция выбора обновляемых отчетов не завершена."
"Завершить?';uk='Попередня операція вибору оновлюваних звітів не завершена."
"Завершити?'"),РежимДиалогаВопрос.ДаНет,30,КодВозвратаДиалога.Да)=КодВозвратаДиалога.Да Тогда
			ФормаВыбораОтчетов.Закрыть();
		КонецЕсли;
	КонецЕсли;

	ФормаВыбораОтчетов.НачальноеЗначениеВыбора = ДеревоОтчетов;
	ДеревоОтчетов = ФормаВыбораОтчетов.ОткрытьМодально();

	Если ДеревоОтчетов = Неопределено Тогда
		Возврат;
	КонецЕсли;

	// Заполняем справочник РегламентированныеОтчеты списком отчетов.
	ЗаполнитьСписокОтчетов(ДеревоОтчетов);

КонецПроцедуры // ОбновитьСписокОтчетов()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

// Процедура - обработчик события "ПередОткрытием" формы.
//
Процедура ПередОткрытием(Отказ, СтандартнаяОбработка)

	Отказ = Истина;

	Если Вопрос(НСтр("ru='Обновить комплект отчетности?';uk='Оновити комплект звітності?'"), РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да) = КодВозвратаДиалога.Да Тогда

		ОбновитьСписокОтчетов();

	КонецЕсли;

КонецПроцедуры // ПередОткрытием()
