
Процедура КнопкаОКНажатие(Элемент)
	
	Закрыть(КодВозвратаДиалога.ОК);	
	
КонецПроцедуры

Процедура КнопкаОтменаНажатие(Элемент)
	
	Закрыть();
	
КонецПроцедуры

Процедура КоманднаяПанель1УстановитьФлажки(Кнопка)
	
	Для Каждого СтрокаТаблицы Из ТаблицаСтраниц Цикл
		СтрокаТаблицы.Использование = Истина;
	КонецЦикла;
	
КонецПроцедуры

Процедура КоманднаяПанель1СнятьФлажки(Кнопка)
	
	Для Каждого СтрокаТаблицы Из ТаблицаСтраниц Цикл
		СтрокаТаблицы.Использование = Ложь;
	КонецЦикла;
	
КонецПроцедуры
