
////////////////////////////////////////////////////////////////////////////////
// ВСПОМОГАТЕЛЬНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Формирует таблицу для выбора
//
// Параметры:
//	Нет.
//
Процедура СформироватьТаблицу()
	
	ТабличноеПолеВыбораИсточников.Очистить();
	НаборЭлементовСправочника = Справочники.ИсточникиИнформации.Выбрать(,,,"Наименование");
	
	Пока  НаборЭлементовСправочника.Следующий() Цикл
		НоваяСтрока = ТабличноеПолеВыбораИсточников.Добавить();
		НоваяСтрока.Источник = НаборЭлементовСправочника.Ссылка;	
		НоваяСтрока.Показ = Не (НаборИсточников.НайтиПоЗначению(НаборЭлементовСправочника.Ссылка) = неопределено);
		
	КонецЦикла;

КонецПроцедуры // СформироватьТаблицу

// Формирует список значений из таблицы выбора
//
// Параметры:
//	Нет.
//
Процедура СформироватьНаборИсточников()
	
     НаборИсточников.Очистить();
	 
	 Для каждого СтрокаТаблицы из ТабличноеПолеВыбораИсточников Цикл
		 Если СтрокаТаблицы.Показ Тогда
		  НаборИсточников.Добавить(СтрокаТаблицы.Источник);	 
			 
		 КонецЕсли;
	 КонецЦикла;
	 
КонецПроцедуры // СформироватьНаборИсточников

///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ


// Обработчик события "При открытии" основной Формы. 
//
Процедура ПередОткрытием(Отказ, СтандартнаяОбработка)
	
	СформироватьТаблицу()
	
КонецПроцедуры // ПередОткрытием

///////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ ДЕЙСТВИЙ ПОЛЬЗОВАТЕЛЯ

// Процедура устанавливает пометку у всех строк таблицы.
Процедура УстановитьВсеНажатие(Элемент)
	
	Для каждого СтрокаТаблицы из ТабличноеПолеВыбораИсточников Цикл
		СтрокаТаблицы.Показ = Истина;
	КонецЦикла;
	
КонецПроцедуры // УстановитьВсеНажатие 

// Процедура снимает пометку у всех строк таблицы.
Процедура СнятьВсеНажатие(Элемент)
	
	Для каждого СтрокаТаблицы из ТабличноеПолеВыбораИсточников Цикл
		СтрокаТаблицы.Показ = Ложь;
	КонецЦикла;

КонецПроцедуры // СнятьВсеНажатие

// Процедура закрывает форму и перестраивает отчет.
Процедура ОсновныеДействияФормыОК(Кнопка)
	
	СформироватьНаборИсточников();
	ВладелецФормы.ОбновитьОтчет();
	ЭтаФорма.Закрыть();
	
КонецПроцедуры // ОсновныеДействияФормыОК







