////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

Процедура ПриОткрытии()
	
	ПолеВводаТекст = ТиповойОтвет;
	
КонецПроцедуры

Процедура ПриЗакрытии()
	
	СформироватьТиповойОтвет();
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ДЕЙСТВИЯ КОМАНДНЫХ ПАНЕЛЕЙ ФОРМЫ

Процедура СформироватьТиповойОтвет()
	
	ТиповойОтвет = ПолеВводаТекст;
	
КонецПроцедуры

// Процедура вызывается при нажатии кнопки ОК.
// 
// Параметры
//  Кнопка - кнопка, по нажатию которой запускается данная процедура.
Процедура ОсновныеДействияФормыОК(Кнопка)
	
	СформироватьТиповойОтвет();
	ЭтаФорма.Закрыть();
	
КонецПроцедуры

