
Процедура РегистрСведенийСписокПередНачаломДобавления(Элемент, Отказ, Копирование)
	
	ВыбркаЗаписей = РегистрыСведений.УчетнаяПолитикаПоПерсоналу.Выбрать();
	Пока ВыбркаЗаписей.Следующий() Цикл
		Сообщить(НСтр("ru='В учетной политике по персоналу может быть только одна запись';uk='В обліковій політиці по персоналу може бути тільки один запис'"),СтатусСообщения.Внимание);
		Отказ = Истина;
		Прервать;
	КонецЦикла;
	
КонецПроцедуры

Процедура РегистрСведенийСписокПослеУдаления(Элемент)
	
	глУчетнаяПолитикаПоПерсоналу = ЗаполнениеУчетнойПолитикиПоПерсоналу();
	
КонецПроцедуры


