Процедура КнопкаВыполнитьНажатие(Кнопка)
	РасчетныйЛисток	= Отчеты.РасчетныеЛисткиОрганизаций.Создать();
	РасчетныйЛистокФорма = РасчетныйЛисток.ПолучитьФорму();
	РасчетныйЛистокФорма.СпособОтображенияОкна = ВариантСпособаОтображенияОкна.Максимизированное;
	РасчетныйЛистокФорма.Открыть();
	
	ДокументРезультат = РасчетныйЛистокФорма.ЭлементыФормы.Результат;	
	ФормаОтправкиПочты = ПолучитьФорму("ФормаОтправкиПочты",РасчетныйЛистокФорма);
	ФормаОтправкиПочты.ТабличныйДокумент = ДокументРезультат;
	ФормаОтправкиПочты.РазрешитьСоединятьОкно			= Истина;
	ФормаОтправкиПочты.РазрешитьСостояниеПрикрепленное	= Истина;
	ФормаОтправкиПочты.РазрешитьСостояниеПрячущееся		= Истина;
	ФормаОтправкиПочты.ПоложениеПрикрепленногоОкна		= ВариантПрикрепленияОкна.Низ;
	//ФормаОтправкиПочты.Ширина = 200;
	//ФормаОтправкиПочты.ПоложениеОкна					= ВариантПоложенияОкна.НеПерекрыватьВладельца;
	ФормаОтправкиПочты.СоединяемоеОкно = Истина;
	Попытка
		ФормаОтправкиПочты.СостояниеОкна = ВариантСостоянияОкна.Прикрепленное;
	Исключение
	КонецПопытки;
	ФормаОтправкиПочты.Открыть();
КонецПроцедуры

Процедура КнопкаВыполнитьНажатие_(Кнопка)
	РасчетныйЛисток	= Отчеты.РасчетныеЛисткиОрганизаций.Создать();
	РасчетныйЛистокФорма = РасчетныйЛисток.ПолучитьФорму();
	
	ДокументРезультат = РасчетныйЛистокФорма.ЭлементыФормы.Результат;
	//РасчетныйЛисток.СформироватьОтчет(ДокументРезультат);
	Верх = ДокументРезультат.Верх;
	ДокументРезультат.Высота = ДокументРезультат.Высота-20;
	КоманднаяПанель1 = РасчетныйЛистокФорма.ЭлементыФормы.Добавить(Тип("КоманднаяПанель"),"КоманднаяПанель1",Истина);
	КоманднаяПанель1.Верх = ДокументРезультат.Верх+ДокументРезультат.Высота+1;
	КоманднаяПанель1.Высота = 20;
	КоманднаяПанель1.Ширина = РасчетныйЛистокФорма.ЭлементыФормы.ДействияФормы.Ширина;
	//Установка привязок
	ПервыйЭлемент = Неопределено;
	ГраницаПервогоЭлемента = Неопределено;
	ВторойЭлемент = Неопределено;
	ГраницаВторогоЭлемента = Неопределено;
	
	ДокументРезультат.ПолучитьПривязку(ГраницаЭлементаУправления.Низ, ПервыйЭлемент, ГраницаПервогоЭлемента, ВторойЭлемент, ГраницаВторогоЭлемента);
	
	КоманднаяПанель1.УстановитьПривязку(ГраницаЭлементаУправления.Верх,КоманднаяПанель1,ГраницаЭлементаУправления.Низ);
	КоманднаяПанель1.УстановитьПривязку(ГраницаЭлементаУправления.Низ,ПервыйЭлемент,ГраницаЭлементаУправления.Низ);
	
	ДокументРезультат.ПолучитьПривязку(ГраницаЭлементаУправления.Право, ПервыйЭлемент, ГраницаПервогоЭлемента, ВторойЭлемент, ГраницаВторогоЭлемента);
	
	КоманднаяПанель1.УстановитьПривязку(ГраницаЭлементаУправления.Право,ПервыйЭлемент,ГраницаЭлементаУправления.Право);
    КоманднаяПанель1.ВыравниваниеКнопок = ВыравниваниеКнопокКоманднойПанели.Право;
	//НоваяКнопка = КоманднаяПанель1.Кнопки.Добавить("ОтправитьПоЭлПочте", ТипКнопкиКоманднойПанели.Действие, "Отправить по эл. почте",Новый Действие("ОтправитьПоЭлПочте"));
	//НоваяКнопка.Картинка = БиблиотекаКартинок.ПочтовоеПисьмоИсходящее;
	//НоваяКнопка.Отображение = ОтображениеКнопкиКоманднойПанели.НадписьКартинка;
	//НоваяКнопка.Доступность = Истина;
	//КоманднаяПанель1.Кнопки.Добавить();
	НоваяКнопка = РасчетныйЛистокФорма.ЭлементыФормы.Добавить(Тип("Кнопка"),"ОтправитьПоЭлПочте",Истина);
	НоваяКнопка.Верх = КоманднаяПанель1.Верх;
	НоваяКнопка.Высота = КоманднаяПанель1.Высота;
	НоваяКнопка.Лево = КоманднаяПанель1.Лево+КоманднаяПанель1.Ширина-150;
	НоваяКнопка.Ширина = 150;
	НоваяКнопка.УстановитьПривязку(ГраницаЭлементаУправления.Верх,НоваяКнопка,ГраницаЭлементаУправления.Низ);
	НоваяКнопка.УстановитьПривязку(ГраницаЭлементаУправления.Низ,КоманднаяПанель1,ГраницаЭлементаУправления.Низ);
	НоваяКнопка.УстановитьПривязку(ГраницаЭлементаУправления.Лево,НоваяКнопка,ГраницаЭлементаУправления.Право);
	НоваяКнопка.УстановитьПривязку(ГраницаЭлементаУправления.Право,КоманднаяПанель1,ГраницаЭлементаУправления.Право);
	НоваяКнопка.Картинка = БиблиотекаКартинок.ПочтовоеПисьмоИсходящее;
	НоваяКнопка.Заголовок = "Отправить по эл. почте";
	ТекущееДействиеПриЗакрытии = РасчетныйЛистокФорма.ПолучитьДействие("ПриЗакрытии");
	НоваяКнопка.УстановитьДействие("Нажатие", Новый Действие("ДействияФормыЗаголовок"));
	//НоваяКнопка.УстановитьДействие("Нажатие", Новый Действие("ДействияФормыЗаголовок"));
	Попытка
		Рез=РасчетныйЛистокФорма.Открыть();
	Исключение
		Инфо = ИнформацияОбОшибке();
		Сообщить("Описание='" + Инфо.Описание + "'");
		Сообщить("ИмяМодуля='" + Инфо.ИмяМодуля + "'");
		Сообщить("НомерСтроки=" + Инфо.НомерСтроки);
		Сообщить("ИсходнаяСтрока='" + Инфо.ИсходнаяСтрока + "'");
		Предупреждение(ОписаниеОшибки());
	КонецПопытки;
КонецПроцедуры

Процедура ПередОткрытием(Отказ, СтандартнаяОбработка)
	КнопкаВыполнитьНажатие("");
	Отказ = Истина;
КонецПроцедуры
