////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

// Процедура - обработчик события "ПередОткрытием" формы.
//
Процедура ПередОткрытием(Отказ, СтандартнаяОбработка) Экспорт

	// вместо формы документа открываем форму связанного с ним отчета
	Отказ = Истина;

	Если Не(ЭтоНовый()) ИЛИ (мСкопированаФорма <> Неопределено) Тогда
		
		ПравоДоступаКОтчету = РегламентированнаяОтчетность.ПравоДоступаКРегламентированномуОтчету(ИсточникОтчета);
		Если ПравоДоступаКОтчету = Ложь Тогда
			Предупреждение(НСтр("ru='Недостаточно прав!';uk='Недостатньо прав!'"));
			Возврат;
		ИначеЕсли ПравоДоступаКОтчету = Неопределено Тогда
			Предупреждение(НСтр("ru='Не удалось открыть сохраненные данные! Отчет не найден!';uk='Не вдалося відкрити збережені дані! Звіт не знайдений!'"));
			Возврат;
		КонецЕсли;
		
		ОбъектОтчет =  РегламентированнаяОтчетность.РеглОтчеты(ИсточникОтчета);
		Если ОбъектОтчет = Неопределено Тогда
			Сообщить(НСтр("ru='Не удалось открыть сохраненные данные! Отчет не найден!';uk='Не вдалося відкрити збережені дані! Звіт не знайдений!'"), СтатусСообщения.Важное);
			Возврат;
		КонецЕсли;
		ВыбФормаОтчета = ОбъектОтчет.ПолучитьФорму( ,ЭтаФорма);
		ВыбФормаОтчета.РежимВыбора = Ложь;
		ВыбФормаОтчета.ЗакрыватьПриЗакрытииВладельца = Ложь;
		ВыбФормаОтчета.Открыть();
	ИначеЕсли ЭтоНовый() Тогда
		Справочники.РегламентированныеОтчеты.ПолучитьФормуСписка().Открыть();
	КонецЕсли;

КонецПроцедуры // ПередОткрытием()
