////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

Процедура ПриОткрытии()
	
	РежимНабораПерсонала = Константы.РежимНабораПерсонала.Получить();
	ЭлементыФормы.СправочникСписок.Колонки.Организация.Видимость = РежимНабораПерсонала = Перечисления.ВидыОрганизационнойСтруктурыПредприятия.ПоСтруктуреЮридическихЛиц;
	ЭлементыФормы.СправочникСписок.Колонки.Организация.ИзменятьНастройку = ЭлементыФормы.СправочникСписок.Колонки.Организация.Видимость;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ
