
Процедура ДокументСписокОбработкаЗаписиНовогоОбъекта(Элемент, Объект, СтандартнаяОбработка)
	Если Отбор.Найти("СпособВыплаты") = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Отбор.Номер.Использование И Отбор.СпособВыплаты.Использование И Отбор.Организация.Использование Тогда
		//Нужно обновить список доступных
		Если Отбор.СпособВыплаты.Значение = Перечисления.СпособыВыплатыЗарплаты.ЧерезБанк Тогда
			
			Запрос=Новый Запрос;
			Запрос.УстановитьПараметр("Организация",   Отбор.Организация.Значение);
			Запрос.УстановитьПараметр("СпособВыплаты", Перечисления.СпособыВыплатыЗарплаты.ЧерезБанк);
		
			Запрос.Текст="
			|ВЫБРАТЬ
			|	ЗарплатаКВыплатеОрганизаций.Номер КАК НомерВедомости
			|ИЗ
			|	Документ.ЗарплатаКВыплатеОрганизаций КАК ЗарплатаКВыплатеОрганизаций
			|
			|ГДЕ
			|	ЗарплатаКВыплатеОрганизаций.Организация = &Организация И
			|	ЗарплатаКВыплатеОрганизаций.СпособВыплаты = &СпособВыплаты";
			СписокОтбора = Новый СписокЗначений;
			
			СписокОтбора.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("НомерВедомости"));
			
			Отбор.Номер.ВидСравнения  = ВидСравнения.ВСписке;
			Отбор.Номер.Значение      = СписокОтбора;
		ИначеЕсли Отбор.СпособВыплаты.Значение = Перечисления.СпособыВыплатыЗарплаты.ЧерезКассу Тогда
			СписокОтбора = Новый СписокЗначений;

			Запрос       = Новый Запрос;
			Запрос.УстановитьПараметр("Организация",   Отбор.Организация.Значение);
			Запрос.УстановитьПараметр("СпособВыплаты", Перечисления.СпособыВыплатыЗарплаты.ЧерезКассу);
			Запрос.УстановитьПараметр("НеВыплачено",   Перечисления.ВыплаченностьЗарплаты.НеВыплачено);
			Запрос.Текст = "
			|ВЫБРАТЬ
			|	ЗарплатаКВыплатеОрганизаций.Номер КАК НомерВедомости
			|ИЗ
			|	Документ.ЗарплатаКВыплатеОрганизаций КАК ЗарплатаКВыплатеОрганизаций
			|
			|ГДЕ
			|	ЗарплатаКВыплатеОрганизаций.Организация = &Организация И
			|	ЗарплатаКВыплатеОрганизаций.СпособВыплаты = &СпособВыплаты И
			|	(НЕ(ЗарплатаКВыплатеОрганизаций.Ссылка В (
			|			ВЫБРАТЬ РАЗЛИЧНЫЕ 	
			|				ЗарплатаКВыплатеОрганизацийЗарплата.Ссылка 
			|			ИЗ Документ.ЗарплатаКВыплатеОрганизаций.Зарплата ЗарплатаКВыплатеОрганизацийЗарплата 
			|				ГДЕ 	ЗарплатаКВыплатеОрганизацийЗарплата.ВыплаченностьЗарплаты = &НеВыплачено )))";
			СписокОтбора.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("НомерВедомости"));	
			
			Отбор.Номер.ВидСравнения  = ВидСравнения.ВСписке;
			Отбор.Номер.Значение      = СписокОтбора;
		КонецЕсли;
	КонецЕсли;	

	
КонецПроцедуры
