////////////////////////////////////////////////////////////////////////////////
// ВСПОМОГАТЕЛЬНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Устанавливает видимость панели быстрого отбора
Процедура УстановитьВидимостьПанелиБыстрогоОтбора()
	
	Если НЕ ЭлементыФормы.ПанельОтбор.Свертка = РежимСверткиЭлементаУправления.Верх Тогда
		
		ЭлементыФормы.ПанельОтбор.Свертка = РежимСверткиЭлементаУправления.Верх;
		ЭлементыФормы.ДействияФормы.Кнопки.Отбор.Пометка = Ложь;
		ЭлементыФормы.ДействияФормы.Кнопки.Подменю.Кнопки.Отбор.Пометка = Ложь;
		
	Иначе
		
		ЭлементыФормы.ПанельОтбор.Свертка = РежимСверткиЭлементаУправления.Нет;
		ЭлементыФормы.ДействияФормы.Кнопки.Отбор.Пометка = Истина;
		ЭлементыФормы.ДействияФормы.Кнопки.Подменю.Кнопки.Отбор.Пометка = Истина;
		
	КонецЕсли;

КонецПроцедуры

// Процедура формирует заголовок окна
//
Процедура ОбновитьЗаголовокОкна()

	Если ЭлементыФормы.ФлажокНастройкиОрганизация.Значение Тогда
		
		Если ТипЗнч(ЭлементыФормы.ПолеНастройкиОрганизация.Значение) = Тип("СправочникСсылка.Организации") Тогда
			
			Если ЭлементыФормы.ПолеНастройкиОрганизация.Значение = Справочники.Организации.ПустаяСсылка() Тогда
				Заголовок = "Унифицированная форма П-50: <Не задано значение>"
			Иначе
				Заголовок = "Унифицированная форма П-50: " + ЭлементыФормы.ПолеНастройкиОрганизация.Значение
			КонецЕсли; 
			
		Иначе
			
			Если ЭлементыФормы.ПолеНастройкиОрганизация.Значение.Количество() = 0 Тогда
				Заголовок = "Унифицированная форма П-50 по списку организаций: <Не задано значение>"
			Иначе
				Заголовок = "Унифицированная форма П-50 по списку организаций: " + ЭлементыФормы.ПолеНастройкиОрганизация.Значение
			КонецЕсли; 
			
		КонецЕсли;
		
	Иначе
		Заголовок = "Унифицированная форма П-50"
	КонецЕсли; 	
	
КонецПроцедуры // ОбновитьЗаголовокОкна()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

// Процедура - обработчик события "ПередОткрытием" формы.
//
Процедура ПередОткрытием(Отказ, СтандартнаяОбработка)
	
	Период = НачалоМесяца(ТекущаяДата());
	
	ЭлементыФормы.ПолеВидаСравненияОрганизация.СписокВыбора = УправлениеОтчетами.ПолучитьСписокВидовСравненияПоТипу(Новый ОписаниеТипов("СправочникСсылка.Организации"));
	ВидСравненияОрганизации     = ВидСравнения.Равно;
	Организация = ОбщегоНазначения.ПустоеЗначениеТипа("СправочникСсылка.Организации");
	
	ЭлементыФормы.ПолеВидаСравненияПодразделение.СписокВыбора = УправлениеОтчетами.ПолучитьСписокВидовСравненияПоТипу(Новый ОписаниеТипов("СправочникСсылка.ПодразделенияОрганизаций"));
	ВидСравненияПодразделения     = ВидСравнения.Равно;
	Подразделение = ОбщегоНазначения.ПустоеЗначениеТипа("СправочникСсылка.ПодразделенияОрганизаций");
	
	Работник = ОбщегоНазначения.ПустоеЗначениеТипа("СправочникСсылка.ФизическиеЛица");
	ЭлементыФормы.ПолеВидаСравненияРаботник.СписокВыбора = УправлениеОтчетами.ПолучитьСписокВидовСравненияПоТипу(Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица"));
	ВидСравненияРаботника     = ВидСравнения.Равно;
	
	УстановитьВидимостьПанелиБыстрогоОтбора(); 
	
КонецПроцедуры

// Процедура - обработчик события "ПриОткрытии" формы.
//
Процедура ПриОткрытии()

	ОбновитьЗаголовокОкна();
	ФлажокНастройкиРаботникПриИзменении(ЭлементыФормы.ФлажокНастройкиРаботник)	
	
КонецПроцедуры

// Процедура - обработчик события "ПередСохранениемЗначений" формы.
//
Процедура ПередСохранениемЗначений(Отказ)
	
	СохраненныеНастройки = Новый Структура;
	СохраненныеНастройки.Вставить("ФлажокНастройкиОрганизация",		ОтборОрганизации);
	СохраненныеНастройки.Вставить("ПолеВидаСравненияОрганизация",	ВидСравненияОрганизации);
	СохраненныеНастройки.Вставить("ПолеНастройкиОрганизация",		Организация);
	СохраненныеНастройки.Вставить("ФлажокНастройкиПодразделение",	ОтборПодразделения);
	СохраненныеНастройки.Вставить("ПолеВидаСравненияПодразделение",	ВидСравненияПодразделения);
	СохраненныеНастройки.Вставить("ПолеНастройкиПодразделение",		Подразделение);
	СохраненныеНастройки.Вставить("ФлажокНастройкиРаботник",		ОтборРаботника);
	СохраненныеНастройки.Вставить("ПолеВидаСравненияРаботник",		ВидСравненияРаботника);
	СохраненныеНастройки.Вставить("ПолеНастройкиРаботник",			Работник);
	
КонецПроцедуры

// Процедура - обработчик события "ПослеВосстановленияЗначений" формы.
//
Процедура ПослеВосстановленияЗначений()
	
	Если ТипЗнч(СохраненныеНастройки) = Тип("Структура") Тогда

		ОтборОрганизации		  = СохраненныеНастройки.ФлажокНастройкиОрганизация;
		ВидСравненияОрганизации	  = СохраненныеНастройки.ПолеВидаСравненияОрганизация;
		Организация				  = СохраненныеНастройки.ПолеНастройкиОрганизация;
		ОтборПодразделения  	  = СохраненныеНастройки.ФлажокНастройкиПодразделение;
		ВидСравненияПодразделения = СохраненныеНастройки.ПолеВидаСравненияПодразделение;
		Подразделение			  = СохраненныеНастройки.ПолеНастройкиПодразделение;
		ОтборРаботника			  = СохраненныеНастройки.ФлажокНастройкиРаботник;
		ВидСравненияРаботника	  = СохраненныеНастройки.ПолеВидаСравненияРаботник;
		Работник				  = СохраненныеНастройки.ПолеНастройкиРаботник;
		
		Если ТипЗнч(Работник) = Тип("СписокЗначений") Тогда
			ЭлементыФормы.ПолеНастройкиРаботник.ОграничениеТипа	= Новый ОписаниеТипов("СписокЗначений");
		Иначе
			ЭлементыФормы.ПолеНастройкиРаботник.ОграничениеТипа	= Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица");
		КонецЕсли;
		
		Если ТипЗнч(Подразделение) = Тип("СписокЗначений") Тогда
			ЭлементыФормы.ПолеНастройкиПодразделение.ОграничениеТипа	= Новый ОписаниеТипов("СписокЗначений");
		Иначе
			ЭлементыФормы.ПолеНастройкиПодразделение.ОграничениеТипа	= Новый ОписаниеТипов("СправочникСсылка.ПодразделенияОрганизаций");
		КонецЕсли;
		                                                                                        
		Если ТипЗнч(Организация) = Тип("СписокЗначений") Тогда
			ЭлементыФормы.ПолеНастройкиОрганизация.ОграничениеТипа = Новый ОписаниеТипов("СписокЗначений");
		Иначе
			ЭлементыФормы.ПолеНастройкиОрганизация.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.Организации");
		КонецЕсли;
		
		ОбновитьЗаголовокОкна();
		ФлажокНастройкиРаботникПриИзменении(ЭлементыФормы.ФлажокНастройкиРаботник)	
		
	КонецЕсли; 
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ КОМАНДНОЙ ПАНЕЛИ ФОРМЫ

// Процедура - обработчик нажатия кнопки "Сформировать"
Процедура ДействияФормыВыполнить(Кнопка)
	
    ПередСохранениемЗначений(Истина);	
	
	СформироватьОтчет(ЭлементыФормы.ДокументРезультат);
	
КонецПроцедуры

// Процедура - обработчик нажатия кнопки "Отбор"
Процедура ДействияФормыОтбор(Кнопка)
	
	УстановитьВидимостьПанелиБыстрогоОтбора()
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

Процедура ПлюсПериодНажатие(Элемент)
	Период = КонецМесяца(Период) + 1;
КонецПроцедуры

Процедура МинусПериодНажатие(Элемент)
	Период = НачалоМесяца(Период - 1);
КонецПроцедуры

// Процедура - обработчик изменения флажка отбора по организации.
//
Процедура ФлажокНастройкиОрганизацияПриИзменении(Элемент)
	ОбновитьЗаголовокОкна();
КонецПроцедуры

// Процедура - обработчик изменения данных в поле выбора вида сравнения
//
Процедура ПолеВидаСравненияРаботникПриИзменении(Элемент)
	
	Если ТипЗнч(Работник) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
		ЗаписываемоеЗначение = Работник;                                                               
	Иначе
		Если Работник.Количество() = 0 Тогда    
			ЗаписываемоеЗначение = ОбщегоНазначения.ПустоеЗначениеТипа("СправочникСсылка.ФизическиеЛица")
		Иначе
			ЗаписываемоеЗначение = Работник[0].Значение;
		КонецЕсли;
	КонецЕсли;
	
	Если Элемент.Значение = ВидСравнения.ВСписке           ИЛИ Элемент.Значение = ВидСравнения.НеВСписке
	 ИЛИ Элемент.Значение = ВидСравнения.ВСпискеПоИерархии ИЛИ Элемент.Значение = ВидСравнения.НеВСпискеПоИерархии Тогда
		
		ЭлементыФормы.ПолеНастройкиРаботник.ОграничениеТипа	  = Новый ОписаниеТипов("СписокЗначений");
        Работник = Новый СписокЗначений;
		Если ЗначениеЗаполнено(ЗаписываемоеЗначение) Тогда
			Работник.Добавить(ЗаписываемоеЗначение);
		КонецЕсли;
		
	Иначе              
		
		ЭлементыФормы.ПолеНастройкиРаботник.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица");
		Работник	 = ЗаписываемоеЗначение;
		
	КонецЕсли; 
	
КонецПроцедуры

// Процедура - обработчик изменения данных в поле выбора вида сравнения
//
Процедура ПолеВидаСравненияПодразделениеПриИзменении(Элемент)
	
	Если ТипЗнч(Подразделение) = Тип("СправочникСсылка.ПодразделенияОрганизаций") Тогда
		ЗаписываемоеЗначение = Подразделение;                                                               
	Иначе
		Если Подразделение.Количество() = 0 Тогда    
			ЗаписываемоеЗначение = ОбщегоНазначения.ПустоеЗначениеТипа("СправочникСсылка.ПодразделенияОрганизаций")
		Иначе
			ЗаписываемоеЗначение = Подразделение[0].Значение;
		КонецЕсли;
	КонецЕсли;
	
	Если Элемент.Значение = ВидСравнения.ВСписке           ИЛИ Элемент.Значение = ВидСравнения.НеВСписке
	 ИЛИ Элемент.Значение = ВидСравнения.ВСпискеПоИерархии ИЛИ Элемент.Значение = ВидСравнения.НеВСпискеПоИерархии Тогда
		
		ЭлементыФормы.ПолеНастройкиПодразделение.ОграничениеТипа	  = Новый ОписаниеТипов("СписокЗначений");
        Подразделение = Новый СписокЗначений;
		Если ЗначениеЗаполнено(ЗаписываемоеЗначение) Тогда
			Подразделение.Добавить(ЗаписываемоеЗначение);
		КонецЕсли;
		
	Иначе              
		
		ЭлементыФормы.ПолеНастройкиПодразделение.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.ПодразделенияОрганизаций");
		Подразделение	 = ЗаписываемоеЗначение;
		
	КонецЕсли; 
	
КонецПроцедуры

// Процедура - обработчик изменения данных в поле выбора вида сравнения
//
Процедура ПолеВидаСравненияОрганизацияПриИзменении(Элемент)
	
	Если ТипЗнч(Организация) = Тип("СправочникСсылка.Организации") Тогда
		ЗаписываемоеЗначение = Организация;                                                               
	Иначе
		Если Организация.Количество() = 0 Тогда    
			ЗаписываемоеЗначение = ОбщегоНазначения.ПустоеЗначениеТипа("СправочникСсылка.Организации")
		Иначе
			ЗаписываемоеЗначение = Организация[0].Значение;
		КонецЕсли;
	КонецЕсли;
	
	Если Элемент.Значение = ВидСравнения.ВСписке ИЛИ Элемент.Значение = ВидСравнения.НеВСписке Тогда
		
		ЭлементыФормы.ПолеНастройкиОрганизация.ОграничениеТипа	  = Новый ОписаниеТипов("СписокЗначений");
        Организация = Новый СписокЗначений;
		Если ЗначениеЗаполнено(ЗаписываемоеЗначение) Тогда
			Организация.Добавить(ЗаписываемоеЗначение);
		КонецЕсли;
		
	Иначе              
		
		ЭлементыФормы.ПолеНастройкиОрганизация.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.Организации");
		Организация = ЗаписываемоеЗначение;
		
	КонецЕсли; 
	
	ОбновитьЗаголовокОкна();
	
КонецПроцедуры

// Процедура - обработчик изменения данных в поле значения отбора
//
Процедура ПолеНастройкиОрганизацияПриИзменении(Элемент)
	
	Значение = Элемент.Значение;
	
    Если ТипЗнч(Значение) = Тип("СписокЗначений") Тогда
		
		ЭлементыФормы.ФлажокНастройкиОрганизация.Значение = (Значение.Количество() <> 0)
		
	Иначе
		
		ЭлементыФормы.ФлажокНастройкиОрганизация.Значение = (ЗначениеЗаполнено(Значение))
		
	КонецЕсли; 
	
	ОбновитьЗаголовокОкна();
	
КонецПроцедуры

// Процедура - обработчик изменения данных в поле значения отбора
//
Процедура ПолеНастройкиПодразделениеПриИзменении(Элемент)
	
	Значение = Элемент.Значение;
	
    Если ТипЗнч(Значение) = Тип("СписокЗначений") Тогда
		
		ЭлементыФормы.ФлажокНастройкиПодразделение.Значение = (Значение.Количество() <> 0)
		
	Иначе
		
		ЭлементыФормы.ФлажокНастройкиПодразделение.Значение = (ЗначениеЗаполнено(Значение))
		
	КонецЕсли; 
	
КонецПроцедуры

// Процедура - обработчик изменения данных в поле значения отбора
//
Процедура ПолеНастройкиРаботникПриИзменении(Элемент)
	
	Значение = Элемент.Значение;
	
    Если ТипЗнч(Значение) = Тип("СписокЗначений") Тогда
		
		ЭлементыФормы.ФлажокНастройкиРаботник.Значение = (Значение.Количество() <> 0)
		
	Иначе
		
		ЭлементыФормы.ФлажокНастройкиРаботник.Значение = (ЗначениеЗаполнено(Значение))
		
	КонецЕсли;
	
   ФлажокНастройкиРаботникПриИзменении(ЭлементыФормы.ФлажокНастройкиРаботник)	
   
КонецПроцедуры

// Процедура - обработчик изменения данных в поле значения отбора
//
Процедура ФлажокНастройкиРаботникПриИзменении(Элемент)
	
	ОтборПодразделения = Мин(ОтборПодразделения, НЕ Элемент.Значение);
	ЭлементыФормы.ФлажокНастройкиПодразделение.Доступность   = НЕ Элемент.Значение;
	ЭлементыФормы.ПолеНастройкиПодразделение.Доступность     = НЕ Элемент.Значение;
	ЭлементыФормы.ПолеВидаСравненияПодразделение.Доступность = НЕ Элемент.Значение;
	
КонецПроцедуры

