
Процедура ВыполнятьВТранзакцииПриИзменении(Элемент)
	
	ЕСли ВыполнятьВТранзакции Тогда
		Предупреждение(НСтр("ru='Выполнение действий над объектами в транзакции в некоторых"
"случаях может существенно замедлить работу. В обычных "
"ситуациях не рекомендуется задействовать данный режим!!!';uk=""Виконання дій над об'єктами в транзакції в деяких"
"випадках може істотно сповільнити роботу. У звичайних "
"ситуаціях не рекомендується задіяти даний режим!!!"""));
	КонецЕСли;
	
КонецПроцедуры

Процедура ФлагИзменениРеквизитовПриИзменении(Элемент)
	
	Если ФлагИзмененияРеквизитов Тогда
		Предупреждение(НСтр("ru='Изменение реквизитов объектов выполняется"
"без контроля правильности их значений. Также"
"следует учитывать, что действия обработки"
"являются необратимыми!!!';uk=""Зміна реквізитів об'єктів виконується"
"без контролю правильності їхніх значень. Також"
"варто враховувати, що дії обробки"
"є необоротними!!!"""));
	КонецЕсли;
	
	ВладелецФормы.ЗаполнитьСписокДействий();
КонецПроцедуры

Процедура ПоказыватьВсеКолонкиПриИзменении(Элемент)
	ВладелецФормы.УстановитьВидимостьКолонок();
КонецПроцедуры


