
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

Процедура ПриОткрытии()
	Если СписокСотрудников.Количество() > 0 Тогда
		ЭлементыФормы.ТабличноеПолеСпискаСотрудников.ТекущаяСтрока = СписокСотрудников[0];
	КонецЕсли;
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ДЕЙСТВИЯ КОМАНДНЫХ ПАНЕЛЕЙ ФОРМЫ

Процедура КоманднаяПанельФормыВыбрать(Кнопка)
	
	ВыбранныеСотрудники = Новый Массив;
	Для Каждого ЭлементСпискаЗначений Из СписокСотрудников Цикл		
		Если ЭлементСпискаЗначений.Пометка Тогда
			ВыбранныеСотрудники.Добавить(ЭлементСпискаЗначений.Значение)
		КонецЕсли; 
	КонецЦикла;

	ОповеститьОВыборе(Новый Структура("Команда,ВыбранныеСотрудники","ЗаполнитьДокументИсправление",ВыбранныеСотрудники));
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ДЕЙСТВИЯ КОМАНДНЫХ ПАНЕЛЕЙ ФОРМЫ

// Процедура устанавливает пометку у всех строк таблицы.
//
Процедура КоманднаяПанельСпискаСотрудниковУстановитьФлаги(Кнопка)
	
	СписокСотрудников.ЗаполнитьПометки(Истина)
	
КонецПроцедуры

// Процедура снимает пометку у всех строк таблицы.
//
Процедура КоманднаяПанельСпискаСотрудниковСнятьфлаги(Кнопка)
	
	СписокСотрудников.ЗаполнитьПометки(Ложь)
	
КонецПроцедуры

// Инвертирует флаги в табличной части 
//
Процедура КоманднаяПанельСпискаСотрудниковИнвертировать(Кнопка)
	
	Для Каждого ЭлементСпискаЗначений Из СписокСотрудников Цикл		
		ЭлементСпискаЗначений.Пометка = Не ЭлементСпискаЗначений.Пометка;
	КонецЦикла;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЧНОГО ПОЛЯ 

Процедура ТабличноеПолеСпискаСотрудниковВыбор(Элемент, ВыбраннаяСтрока, Колонка, СтандартнаяОбработка)
	
	ВыбраннаяСтрока.Пометка = Не ВыбраннаяСтрока.Пометка;
	СтандартнаяОбработка = Ложь
	
КонецПроцедуры

