
Процедура ДокументСписокОбработкаЗаписиНовогоОбъекта(Элемент, Объект, СтандартнаяОбработка)
	
	Если Отбор.Номер.Использование И Отбор.СпособВыплаты.Использование И Отбор.Организация.Использование Тогда
		//Нужно обновить список доступных
		Если Отбор.СпособВыплаты.Значение = Перечисления.СпособыВыплатыЗарплаты.ЧерезБанк Тогда
			
			Запрос=Новый Запрос;
			Запрос.УстановитьПараметр("Организация",   Отбор.Организация.Значение);
			Запрос.УстановитьПараметр("СпособВыплаты", Перечисления.СпособыВыплатыЗарплаты.ЧерезБанк);
		
			Запрос.Текст="
			|ВЫБРАТЬ
			|	ЗарплатаКВыплатеОрганизаций.Номер КАК НомерВедомости
			|ИЗ
			|	Документ.ЗарплатаКВыплатеОрганизаций КАК ЗарплатаКВыплатеОрганизаций
			|
			|ГДЕ
			|	ЗарплатаКВыплатеОрганизаций.Организация = &Организация И
			|	ЗарплатаКВыплатеОрганизаций.СпособВыплаты = &СпособВыплаты";
			СписокОтбора = Новый СписокЗначений;
			
			СписокОтбора.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("НомерВедомости"));
			
			Отбор.Номер.ВидСравнения  = ВидСравнения.ВСписке;
			Отбор.Номер.Значение      = СписокОтбора;
		ИначеЕсли Отбор.СпособВыплаты.Значение = Перечисления.СпособыВыплатыЗарплаты.ЧерезКассу Тогда
			СписокОтбора = Новый СписокЗначений;

			Запрос       = Новый Запрос;
			Запрос.УстановитьПараметр("Организация",   Отбор.Организация.Значение);
			Запрос.УстановитьПараметр("СпособВыплаты", Перечисления.СпособыВыплатыЗарплаты.ЧерезКассу);
			Запрос.УстановитьПараметр("НеВыплачено",   Перечисления.ВыплаченностьЗарплаты.НеВыплачено);
			Запрос.Текст = "
			|ВЫБРАТЬ
			|	ЗарплатаКВыплатеОрганизаций.Номер КАК НомерВедомости
			|ИЗ
			|	Документ.ЗарплатаКВыплатеОрганизаций КАК ЗарплатаКВыплатеОрганизаций
			|
			|ГДЕ
			|	ЗарплатаКВыплатеОрганизаций.Организация = &Организация И
			|	ЗарплатаКВыплатеОрганизаций.СпособВыплаты = &СпособВыплаты И
			|	(НЕ(ЗарплатаКВыплатеОрганизаций.Ссылка В (
			|			ВЫБРАТЬ РАЗЛИЧНЫЕ 	
			|				ЗарплатаКВыплатеОрганизацийЗарплата.Ссылка 
			|			ИЗ Документ.ЗарплатаКВыплатеОрганизаций.Зарплата ЗарплатаКВыплатеОрганизацийЗарплата 
			|				ГДЕ 	ЗарплатаКВыплатеОрганизацийЗарплата.ВыплаченностьЗарплаты = &НеВыплачено )))";
			СписокОтбора.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("НомерВедомости"));	
			
			Отбор.Номер.ВидСравнения  = ВидСравнения.ВСписке;
			Отбор.Номер.Значение      = СписокОтбора;
		КонецЕсли;
	КонецЕсли;	

	
КонецПроцедуры

Процедура ПриОткрытии()
	
	Если СпособВыплаты = Перечисления.СпособыВыплатыЗарплаты.ПустаяСсылка() Тогда
		
		СпособВыплаты = Перечисления.СпособыВыплатыЗарплаты.ЧерезКассу;
	
		УстановитьВидимость();
	
	КонецЕсли;
	
КонецПроцедуры

Процедура УстановитьВидимость()
	
	Если СпособВыплаты = Перечисления.СпособыВыплатыЗарплаты.ЧерезКассу Тогда
		
		ЭлементыФормы.НадписьБанк.Видимость = Ложь;
		ЭлементыФормы.Банк.Видимость = Ложь;
		ЭлементыФормы.НадписьСотрудник.Видимость = Истина;
		ЭлементыФормы.Сотрудник.Видимость = Истина;
		
		Запрос=Новый Запрос;
		Запрос.Текст="
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЗарплатаКВыплатеОрганизаций.Ссылка.Номер КАК НомерВедомости
		|ИЗ Документ.ЗарплатаКВыплатеОрганизаций.РаботникиОрганизации КАК ЗарплатаКВыплатеОрганизаций
		|ГДЕ	ЗарплатаКВыплатеОрганизаций.Ссылка.Организация = &Организация 		
		|	И	ЗарплатаКВыплатеОрганизаций.СпособВыплаты = &СпособВыплаты
		|	И	ЗарплатаКВыплатеОрганизаций.Сотрудник = &Сотрудник
		|";
		
		Запрос.УстановитьПараметр("Организация",Отбор.Организация.Значение);
		Запрос.УстановитьПараметр("СпособВыплаты",СпособВыплаты);
		Запрос.УстановитьПараметр("Сотрудник",Сотрудник);
		СписокОтбора = Новый СписокЗначений;
		СписокОтбора.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("НомерВедомости"));
		
		Отбор.Номер.ВидСравнения	= ВидСравнения.ВСписке;
		Отбор.Номер.Значение		= СписокОтбора;
		Отбор.Номер.Использование	= Истина;
		
	Иначе
		
		ЭлементыФормы.НадписьБанк.Видимость = Истина;
		ЭлементыФормы.Банк.Видимость = Истина;
		ЭлементыФормы.НадписьСотрудник.Видимость = Ложь;
		ЭлементыФормы.Сотрудник.Видимость = Ложь;
		
		Запрос=Новый Запрос;
		Запрос.Текст="
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЗарплатаКВыплатеОрганизаций.Ссылка.Номер КАК НомерВедомости
		|ИЗ Документ.ЗарплатаКВыплатеОрганизаций.РаботникиОрганизации КАК ЗарплатаКВыплатеОрганизаций
		|ГДЕ	ЗарплатаКВыплатеОрганизаций.Ссылка.Организация = &Организация 		
		|	И	ЗарплатаКВыплатеОрганизаций.Банк = &Банк
		|";
		
		Запрос.УстановитьПараметр("Организация", Отбор.Организация.Значение);
		Запрос.УстановитьПараметр("Банк", Банк);
		СписокОтбора = Новый СписокЗначений;
		СписокОтбора.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("НомерВедомости"));
		
		Отбор.Номер.ВидСравнения	= ВидСравнения.ВСписке;
		Отбор.Номер.Значение		= СписокОтбора;
		Отбор.Номер.Использование	= Истина;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура СпособВыплатыПриИзменении(Элемент)
	
	УстановитьВидимость();
	
КонецПроцедуры

Процедура БанкПриИзменении(Элемент)
	
	УстановитьВидимость();
	
КонецПроцедуры

Процедура СотрудникПриИзменении(Элемент)
	
	УстановитьВидимость();
	
КонецПроцедуры
