////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ МОДУЛЯ

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

Процедура ПриОткрытии()
	СтруктураПараметров = НачальноеЗначениеВыбора;

	ИмяПоказателя = "";
	ТаблицаИнтервалов = Новый ТаблицаЗначений;
	Если ТипЗнч(СтруктураПараметров) = Тип("Структура") Тогда
		СтруктураПараметров.Свойство("ИмяПоказателя",ИмяПоказателя);
		СтруктураПараметров.Свойство("ТаблицаИнтервалов",ТаблицаИнтервалов);
	Иначе
		Предупреждение(НСтр("ru='Форма 'ФормаРедактированияИнтерваловПоказателя' должна вызываться только с параметрами!'"),30);
		Закрыть();
	КонецЕсли;
	ЭлементыФормы.ТабличноеПолеТаблицаИнтервалов.Значение = ТаблицаИнтервалов;

	//Установим тип значения для колонок границ интервалов
	ЭлементыФормы.ТабличноеПолеТаблицаИнтервалов.Колонки.ЗначениеС.ЭлементУправления.ОграничениеТипа = ТаблицаИнтервалов.Колонки.ЗначениеС.ТипЗначения;
	ЭлементыФормы.ТабличноеПолеТаблицаИнтервалов.Колонки.ЗначениеПо.ЭлементУправления.ОграничениеТипа = ТаблицаИнтервалов.Колонки.ЗначениеПо.ТипЗначения;
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ КОМАНДНЫХ ПАНЕЛЕЙ

Процедура КнопкаОКНажатие(Элемент)
	Если ЭлементыФормы.ТабличноеПолеТаблицаИнтервалов.Значение.Количество()=0 тогда
		Предупреждение(НСтр("ru='Таблица интервалов должна содержать минимум один интервал!';uk='Таблиця інтервалів повинна містити мінімум один інтервал!'"));
		Возврат;
	КонецЕсли;	 
	
	СтруктураВозврата = Новый Структура;
	ОповеститьОВыборе(СтруктураВозврата);
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ДИАЛОГА

////////////////////////////////////////////////////////////////////////////////
// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ

