
Процедура РегистрСведенийСписокПередУдалением(Элемент, Отказ)
	
	Если Элемент.ТекущиеДанные.ПоддержкаВнутреннегоСовместительства Тогда
		Отказ = Не ПроцедурыУправленияПерсоналом.МожноОтключатьВнутреннееСовместительство(Элемент.ТекущиеДанные.Организация);
	КонецЕсли;
	
КонецПроцедуры // РегистрСведенийСписокПередУдалением()

Процедура РегистрСведенийСписокПослеУдаления(Элемент)
	
    глУчетнаяПолитикаПоПерсоналуОрганизации = 	ЗаполнениеУчетнойПолитикиПоПерсоналуОрганизации();
	
КонецПроцедуры // РегистрСведенийСписокПослеУдаления()


