
Процедура ДействияФормыВыбратьИспользуемые(Кнопка)
	
	Справочники.НалоговыеНазначенияАктивовИЗатрат.ПолучитьФорму("ФормаНастройкиИспользуемых").ОткрытьМодально();
	
КонецПроцедуры

Процедура СправочникСписокПриВыводеСтроки(Элемент, ОформлениеСтроки, ДанныеСтроки)
	
	Если НЕ ДанныеСтроки.Используется Тогда
		ОформлениеСтроки.ЦветТекста = ЦветаСтиля.ТекстВторостепеннойНадписи;
	КонецЕсли;

КонецПроцедуры

Процедура ПриОткрытии()
	
	СправочникСписок.Колонки.Добавить("Используется", Ложь);
	
КонецПроцедуры


