Процедура ПередОткрытием(Отказ, СтандартнаяОбработка)
	
	Если РежимВыбора И НЕ ЗначениеЗаполнено(Отбор.Владелец.Значение) И НЕ ЗначениеЗаполнено(ПараметрОтборПоВладельцу) Тогда
		
		Если ТипЗнч(ВладелецФормы) <> Тип("ТабличноеПоле") Тогда
			Если ТипЗнч(ВладелецФормы.ВыборПоВладельцу)=Тип("СправочникСсылка.Контрагенты") Тогда
				
				ФормаВыбораВладельца = Справочники.Контрагенты.ПолучитьФормуВыбора();
				ФормаВыбораВладельца.Заголовок = НСтр("ru='Выберите контрагента, счет которого Вы хотите выбрать.';uk='Виберіть контрагента, рахунок якого Ви хочете вибрати.'");
				
				Контрагент = ФормаВыбораВладельца.ОткрытьМодально();
				
				Если Контрагент=Неопределено Тогда
					Отказ=Истина;
				КонецЕсли;
				Если Отбор.Владелец.ТипЗначения.СодержитТип(ТипЗнч(Контрагент)) Тогда
					Отбор.Владелец.Значение = Контрагент;
				КонецЕсли;
				Если ЗначениеЗаполнено(Отбор.Владелец.Значение) Тогда
					Отбор.Владелец.Использование = Истина;
				КонецЕсли;
				
			Иначе
				
				ФормаВыбораВладельца = Справочники.Организации.ПолучитьФормуВыбора();
				ФормаВыбораВладельца.Заголовок = НСтр("ru='Выберите организацию, счет которой Вы хотите выбрать.';uk='Виберіть організацію, рахунок якої Ви хочете вибрати.'");
				Организация=ФормаВыбораВладельца.ОткрытьМодально();
				
				Если Организация=Неопределено Тогда
					Отказ=Истина;
				КонецЕсли;
				
				Если Отбор.Владелец.ТипЗначения.СодержитТип(ТипЗнч(Организация)) Тогда
					Отбор.Владелец.Значение = Организация;
				КонецЕсли;
				Если ЗначениеЗаполнено(Отбор.Владелец.Значение) Тогда
					Отбор.Владелец.Использование = Истина;
				КонецЕсли;

			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура - обработчик события "ПриОткрытии" формы
//
Процедура ПриОткрытии()

 	Если НЕ ЗначениеЗаполнено(Отбор.Владелец.Значение) Тогда
 		Отбор.Владелец.Использование = Ложь;
 	КонецЕсли;

КонецПроцедуры
