Процедура ДействияФормыДействиеОК(Кнопка)
	
	СтрокаПериода = ТабличнаяЧастьНастройки.Найти("Период");
	ИндексСтрокиПериода = ТабличнаяЧастьНастройки.Индекс(СтрокаПериода); 
	Если ИндексСтрокиПериода <> 0 Тогда 
		ТабличнаяЧастьНастройки.Сдвинуть(СтрокаПериода,-ИндексСтрокиПериода);		
	КонецЕсли;
	Если СтрокаПериода.ИтогиВПодвале Тогда
		 СтрокаПериода.ИтогиВПодвале = Ложь
	КонецЕсли;	 
	СтрокаПризнакСоциальнойЛьготы = ТабличнаяЧастьНастройки.Найти("ПризнакСоциальнойЛьготы");
	Если СтрокаПризнакСоциальнойЛьготы.ИтогиВПодвале Тогда
		 СтрокаПризнакСоциальнойЛьготы.ИтогиВПодвале = Ложь
	КонецЕсли;	 
	 
	ДокументОбъект.НастройкиВыводаНаПечать.Загрузить(ТабличнаяЧастьНастройки);
	ЭтаФорма.Закрыть();
	
КонецПроцедуры


Процедура ТабличнаяЧастьНастройкиПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	
КонецПроцедуры

Процедура КоманднаяПанельКнопкаЗаполнитьПоУмолчанию(Кнопка)
	
	КодЯзыкаПечать = Локализация.ПолучитьЯзыкФормированияПечатныхФорм(УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "РежимФормированияПечатныхФорм"));
	ТабличнаяЧастьНастройки.Очистить();
	НоваяСтрока = ТабличнаяЧастьНастройки.Добавить();
	НоваяСтрока.Выводить = Истина;
	НоваяСтрока.ИтогиВПодвале = Ложь;
	НоваяСтрока.ИмяКолонки = "Период";
	НоваяСтрока.ИмяКолонкиДляПечати = НСтр("ru='Период';uk='Період'",КодЯзыкаПечать);
	НоваяСтрока = ТабличнаяЧастьНастройки.Добавить();
	НоваяСтрока.Выводить = Истина;
	НоваяСтрока.ИтогиВПодвале = Ложь;
	НоваяСтрока.ИмяКолонки = "ОблагаемоеЕСВ";
	НоваяСтрока.ИмяКолонкиДляПечати = НСтр("ru='База ЕСВ';uk='База ЄСВ'",КодЯзыкаПечать);
	НоваяСтрока = ТабличнаяЧастьНастройки.Добавить();
	НоваяСтрока.Выводить = Истина;
	НоваяСтрока.ИтогиВПодвале = Ложь;
	НоваяСтрока.ИмяКолонки = "ОблагаемоеЕСВПредел";
	НоваяСтрока.ИмяКолонкиДляПечати = НСтр("ru='База ЕСВ с учетом предела';uk='База ЄСВ з урахуванням межі'",КодЯзыкаПечать);
	НоваяСтрока = ТабличнаяЧастьНастройки.Добавить();
	НоваяСтрока.Выводить = Истина;
	НоваяСтрока.ИтогиВПодвале = Ложь;
	НоваяСтрока.ИмяКолонки = "РезультатВзносы";
	НоваяСтрока.ИмяКолонкиДляПечати = НСтр("ru='Удержано ЕСВ';uk='Утримано ЄСВ'",КодЯзыкаПечать);
	НоваяСтрока = ТабличнаяЧастьНастройки.Добавить();
	НоваяСтрока.Выводить = Истина;
	НоваяСтрока.ИтогиВПодвале = Ложь;
	НоваяСтрока.ИмяКолонки = "ДоходНДФЛ";
	НоваяСтрока.ИмяКолонкиДляПечати = НСтр("ru='Начисленный доход';uk='Нарахований дохід'",КодЯзыкаПечать);
	НоваяСтрока = ТабличнаяЧастьНастройки.Добавить();
	НоваяСтрока.Выводить = Истина;
	НоваяСтрока.ИтогиВПодвале = Ложь;
	НоваяСтрока.ИмяКолонки = "НДФЛ";
	НоваяСтрока.ИмяКолонкиДляПечати = НСтр("ru='Сумма НДФЛ';uk='Сума ПДФО'",КодЯзыкаПечать);
	//ВОЕННЫЙ СБОР
	НоваяСтрока = ТабличнаяЧастьНастройки.Добавить();
	НоваяСтрока.Выводить = Истина;
	НоваяСтрока.ИтогиВПодвале = Ложь;
	НоваяСтрока.ИмяКолонки = "ДоходВоенныйСбор";
	НоваяСтрока.ИмяКолонкиДляПечати = НСтр("ru='Доход для военного сбора)';uk='Дохід для військового збору'",КодЯзыкаПечать);
	НоваяСтрока = ТабличнаяЧастьНастройки.Добавить();
	НоваяСтрока.Выводить = Истина;
	НоваяСтрока.ИтогиВПодвале = Ложь;
	НоваяСтрока.ИмяКолонки = "ВоенныйСбор";
	НоваяСтрока.ИмяКолонкиДляПечати = НСтр("ru='Военный сбор)';uk='Військовий збір)'",КодЯзыкаПечать);
	НоваяСтрока = ТабличнаяЧастьНастройки.Добавить();
	НоваяСтрока.Выводить = Истина;
	НоваяСтрока.ИтогиВПодвале = Ложь;
	НоваяСтрока.ИмяКолонки = "ПризнакСоциальнойЛьготы";
	НоваяСтрока.ИмяКолонкиДляПечати = НСтр("ru='Признак социальной льготы';uk='Ознака соціальної пільги'",КодЯзыкаПечать);
	НоваяСтрока = ТабличнаяЧастьНастройки.Добавить();
	НоваяСтрока.Выводить = Истина;
	НоваяСтрока.ИтогиВПодвале = Ложь;
	НоваяСтрока.ИмяКолонки = "СуммаНалоговойЛьготы";
	НоваяСтрока.ИмяКолонкиДляПечати = НСтр("ru='Сумма налоговой социальной льготы';uk='Сума податкової соціальної пільги'",КодЯзыкаПечать);
	
	НоваяСтрока = ТабличнаяЧастьНастройки.Добавить();
	НоваяСтрока.Выводить = Истина;
	НоваяСтрока.ИтогиВПодвале = Ложь;
	НоваяСтрока.ИмяКолонки = "Выплачено";
	НоваяСтрока.ИмяКолонкиДляПечати = НСтр("ru='Выплачено';uk='Виплачено'",КодЯзыкаПечать);
	
	НоваяСтрока = ТабличнаяЧастьНастройки.Добавить();
	НоваяСтрока.Выводить = Истина;
	НоваяСтрока.ИтогиВПодвале = Ложь;
	НоваяСтрока.ИмяКолонки = "ДоходЗаВычетомНДФЛ";
	НоваяСтрока.ИмяКолонкиДляПечати = НСтр("ru='Доход за вычетом НДФЛ';uk='Дохід за вирахуванням ПДФО'",КодЯзыкаПечать);
	
КонецПроцедуры

Процедура ТабличнаяЧастьНастройкиПередНачаломДобавления(Элемент, Отказ, Копирование)
	
	Отказ = Истина
	
КонецПроцедуры




