// Процедура прописывает заголовок формы 
//
// Параметры:
//  Элемент - элемент формы, который отображает организацию
//  
Процедура ОрганизацияПриИзменении(Элемент)

	Заголовок = НСтр("ru='Взносы в фонды физических лиц организации ';uk='Внески у фонди фізичних осіб організації '") + Элемент.Значение.Наименование;
	Отбор.Организация.Значение = Элемент.Значение;
    Отбор.Организация.Использование = Не Элемент.Значение.Пустая();
	
КонецПроцедуры

// Процедура прописывает заголовок формы 
//
// Параметры:
//  Элемент - элемент формы, который отображает организацию
//  
Процедура ФизЛицоПриИзменении(Элемент)

	Отбор.Сотрудник.Значение = Элемент.Значение;
    Отбор.Сотрудник.Использование = Не Элемент.Значение.Пустая();
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

// Если форма открывается из списка документов, процедура заполняет организацию 
// прописывает заголовок формы и выставляет отбор регистру
//
Процедура ПриОткрытии()
	
	Если ЗначениеЗаполнено(ПараметрОтборПоРегистратору) Тогда
		
        МетаданныеДокумента = ПараметрОтборПоРегистратору.Метаданные();
		
		Если МетаданныеДокумента.Реквизиты.Найти("Организация") <> Неопределено Тогда
			
			Отбор.Организация.Значение = ПараметрОтборПоРегистратору.Организация;
			ЭлементыФормы.Организация.Значение = ПараметрОтборПоРегистратору.Организация;
			Заголовок = НСтр("ru='Взносы в фонды физических лиц организации ';uk='Внески у фонди фізичних осіб організації '") + Отбор.Организация.Значение.Наименование;
			ЭлементыФормы.Организация.ТолькоПросмотр = Истина;
			
		КонецЕсли;

		Отбор.Организация.Использование = Истина;
		
		
	Иначе
		
		Отбор.Организация.Значение = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"),"ОсновнаяОрганизация");
		Заголовок 				   = НСтр("ru='Взносы в фонды физических лиц организации ';uk='Внески у фонди фізичних осіб організації '") + Отбор.Организация.Значение;	
	    Отбор.Организация.Использование = Не Отбор.Организация.Значение.Пустая();
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриПовторномОткрытии(СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(ПараметрОтборПоРегистратору) Тогда
		
        МетаданныеДокумента = ПараметрОтборПоРегистратору.Метаданные();
		
		Если МетаданныеДокумента.Реквизиты.Найти("Организация") <> Неопределено Тогда
			
			Отбор.Организация.Значение = ПараметрОтборПоРегистратору.Организация;
			Заголовок = НСтр("ru='Удержания физических лиц организации ';uk='Утримання фізичних осіб організації '") + Отбор.Организация.Значение.Наименование;
			ЭлементыФормы.Организация.ТолькоПросмотр = Истина;
			
        	Возврат
			
		КонецЕсли;

		Отбор.Организация.Использование = Истина;

	Иначе
		
		Отбор.Организация.Значение = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"),"ОсновнаяОрганизация");
	    Отбор.Организация.Использование = Не Отбор.Организация.Значение.Пустая();
		
	КонецЕсли;
	
	Заголовок = НСтр("ru='Удержания физических лиц организации';uk='Утримання фізичних осіб організації'");
	ЭлементыФормы.Организация.ТолькоПросмотр = Ложь;
	
КонецПроцедуры


