
// Процедура - обработчик события ПередОткрытием формы.
//
Процедура ПередОткрытием(Отказ, СтандартнаяОбработка)
	
	ЖурналОтчетов.Отбор.ИсточникОтчета.Использование = Истина;
	ЖурналОтчетов.Отбор.ИсточникОтчета.ВидСравнения = ВидСравнения.Равно;
	ЖурналОтчетов.Отбор.ИсточникОтчета.Значение = ВладелецФормы.ЭлементыФормы.ДеревоОтчетов.ТекущиеДанные.ИсточникОтчета;
		
	Если ВладелецФормы.Организация.Количество()= 0 Тогда
		ЖурналОтчетов.Отбор.Организация.Использование = Ложь;
	Иначе
		ЖурналОтчетов.Отбор.Организация.Использование = Истина;
		ЖурналОтчетов.Отбор.Организация.ВидСравнения = ВидСравнения.ВСписке;
		ЖурналОтчетов.Отбор.Организация.Значение = ВладелецФормы.Организация;
	КонецЕсли;
		
	////Если НЕ ВладелецФормы.ОтборКодИФНС Тогда
	////	ЖурналОтчетов.Отбор.КодИМНС.Использование = Ложь;
	////Иначе
	////	ЖурналОтчетов.Отбор.КодИМНС.Использование = Истина;
	////	ЖурналОтчетов.Отбор.КодИМНС.ВидСравнения = ВидСравнения.Равно;
	////	ЖурналОтчетов.Отбор.КодИМНС.Значение = ВладелецФормы.КодИФНС;
	////КонецЕсли;
		
	Если НЕ ВладелецФормы.ОтборПериод Тогда
		ЖурналОтчетов.Отбор.ДатаНачала.Использование = Ложь;
		ЖурналОтчетов.Отбор.ДатаОкончания.Использование = Ложь;
	Иначе                            
		Если ВладелецФормы.Периодичность = "Произвольный" Тогда
			ЖурналОтчетов.Отбор.ДатаНачала.Использование = Истина;
			ЖурналОтчетов.Отбор.ДатаОкончания.Использование = Истина;
			ЖурналОтчетов.Отбор.ДатаНачала.ВидСравнения = ВидСравнения.БольшеИлиРавно;
			ЖурналОтчетов.Отбор.ДатаНачала.Значение = ВладелецФормы.ДатаНачалаПериодаОтчета;
			ЖурналОтчетов.Отбор.ДатаОкончания.ВидСравнения = ВидСравнения.МеньшеИлиРавно;
			ЖурналОтчетов.Отбор.ДатаОкончания.Значение = ВладелецФормы.ДатаКонцаПериодаОтчета;
		Иначе
			ЖурналОтчетов.Отбор.ДатаНачала.Использование = Ложь;
			ЖурналОтчетов.Отбор.ДатаОкончания.Использование = Истина;
			ЖурналОтчетов.Отбор.ДатаОкончания.ВидСравнения = ВидСравнения.ИнтервалВключаяГраницы;
			ЖурналОтчетов.Отбор.ДатаОкончания.ЗначениеС = НачалоДня(ВладелецФормы.ДатаКонцаПериодаОтчета);
			ЖурналОтчетов.Отбор.ДатаОкончания.ЗначениеПо = КонецДня(ВладелецФормы.ДатаКонцаПериодаОтчета);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Процедура - действие кнопки ОК командной панели ОсновныеДействияФормы.
//
Процедура ОсновныеДействияФормыОК(Кнопка)
	
	Если ЭлементыФормы.ЖурналОтчетов.ТекущиеДанные = Неопределено Тогда
		Предупреждение(НСтр("ru='Выберите отчет для открытия!';uk='Виберіть звіт для відкриття!'"));
		Возврат;
	КонецЕсли;
	Закрыть(ЭлементыФормы.ЖурналОтчетов.ТекущиеДанные.Ссылка);
	
КонецПроцедуры

// Процедура - обработчик события Выбор табличного поля ЖурналОтчетов.
//
Процедура ЖурналОтчетовВыбор(Элемент, ВыбраннаяСтрока, Колонка, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Закрыть(ВыбраннаяСтрока.Ссылка);
	
КонецПроцедуры

// Процедура - действие кнопки Новый командной панели ОсновныеДействияФормы.
//
Процедура ОсновныеДействияФормыНовый(Кнопка)
	
	Закрыть(Истина);
	
КонецПроцедуры

// Процедура - обработчик события ПриПолученииДанных табличного поля ЖурналОтчетов.
//
Процедура ЖурналОтчетовПриПолученииДанных(Элемент, ОформленияСтрок)
	
	Для Каждого ОформлениеСтроки Из ОформленияСтрок Цикл
		ОформлениеСтроки.Ячейки.Период.УстановитьТекст(ПредставлениеПериода(ОформлениеСтроки.ДанныеСтроки.ДатаНачала, КонецДня(ОформлениеСтроки.ДанныеСтроки.ДатаОкончания), "ФП=Истина"));
		//ОформлениеСтроки.Ячейки.Вид.УстановитьТекст(РегламентированнаяОтчетность.ПредставлениеВидаДокумента(ОформлениеСтроки.ДанныеСтроки.Вид));
	КонецЦикла;
	
КонецПроцедуры

ЖурналОтчетов.Колонки.Добавить("ДатаНачала");
ЖурналОтчетов.Колонки.Добавить("ДатаОкончания");
