////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

// Процедура - обработчик события "ПриОткрытии" формы
//
Процедура ПриОткрытии()
	
	// заполним организацию
	РаботаСДиалогами.ЗаполнениеПоОгранизацииДаннымиПоУмолчанию(ЭтаФорма, ПараметрОтборПоРегистратору, Истина, глЗначениеПеременной("глТекущийПользователь") ,НСтр("ru='Учет основного заработка работников организации в регламентированном учете по ';uk='Облік основного заробітку працівників організації в регламентованому обліку по '"));

	// Установим видимость реквизита "Приказ"
	//УстановитьВидимостьПриказа(ЭтаФорма,ЭлементыФормы.Организация.Значение,глУчетнаяПолитикаПоПерсоналуОрганизации);	

КонецПроцедуры

Процедура ОрганизацияПриИзменении(Элемент)
	
	Заголовок = НСтр("ru='Учет основного заработка работников организации в регламентированном учете по ';uk='Облік основного заробітку працівників організації в регламентованому обліку по '") + Элемент.Значение.Наименование;
    Отбор.Организация.Использование = Не Элемент.Значение.Пустая();
	
	// Установим видимость реквизита "Приказ"
	//УстановитьВидимостьПриказа(ЭтаФорма,Элемент.Значение,глУчетнаяПолитикаПоПерсоналуОрганизации);	
	
КонецПроцедуры
