////////////////////////////////////////////////////////////////////////////////
// ВСПОМОГАТЕЛЬНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Назначает доступность элементам управления при изменении данных
//
// Параметры
//  нет
//
Процедура НазначитьДоступность()
	ХарактерЗатрат = СтатьяЗатрат.ХарактерЗатрат;
	ЭлементыФормы.ОбъектСтроительства.Доступность = ХарактерЗатрат = Перечисления.ХарактерЗатрат.ВложенияВоВнеоборотныеАктивы;
КонецПроцедуры // НазначитьВидимость()

///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

Процедура ПриОткрытии()
	НазначитьДоступность();
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	Если ЗначениеЗаполнено(ОбъектСтроительства) И СтатьяЗатрат.ХарактерЗатрат <> Перечисления.ХарактерЗатрат.ВложенияВоВнеоборотныеАктивы Тогда
		Сообщить(НСтр("ru='Для данного способа отражения зарплаты в учете не нужно задавать объект строительства. Значение очищено.';uk=""Для даного способу відображення зарплати в обліку не потрібно задавати об'єкт будівництва. Значення очищено."""));
		ОбъектСтроительства = Справочники.ОбъектыСтроительства.ПустаяСсылка();
	
	КонецЕсли;
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

Процедура СтатьяЗатратПриИзменении(Элемент)
	НазначитьДоступность();
КонецПроцедуры



