
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ УПРАВЛЕНИЯ КОМАНДНОЙ ПАНЕЛИ ФОРМЫ

// Обработчик события элемента ОсновныеДействияФормы.ОК.
// .
Процедура ОсновныеДействияФормыОК(Кнопка)
	
	// Сначала удалим те, у которых сняли флажки
	УдаленныеНаборы = "";
	Для каждого СтрокаТаблицы Из ТЗРегистровНакопления Цикл
		ЭлементСписка = СписокРегистровНакопления.НайтиПоЗначению(СтрокаТаблицы.Имя);
		Если ЭлементСписка = Неопределено Тогда
			УдаленныеНаборы = УдаленныеНаборы + Символы.ПС + " - " + СтрокаТаблицы.Представление;
			Продолжить;
		КонецЕсли; 
		Если НЕ ЭлементСписка.Пометка Тогда
			УдаленныеНаборы = УдаленныеНаборы + Символы.ПС + " - " + СтрокаТаблицы.Представление;
			Продолжить;
		КонецЕсли; 
	КонецЦикла; 
	
	Если Не ПустаяСтрока(УдаленныеНаборы) Тогда
		
		ТекстВопроса = НСтр("ru='Наборы записей следующих регистров накопления будут удалены:';uk='Набори записів наступних регістрів накопичення будуть вилучені:'") + УдаленныеНаборы + Символы.ПС + "Продолжить?";
		
		ОтветНаВопрос = Вопрос(ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		
		Если ОтветНаВопрос <> КодВозвратаДиалога.Да Тогда
			Возврат;
		КонецЕсли; 
	
	КонецЕсли; 
	
	// Сначала удалим те, у которых сняли флажки
	УдаленныеНаборы = "";
	Для каждого СтрокаТаблицы Из ТЗРегистровСведений Цикл
		ЭлементСписка = СписокРегистровСведений.НайтиПоЗначению(СтрокаТаблицы.Имя);
		Если ЭлементСписка = Неопределено Тогда
			УдаленныеНаборы = УдаленныеНаборы + Символы.ПС + " - " + СтрокаТаблицы.Представление;
			Продолжить;
		КонецЕсли; 
		Если НЕ ЭлементСписка.Пометка Тогда
			УдаленныеНаборы = УдаленныеНаборы + Символы.ПС + " - " + СтрокаТаблицы.Представление;
			Продолжить;
		КонецЕсли; 
	КонецЦикла; 
	
	Если Не ПустаяСтрока(УдаленныеНаборы) Тогда
		
		ТекстВопроса = НСтр("ru='Наборы записей следующих регистров сведений будут удалены:';uk='Набори записів наступних регістрів відомостей будуть вилучені:'") + УдаленныеНаборы + Символы.ПС + "Продолжить?";
		
		ОтветНаВопрос = Вопрос(ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		
		Если ОтветНаВопрос <> КодВозвратаДиалога.Да Тогда
			Возврат;
		КонецЕсли; 
	
	КонецЕсли; 
	
	// Сначала удалим те, у которых сняли флажки
	УдаленныеНаборы = "";
	Для каждого СтрокаТаблицы Из ТЗРегистровРасчета Цикл
		ЭлементСписка = СписокРегистровРасчета.НайтиПоЗначению(СтрокаТаблицы.Имя);
		Если ЭлементСписка = Неопределено Тогда
			УдаленныеНаборы = УдаленныеНаборы + Символы.ПС + " - " + СтрокаТаблицы.Представление;
			Продолжить;
		КонецЕсли; 
		Если НЕ ЭлементСписка.Пометка Тогда
			УдаленныеНаборы = УдаленныеНаборы + Символы.ПС + " - " + СтрокаТаблицы.Представление;
			Продолжить;
		КонецЕсли; 
	КонецЦикла; 
	
	Если Не ПустаяСтрока(УдаленныеНаборы) Тогда
		
		ТекстВопроса = НСтр("ru='Наборы записей следующих регистров Расчета будут удалены:';uk='Набори записів наступних регістрів Розрахунку будуть вилучені:'") + УдаленныеНаборы + Символы.ПС + "Продолжить?";
		
		ОтветНаВопрос = Вопрос(ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		
		Если ОтветНаВопрос <> КодВозвратаДиалога.Да Тогда
			Возврат;
		КонецЕсли; 
	
	КонецЕсли; 
	
	// Сначала удалим те, у которых сняли флажки
	УдаленныеНаборы = "";
	Для каждого СтрокаТаблицы Из ТЗРегистровБухгалтерии Цикл
		ЭлементСписка = СписокРегистровБухгалтерии.НайтиПоЗначению(СтрокаТаблицы.Имя);
		Если ЭлементСписка = Неопределено Тогда
			УдаленныеНаборы = УдаленныеНаборы + Символы.ПС + " - " + СтрокаТаблицы.Представление;
			Продолжить;
		КонецЕсли; 
		Если НЕ ЭлементСписка.Пометка Тогда
			УдаленныеНаборы = УдаленныеНаборы + Символы.ПС + " - " + СтрокаТаблицы.Представление;
			Продолжить;
		КонецЕсли; 
	КонецЦикла; 
	
	Если Не ПустаяСтрока(УдаленныеНаборы) Тогда
		
		ТекстВопроса = НСтр("ru='Наборы записей следующих регистров бухглатерии будут удалены:';uk='Набори записів наступних регістрів бухглатерії будуть вилучені:'") + УдаленныеНаборы + Символы.ПС + "Продолжить?";
		
		ОтветНаВопрос = Вопрос(ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		
		Если ОтветНаВопрос <> КодВозвратаДиалога.Да Тогда
			Возврат;
		КонецЕсли; 
	
	КонецЕсли; 
	
	
	ЭтаФорма.Закрыть(Истина);
	
КонецПроцедуры

Процедура ПриОткрытии()
	Если ИмяТекущейСтраницы<>"" Тогда
		ЭлементыФормы.Панель.ТекущаяСтраница = ЭлементыФормы.Панель.Страницы[ИмяТекущейСтраницы];
	КонецЕсли;
	ЭлементыФормы.Панель.Страницы.Бухгалтери.Видимость = Ложь;
КонецПроцедуры





