Процедура Инициализировать(ДокументОбъект, Имя, Расшифровка) Экспорт
	Если ДокументОбъект.ОсновныеНачисления.Количество() = 0 Тогда Возврат; КонецЕсли;
	
	лДатаНачала = ДокументОбъект.ОсновныеНачисления[0].ДатаНачала;
	лДатаОкончания = ДокументОбъект.ОсновныеНачисления[0].ДатаОкончания;
	лБазовыйПериодНачало = ДокументОбъект.ОсновныеНачисления[0].БазовыйПериодНачало;
	лБазовыйПериодКонец = ДокументОбъект.ОсновныеНачисления[0].БазовыйПериодКонец;
	Для каждого лСтрока ИЗ ДокументОбъект.ОсновныеНачисления Цикл
		лСтрока.ДатаНачала = лДатаНачала;
		лСтрока.ДатаОкончания = лДатаОкончания;
		лСтрока.БазовыйПериодНачало = лБазовыйПериодНачало;
		лСтрока.БазовыйПериодКонец = лБазовыйПериодКонец;
	КонецЦикла;
КонецПроцедуры
