
// УстановитьПараметр
//
Процедура УстановитьПараметр(КомпоновщикНастроек, ИмяПараметра, ЗначениеПараметра)
	ПараметрДанныхТекущий = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных(ИмяПараметра));
	ПараметрДанныхТекущий.Значение = ЗначениеПараметра;
	ПараметрДанныхТекущий.Использование = Истина;
КонецПроцедуры

Процедура ПриОткрытии()
	Если НужныеВидыРасчета.Количество() = 0 Тогда
		лСтрока = НужныеВидыРасчета.Добавить(); лСтрока.ВидРасчета = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.НайтиПоНаименованию( "01. Оклад" );
		лСтрока = НужныеВидыРасчета.Добавить(); лСтрока.ВидРасчета = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.НайтиПоНаименованию( "11. Індексація за рахунок підприємства" );
		лСтрока = НужныеВидыРасчета.Добавить(); лСтрока.ВидРасчета = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.НайтиПоНаименованию( "11.1.Індексація зарплати (обов'язкова)" );
		лСтрока = НужныеВидыРасчета.Добавить(); лСтрока.ВидРасчета = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.НайтиПоНаименованию( "12. Премія щомісячна (торгова)" );
		лСтрока = НужныеВидыРасчета.Добавить(); лСтрока.ВидРасчета = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.НайтиПоНаименованию( "15. Премія у зарплату" );
		лСтрока = НужныеВидыРасчета.Добавить(); лСтрока.ВидРасчета = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.НайтиПоНаименованию( "20. Доплата до відпускних" );
		лСтрока = НужныеВидыРасчета.Добавить(); лСтрока.ВидРасчета = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.НайтиПоНаименованию( "23. Доплата до средньоденного (відрядження)" );
		лСтрока = НужныеВидыРасчета.Добавить(); лСтрока.ВидРасчета = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.НайтиПоНаименованию( "24. Оплата по средньому зарабітку (відрядження)" );
		лСтрока = НужныеВидыРасчета.Добавить(); лСтрока.ВидРасчета = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.НайтиПоНаименованию( "Додаткова відпустка на дітей" );
		лСтрока = НужныеВидыРасчета.Добавить(); лСтрока.ВидРасчета = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.НайтиПоНаименованию( "Додаткова відпустка учасникам бойових дій" );
		лСтрока = НужныеВидыРасчета.Добавить(); лСтрока.ВидРасчета = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.НайтиПоНаименованию( "Додаткова щорічна відпустка" );
		лСтрока = НужныеВидыРасчета.Добавить(); лСтрока.ВидРасчета = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.НайтиПоНаименованию( "Оплата відпустки" );
		лСтрока = НужныеВидыРасчета.Добавить(); лСтрока.ВидРасчета = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.НайтиПоНаименованию( "Оплата праздничных и выходных" );
		лСтрока = НужныеВидыРасчета.Добавить(); лСтрока.ВидРасчета = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.НайтиПоНаименованию( "Отпуск по беременности и родам" );
		лСтрока = НужныеВидыРасчета.Добавить(); лСтрока.ВидРасчета = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.НайтиПоНаименованию( "Чорнобильська відпустка" );
	КонецЕсли;
	лмасВидыРасчета = НужныеВидыРасчета.ВыгрузитьКолонку( "ВидРасчета" );
	лсзРез = Новый СписокЗначений;
	Для каждого лЗнач Из лмасВидыРасчета Цикл
		лсзРез.Добавить( лЗнач );
	КонецЦикла;
	УстановитьПараметр(КомпоновщикНастроек, "СписокВидовРасчета", лсзРез);
КонецПроцедуры
