////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ МОДУЛЯ

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

// Процедура - обработчик события "Перед открытием" формы отчета.
//
Процедура ПередОткрытием(Отказ, СтандартнаяОбработка)

	// Установим дату начала отчета
	Если ЗначениеЗаполнено(глЗначениеПеременной("глТекущийПользователь")) Тогда
		ДатаАктуальности = РабочаяДата;//глТекущийПользователь.ОсновнаяДатаНачалаОтчетов;
		//Организация = глТекущийПользователь.ОсновнаяОрганизация;
		РаботаСДиалогами.ЗаполнитьРеквизитыФормы(ЭтаФорма, глЗначениеПеременной("глТекущийПользователь"))
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(ДатаАктуальности) Тогда
		ДатаАктуальности = РабочаяДата
	КонецЕсли;

КонецПроцедуры // ПередОткрытием()

// Процедура - обработчик события "При открытии" формы отчета.
//
Процедура ПриОткрытии()

	Если НЕ ВладелецФормы = Неопределено Тогда
		
		ЕстьОшибки 	= 	Ложь;
		СформироватьОтчет(ЭлементыФормы.ДокументРезультат, ЕстьОшибки);
		Если ЕстьОшибки Тогда
			Сообщить("Ошибки...");
		КонецЕсли;
	Иначе
        ВидОтчета	=	"Форма6";
	КонецЕсли;

КонецПроцедуры // ПриОткрытии()

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ КОМАНДНЫХ ПАНЕЛЕЙ

// Процедура - обработчик нажатия кнопки "Сформировать"
//
Процедура КнопкаСформироватьНажатие(Элемент)

	ЕстьОшибки = Ложь;
	ПараметрОтбора 	= 	Организация;
	СформироватьОтчет(ЭлементыФормы.ДокументРезультат, ЕстьОшибки);

	Если ЕстьОшибки Тогда
		Сообщить("Ошибки...")
	КонецЕсли;
	
КонецПроцедуры // КнопкаСформироватьНажатие()

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ДИАЛОГА

////////////////////////////////////////////////////////////////////////////////
// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ

