
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ДействияФормыРедактироватьКод(Кнопка)
	МеханизмНумерацииОбъектов.ИзменениеВозможностиРедактированияНомера(Метаданные.Справочники.НалоговыеГруппыОсновныхСредств, ЭлементыФормы.СправочникСписок, ЭлементыФормы.ДействияФормы.Кнопки.Подменю, ЭлементыФормы.СправочникСписок.Колонки.Код);
КонецПроцедуры

Процедура ПриОткрытии()
	
	СправочникСписок.Порядок.Установить("Код Возр");
	ЭлементыФормы.СправочникСписок.НастройкаПорядка.Код.Доступность = Ложь;
	
	МеханизмНумерацииОбъектов.ДобавитьВМенюДействияКнопкуРедактированияКода(ЭлементыФормы.ДействияФормы.Кнопки.Подменю);
	МеханизмНумерацииОбъектов.УстановитьДоступностьПоляВводаНомера(Метаданные.Справочники.НалоговыеГруппыОсновныхСредств, ЭлементыФормы.СправочникСписок, ЭлементыФормы.ДействияФормы.Кнопки.Подменю, ЭлементыФормы.СправочникСписок.Колонки.Код);
	
КонецПроцедуры

Процедура СправочникСписокПриАктивизацииСтроки(Элемент)
	
	СтрокаСписка = Элемент.ТекущиеДанные;
	
	Если СтрокаСписка <> Неопределено Тогда
		
		ЭлементыФормы.СправочникДерево.ТекущаяСтрока = СтрокаСписка.Родитель;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура СправочникСписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, ЭтоГруппа)
	
	Если (НЕ ЭтоГруппа) И (НЕ ЗначениеЗаполнено(Родитель)) Тогда
		
		Сообщить(НСтр("ru='Можно добавлять элементы, только внутри групп. Это необходимо для их дальнейшей правильной обработки.';uk='Можна додавати елементи, тільки усередині груп. Це необхідно для їх подальшої правильної обробки.'"));
		Отказ = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура СправочникСписокПередИзменениемРодителя(Элемент, Отказ)
	
	Сообщить(НСтр("ru='Нельзя менять группу для элемента.';uk='Не можна міняти групу для елемента.'"));
	Отказ = Истина;
	
КонецПроцедуры

